[{
        "classes": "Sorcerer, Wizard",
        "components": "V, S, M (a bit of sponge)",
        "duration": "Instantaneous",
        "id": 2951,
        "level": 8,
        "name": "Abi-Dalzim’s Horrid Wilting (Improved)",
        "range": "150 feet",
        "ritual": 0,
        "school": "Necromancy",
        "sources": "Compendium Arcana",
        "text": "\tYou draw the moisture from every creature in a 30-foot cube centered on a point you choose within range. Each creature in that area must make a Constitution saving throw. Constructs and undead aren't affected, and plants and water elementals make this saving throw with disadvantage. A creature gains one level of exhaustion and takes 10d8 necrotic damage on a failed save, or half as much damage on a successful one. Creatures who succeed the save aren't exhausted. Plants and water elementals automatically take maximum damage.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "S",
        "duration": "Concentration, up to 1 minute",
        "id": 2966,
        "level": 4,
        "name": "Alter Momentum",
        "range": "Self",
        "ritual": 0,
        "school": "Transmutation",
        "sources": "Compendium Arcana",
        "text": "\tYou briefly gain insight into the powers of inertia, allowing you to speed up an object or creature against its will. When you cast this spell, one creature of your choice that you can see within 60 feet has disadvantage or advantage (your choice when you target the creature) on the next attack roll it makes as its movements accelerate or decelerate according to your will. You can also increase or decrease their speed by 10 feet, which lasts until the end of their next turn. You can invoke a similar power again using your bonus action as long as this spell is active. Instead of altering the momentum of a creature, you can do it to an object weighing less than 500 pounds that isn't being worn or carried. When you do so, ability checks made to move the object or alter its trajectory have advantage or disadvantage (your choice when you target the object) until the end of your next turn.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V, S, M (the heart of a dragon worth at least 2,500 gp, which the spell consumes)",
        "duration": "Instantaneous",
        "id": 2973,
        "level": 10,
        "name": "Anglin's Nova",
        "range": "Sight",
        "ritual": 0,
        "school": "Evocation",
        "sources": "Compendium Arcana",
        "text": "\tYou punch a hole in the fabric of reality at a point you can see within range, causing raw magic to burst forth for a split second. This burst emits bright light with the properties of sunlight out to a distance of 100 miles, and an earth-shattering boom out to a distance of 50 miles. Any creatures within 1 mile of the burst who can see the light when it appears are blinded.\\n\tCreatures within 1000 feet of the burst must make a Constitution saving throw, even if they are behind total cover. A target takes 15d6 + 50 force damage and 15d6 + 50 thunder damage on a failed save, or half as much damage on a successful one. Structures and objects not being worn or carried within this distance also take the damage, which is doubled against them.\\n\tIf this damage is enough to destroy objects or structures, they are obliterated, leaving behind traces of a white, scorched dust. Any creations of magical force are also obliterated. If this damage kills a creature or reduces it to 0 hit points it is obliterated in the same way, along with everything it is wearing and carrying except magical items. The creature can then only be restored to life by means of a true resurrection or wish spell.\\n",
        "time": "1 hour"
    }, {
        "classes": "None",
        "components": "V, S, M (an amount of silver or gold worth 5 gp, which the spell consumes)",
        "duration": "Instantaneous",
        "id": 2989,
        "level": 2,
        "name": "Arcane Alacrity",
        "range": "Self",
        "ritual": 0,
        "school": "Transmutation",
        "sources": "Compendium Arcana",
        "text": "\tYou imbue yourself with incredible speed for a brief moment, enabling you to cast a spell with a longer casting time as part of the same action of casting Arcane Alacrity. When you cast Arcane Alacrity, choose one other spell that you are currently able to cast (normally or as a ritual) and that has a casting time of 1 minute or longer. That spell is cast instantly, taking effect immediately after you cast this one. You must still expend a spell slot of the appropriate level for that spell, if applicable. You must still follow all components and rules of that spell. After doing so, you are paralyzed until the end of your next turn as the surge of magical power leaves you reeling.\\n",
        "time": "1 action"
    }, {
        "classes": "Cleric, Warlock, Wizard",
        "components": "S, M (a forked, metal rod worth at least 250 gp, attuned to a particular plane of existence)",
        "duration": "Special",
        "id": 3008,
        "level": 10,
        "name": "Astral Projection (Epic)",
        "range": "120 feet",
        "ritual": 0,
        "school": "Necromancy",
        "sources": "Compendium Arcana",
        "text": "\tYou and up to eight willing creatures within range project your astral bodies into a plane of your choosing, for which you need the forked, metal rod, or the astral plane, for which a rod is not needed. The spell fails and the casting is wasted if you are already on that plane. The material body you leave behind is unconscious and in a state of suspended animation; it doesn't need food, water, or air, it doesn't age, and its resistant to all damage.\\n\tYour astral body resembles your mortal form in almost every way, replicating your game statistics and possessions. The principal difference is the addition of a silvery cord that extends from between your shoulder blades and trails behind you, fading to invisibility after 1 foot. This cord is your tether to your material body. As long as the tether remains intact, you can find your way home. If the cord is cut—something that can happen only when an effect specifically states that it does—you must find a way back on your own.\\n\tYour astral form can freely travel through the chosen plane and can pass through portals there leading to any other plane. If you enter a new plane or return to the plane you were on when casting this spell, your body and possessions are transported along the silver cord, allowing you to re-enter your body as you enter the new plane. Your astral form is a separate incarnation. Any damage or other effects that apply to it have no effect on your physical body, nor do they persist when you return to it.\\n\tThe spell ends for you and your companions when you use your action to dismiss it. When the spell ends, the affected creature returns to its physical body, and it awakens. The spell also ends after 7 days (168 hours) have elapsed if you used the spell to travel to a plane other than the Astral Plane.\\n\tThe spell might also end early for you or one of your companions. A successful dispel magic spell used against an astral or physical body ends the spell for that creature. If a creature's original body or its astral form drops to 0 hit points, the spell ends for that creature. If the spell ends and the silver cord is intact, the cord pulls the creature's astral form back to its body, ending its state of suspended animation.\\n\tIf you are returned to your body prematurely, your companions remain in their spectral forms and must find their own way back to their bodies, usually by dropping to 0 hit points.\\n",
        "time": "1 minute"
    }, {
        "classes": "None",
        "components": "S, M (the tongue of a solar, worth at least 500 gp)",
        "duration": "Instantaneous",
        "id": 3011,
        "level": 10,
        "name": "Auma's Axiom",
        "range": "30 feet",
        "ritual": 0,
        "school": "Enchantment",
        "sources": "Compendium Arcana",
        "text": "\tYou gesture towards a creature you can see within range. In order to identify this gesture as a spell, a creature must succeed on a Wisdom (Perception) check versus your spell save DC. The target of the gesture must make a Wisdom saving throw or be effected, and creatures with 150 hit points or less fail this saving throw automatically. While effected, a creature regards you as someone closer to it than anyone else, and someone to be trusted and obeyed absolutely.\\n\tYou have an unbreakable telepathic bond with all creatures effected by you in this way, and a creature understands and obeys the commands it receives through this connection unfalteringly. You can command up to five creatures in this way, requiring no action, on your turn, and you can use your action to command any number of them this way.\\n\tYou can also use your action to take total and precise control of a creature through your telepathic bond. Until the end of your next turn, the creature takes only the actions you choose, and doesn't do anything that you don't allow it to do. During this time, you can also cause the creature to use a reaction, but this requires you to use your own reaction as well.\\n\tIf a creature effected by this spell dies, you can attempt to transfer the spell to another creature you can see within 30 feet of the body. The creature must make a Wisdom saving throw or be effected, and creatures with 150 hit points or less fail this saving throw automatically.\\n\tThis spell can only be ended with a wish spell. All other attempts to end or suppress it simply fail.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V, S",
        "duration": "Concentration, up to 10 minutes",
        "id": 3012,
        "level": 7,
        "name": "Aura of Invisibility",
        "range": "Self (20-foot radius)",
        "ritual": 0,
        "school": "Illusion",
        "sources": "Compendium Arcana",
        "text": "\tIllusionary magic wraps around you and nearby allies, hiding them from view. Until this spell ends, you and any willing creatures you choose within 20 feet of you become invisible when you cast this spell and at the start of each of their turns if they are within the spell's radius. Anything a creature is wearing or carrying is invisible as long as it is on their person. If a creature attacks, casts a spell, or ends their turn outside of the spell's radius, they become visible at the end of the current turn.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V, S",
        "duration": "Instantaneous",
        "id": 3052,
        "level": 8,
        "name": "Bolt of Fate",
        "range": "30 feet",
        "ritual": 0,
        "school": "Divination",
        "sources": "Compendium Arcana",
        "text": "\tYou briefly allow the currents of fate to guide your hand, releasing a bolt of pure magic to strike a creature you can see within range. The creature must make a Charisma saving throw. Roll 3d100's (3 percentile die) and choose one of the die. On a failed save, the die you chose is how many hit points the creature loses. A creatures loses half as many hit points on a successful save. Either way, a creature cannot lose more hit points than it currently has. This spell can be cast through scrying and divination sensors you're using without interrupting the sensor, even if you would not normally be able to cast through them.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "S",
        "duration": "1 hour",
        "id": 3083,
        "level": 3,
        "name": "Chatter",
        "range": "30 feet",
        "ritual": 0,
        "school": "Illusion",
        "sources": "Compendium Arcana",
        "text": "\tChoose up to five willing creatures you can see within range. Whenever those creatures speak, this spell alters their words, converting what they say into an illusory conversation about a topic of the caster's choice, in a language the caster knows. Each creature you choose hears what is actually said, while those not effected hear the illusory conversation instead. This spell also masks the mouths of the chosen creatures, so that they appear to pronounce the illusory words correctly. The topic of the illusory conversation and language used is choosen by the caster. If a creature under the influence of this spell moves out of range, or if they choose to end it as an action, the effect ends for them, and they can no longer hear what is truly being said. A creature can use their action to make an Intelligence (Investigation) check to against your spell save DC. On a success, the illusory conversation becomes faint and hollow sounding to them, and they can hear the actual conversation and see the actual words being said.\\n",
        "time": "1 action"
    }, {
        "classes": "Sorcerer, Warlock, Wizard",
        "components": "V, S, M (a bit of sponge)",
        "duration": "Instantaneous",
        "id": 3089,
        "level": 6,
        "name": "Circle of Death (Improved)",
        "range": "150 feet",
        "ritual": 0,
        "school": "Necromancy",
        "sources": "Compendium Arcana",
        "text": "\tA wave of negative energy ripples out in a 60-foot radius sphere centered on a point you choose within range, thinning the veil between life and death. Each creature in that area must make a Constitution saving throw. A target takes 5d10 necrotic damage on a failed save, or half as much damage on a successful one. Undead affected by the spell regain hit points for the damage rolled on the dice, instead of taking damage.\\n\tIn addition, creatures that fail their saving throw mark off a failed Death saving throw, even if they are not dying. If a creature begins dying and rolls Death saving throws as usual, they keep any failed Death saving throws already present. When a creature reaches three failed death saving throws at any time, it dies.\\n\tDeath saving throws failed because of this property of circle of death are only reset by a greater restoration spell or similar magic.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V, S",
        "duration": "1 hour",
        "id": 3106,
        "level": 0,
        "name": "Concealment",
        "range": "Touch",
        "ritual": 0,
        "school": "Illusion",
        "sources": "Compendium Arcana",
        "text": "\tAn object you touch, smaller than 1 cubic foot, blurs into insignificance. For the duration of this spell, any creature that searches someone concealing that item must make a Wisdom saving throw. On a failed save, the creature fails to notice the item, and cannot make an ability check to find it. On a success, the creature is immune to the effect of this cantrip on that item for 1 hour, and may make an appropriate ability check to find the item. If the concealed object is threatening or out of place, the creature has advantage on the saving throw. You can only effect one target using this spell.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V",
        "duration": "Instantaneous",
        "id": 3123,
        "level": 0,
        "name": "Conjure Wealth",
        "range": "10 feet",
        "ritual": 0,
        "school": "Conjuration",
        "sources": "Compendium Arcana",
        "text": "\tYou speak an arcane phrase, causing coins worth a combined total of 2d6 gp to appear in an unoccupied space you can see within range. The coins can take the form of any combination of copper, silver, gold, or platinum pieces. Once you conjure coins in this way, you cannot do so again for 7 days (168 hours).\\n\tThe value of the coins created increases by 1d6 when you reach 5th level (3d6), 11th level (4d6), and 17th level (5d6)\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V, S, M (a piece of glass)",
        "duration": "1 hour",
        "id": 3146,
        "level": 1,
        "name": "Create Window",
        "range": "60 feet",
        "ritual": 0,
        "school": "Illusion",
        "sources": "Compendium Arcana",
        "text": "\tYou cause a relatively flat surface you can see within range to become ghostly and transparent to yourself and any creatures you choose, allowing them to see through it. This can affect an area of up to 5 square feet. The surface still appears opaque to other creatures, but those with truesight can see through it as you can. You can end the spell early as an action. This spell can make most barriers transparent, but it only penetrates up to 3 feet deep if the surface is wood or dirt, 1 foot if the surface is stone, 1 inch if it is a common metal, and is unable to see through lead.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the area of a surface you can effect increases by 5 feet for every spell slot level above 1st.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V, S, M (a flawless glass sphere worth at least 10,000 gp)",
        "duration": "Instantaneous",
        "id": 3156,
        "level": 10,
        "name": "Dalaundo's Destiny",
        "range": "Self",
        "ritual": 0,
        "school": "Divination",
        "sources": "Compendium Arcana",
        "text": "\tYou weave the fabric of destiny around you, granting you a shroud to protect you from detection. You can cause this shroud to become inactive as a bonus action. While inactive, it is undetectable, and has no effect. You can reactivate it as a bonus action or as a reaction whenever you are targeted by an attack or harmful effect.\\n\tWhile the shroud is active, you yourself, along with anything you're wearing or carrying, becomes hidden, as if you had made a successful check to hide, however impossible such a check would've been. Because of this, you can stand in the open and not be noticed, shout and not be heard, attack and not be discovered, and so on. You cannot be tracked or detected by magical or mundane means.\\n\tThe shroud and its effects cannot be dispelled, disrupted, or suppressed, and are so strong, even gods are often unable to penetrate them. After you have had the shroud active for a total of 10 days, the spell ends.\\n",
        "time": "1 minute"
    }, {
        "classes": "None",
        "components": "V, S, M (a pinch of wool)",
        "duration": "Instantaneous",
        "id": 3166,
        "level": 0,
        "name": "Daze",
        "range": "30 feet",
        "ritual": 0,
        "school": "Enchantment",
        "sources": "Compendium Arcana",
        "text": "\tChoose a humanoid that you can see within range. The target must succeed on a Wisdom saving throw or be incapacitated until the start of your next turn. An incapacitated creature's speed is 0. If a target has 50 or more hit points, they are unaffected.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V, S, M (A crystal of adamantine worth at least 5,000gp, which the spell consumes)",
        "duration": "Concentration, up to 7 days",
        "id": 3178,
        "level": 10,
        "name": "Denak's Avatar",
        "range": "Self",
        "ritual": 0,
        "school": "Abjuration",
        "sources": "Compendium Arcana",
        "text": "\tYou adopt a powerful avatar of protection for the duration. While in this avatar form you are immune to damage, can't be affected or detected by magic unless you wish to be, and are immune to exhaustion.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V, S",
        "duration": "Concentration, up to 1 hour",
        "id": 3188,
        "level": 3,
        "name": "Direct Weather",
        "range": "Self (30-foot radius)",
        "ritual": 0,
        "school": "Transmutation",
        "sources": "Compendium Arcana",
        "text": "\tYou gain the ability to change the course of weather in a 30-foot radius around you. When you cast this spell and as an action on each of your turns before the spell ends, you can choose one of the following effects, which last until the end of your next turn. This spell has no effect on magical weather. Direct Rain. If it is raining, you can cause it to cease or to increase in intensity. If you choose to increase the rain's intensity, the area becomes lightly obscured. Direct Wind. If it is windy or calm, you can change the wind's direction or cause wind to blow in a direction you choose, increase the wind's intensity, or cause it to become calm. If you increase the wind's intensity, it increases its speed by 10 mph.\\n",
        "time": "1 minute"
    }, {
        "classes": "None",
        "components": "S, M (a dragon scale worth 100gp, which the spell consumes)",
        "duration": "8 hours",
        "id": 3206,
        "level": 8,
        "name": "Dragonhide",
        "range": "Touch",
        "ritual": 0,
        "school": "Transmutation",
        "sources": "Compendium Arcana",
        "text": "\tThis spell makes the flesh of a willing creature you touch as tough as dragon's hide. For the duration, the target's AC can't be less than 24, regardless of what kind of armor it is wearing.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V, S",
        "duration": "Concentration, up to 1 hour",
        "id": 3226,
        "level": 6,
        "name": "Eclipse",
        "range": "150 feet",
        "ritual": 0,
        "school": "Illusion",
        "sources": "Compendium Arcana",
        "text": "\tMagical darkness spreads from a point you choose within range to fill a 60-foot radius sphere for the duration. A creature with darkvision can't see through this darkness, and nonmagical light can't illuminate it. If a spell that deals radiant or fire damage damage would pass through the darkness or affect something within it, the caster must make a spellcasting ability check contested by your own. If you succeed, the other spell fails. If the other caster succeeds, the other spell is cast as normal. If any of this spell's area overlaps with an area of light created by a spell of 6th level or lower, the spell that created the light is dispelled.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V, S",
        "duration": "Instantaneous",
        "id": 3242,
        "level": 1,
        "name": "Eronin's Erasure",
        "range": "30 feet",
        "ritual": 0,
        "school": "Transmutation",
        "sources": "Compendium Arcana",
        "text": "\tYou remove writings of either magical or mundane nature from a scroll or from one or two pages of paper, parchment, or similar surfaces less than 2 feet in any dimension. If you target a piece of nonmagical writing you can see within range, the writing is automatically erased if no one else is holding it. If the writing is being held by a creature, there's a 10 percent chance for the writing to remain. If you try to erase magical writing with this spell, you must make a spellcasting ability check with a DC equal to 10 + the spell's level, or DC 10 for low-level magic, DC 15 for mediumlevel magic, and DC 20 for high-level magic, at the DM's discretion.\\n",
        "time": "1 minute"
    }, {
        "classes": "None",
        "components": "V, S",
        "duration": "Instantaneous",
        "id": 3243,
        "level": 3,
        "name": "Eronin's Mnemonic Enhancer",
        "range": "Self",
        "ritual": 0,
        "school": "Transmutation",
        "sources": "Compendium Arcana",
        "text": "\tCasting this spell strengthens your mind and memory, allowing you to prepare additional spells. When you cast this spell just before you begin to prepare spells following a long rest, you can prepare up to 3 additional levels of spells in any combination. For instance, you could prepare an additional 2nd level spell and a 1st level spell, or three 1st level spells. You still cast these spells normally.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 4th level or higher, you can prepare 1 additional level of spell for every spell slot level above 3rd.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "S",
        "duration": "Instantaneous",
        "id": 3257,
        "level": 4,
        "name": "Fade",
        "range": "Self",
        "ritual": 0,
        "school": "Illusion",
        "sources": "Compendium Arcana",
        "text": "\tWhen you are targetted by an attack or spell from a creature you can see, you fade from view, becoming invisible as a defensive measure. You and everything you are wearing or carrying remains invisible until the end of your next turn, or until you attack or cast a spell.\\n",
        "time": "1 reaction, which you take when you targetted by an attack or spell"
    }, {
        "classes": "None",
        "components": "V, S, M (a piece of glass)",
        "duration": "Instantaneous",
        "id": 3288,
        "level": 0,
        "name": "Flare",
        "range": "5 feet",
        "ritual": 0,
        "school": "Evocation",
        "sources": "Compendium Arcana",
        "text": "\tWhen a creature targets you with a melee weapon attack, you throw up your hand in a distracting manner and create a small flash of light to briefly blind the creature. The attacking creature must make a Constitution saving throw or have disadvantage on the triggering attack. An attacker is immune to this effect if it does not rely on sight, as with blindsight, or can see through illusions, as with truesight.\\n",
        "time": "1 reaction"
    }, {
        "classes": "None",
        "components": "S, M (a purse or pouch threaded with copper, worth 5 gp)",
        "duration": "10 minutes",
        "id": 3296,
        "level": 1,
        "name": "Fool's Gold",
        "range": "Self",
        "ritual": 0,
        "school": "Conjuration",
        "sources": "Compendium Arcana",
        "text": "\tYou smoothly snap your fingers, and cause 6d4 gold pieces to appear in the purse you use to cast this spell. The pieces take the form of the most common type of gold piece found within 1 mile of you. The coins vanish when the spell ends, or when you choose to end the spell as an action.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the number of gold pieces created increases by 4d4 for every spell slot level above 1st.\\n",
        "time": "1 bonus action"
    }, {
        "classes": "Bard, Druid, Warlock, Wizard",
        "components": "S",
        "duration": "8 hours",
        "id": 3299,
        "level": 10,
        "name": "Foresight (Epic)",
        "range": "Touch",
        "ritual": 0,
        "school": "Divination",
        "sources": "Compendium Arcana",
        "text": "\tYou touch a willing creature and bestow a limited ability to see into the immediate future. For the duration, the target can't be surprised and has advantage on attack rolls, ability checks, and saving throws. Additionally, other creatures have disadvantage on attack rolls, ability checks, and saving throws caused by the target under foresight for the duration.\\n\tThis spell immediately ends if you cast it again before its duration ends.\\n",
        "time": "1 minute"
    }, {
        "classes": "Cleric, Sorcerer, Wizard",
        "components": "V, S",
        "duration": "Until dispelled",
        "id": 3311,
        "level": 10,
        "name": "Gate (Epic)",
        "range": "Fight",
        "ritual": 0,
        "school": "Conjuration",
        "sources": "Compendium Arcana",
        "text": "\tYou conjure a portal linking an unoccupied space you can see to a precise location on a different (or the same) plane of existence. The portal is a circular opening, which you can make 1 to 30 feet in diameter. You can orient the portal in any direction you choose. The portal lasts until the caster chooses to dismiss it on their turn as an action, or until it is dispelled.\\n\tThe portal has a front and a back on each plane where it appears. It can also appear as invisible. Travel through the portal is possible only by moving through its front. Anything that does so is instantly transported to the other portal, appearing in the unoccupied space nearest to the portal.\\n\tDeities and other planar rulers can prevent portals created by this spell from opening in their presence or anywhere within their domains.\\n\tWhen you cast this spell, you can speak the name, pseudonym, title, or nickname of a specific creature. The portal opens in the named creature's immediate vicinity and draws the creature through it to the nearest unoccupied space on your side of the portal. You gain no special power over the creature, and it is free to act as the DM deems appropriate. It might leave, attack you, or help you.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V, S, M (a pinch of powdered flower petals)",
        "duration": "10 minutes",
        "id": 3324,
        "level": 5,
        "name": "Glitterdust",
        "range": "90 feet",
        "ritual": 0,
        "school": "Conjuration",
        "sources": "Compendium Arcana",
        "text": "\tA cloud of golden particles explodes from a point you choose within range, covering creatures and objects within a 10-foot radius of that point with sparkling dust. While covered by the dust, a creature is blinded, has disadvantage on Dexterity (Stealth) checks, and gains no benefit from being invisible. Both objects and creatures covered in the dust shed dim light out to a radius of 10 feet. A creature can use their action to attempt to remove the dust from their eyes or from another creature's. They must make a Dexterity (Sleight of Hand) check versus your spell save DC. On a success, that creature is no longer blinded. The rest of the dust can only be removed by spending 1 minute to wash it off. The dust disappears when the spell ends.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "S",
        "duration": "Instantaneous",
        "id": 3408,
        "level": 2,
        "name": "Impart Thought",
        "range": "Touch",
        "ritual": 0,
        "school": "Divination",
        "sources": "Compendium Arcana",
        "text": "\tYou quickly and silent impart an idea of your choice to a willing creature you touch. This spell allows you to communicate one thought, which can be as complex as you like, (such as maps, diagrams, explanatory images – which may move in a sequence to show a procedure – and the like) silently to the recipient. Uses for this spell include showing the target a creature's likeness to aid in recognition or a clear route to an unfamiliar place.\\n",
        "time": "1 action"
    }, {
        "classes": "Warlock, Wizard",
        "components": "V, S, M (a special component that varies according to the version of the spell you choose, worth at least 300 gp per Hit Die of the target with the most Hit Die)",
        "duration": "Until dispelled",
        "id": 3410,
        "level": 10,
        "name": "Imprisonment (Epic)",
        "range": "30 feet",
        "ritual": 0,
        "school": "Abjuration",
        "sources": "Compendium Arcana",
        "text": "\tYou create a magical restraint to hold up to three creatures that you can see within range. Each target must succeed on a Wisdom saving throw or be bound by the spell; if it succeeds, it is restrained, and must make saving throws at the end of each round of combat. Upon failing the save twice, the spell takes effect, and it ends on two successes. The successes and failures don't need to be consecutive. A creature that succeeds on its saving throw to fully resist the spell are immune to its effects for 1 month.\\n\tWhile affected by this spell, the creature doesn't need to breathe, eat, or drink, and it doesn't age. Divination spells can't locate or perceive the target.\\n\tWhen you cast the spell, you choose one of the following forms of imprisonment:\\n\tBurial: The target is entombed far in the outer realms in a sphere of magical force that is just large enough to contain the target. Nothing can pass through the sphere, nor can any creature teleport or use planar travel to get into or out of it. The special component for this version of the spell is a small, perfectly crafted mithril orb.\\n\tHedged Prison: The spell transports the target into a demiplane that is warded against teleportation and planar travel. The demiplane can be a labyrinth, a cage, a tower, or any similar confined structure or area of your choice. The special component for this version of the spell is a miniature representation of the prison made from jade.\\n\tMinimus Containment: The target shrinks to a height of 1 inch and is imprisoned inside a gemstone or similar object. Light can pass through the gemstone normally (allowing the target to see out and other creatures to see in), but nothing else can pass through, even by means of teleportation or planar travel. The gemstone can't be cut or broken while the spell remains in effect. The caster of the spell can use an action and allow the creature(s) inside the gemstone to communicate telepathically with any creature within 5 feet. The special component for this version of the spell is a transparent gemstone, such as a corundum, diamond, or ruby.\\n\tSlumber: The target becomes catatonic and cannot be woken. Creatures not normally affected by sleep are still affected by this. The special component for this version of the spell is a rare combination of herbs.\\n\tEnding the Spell: During the casting of the spell, in any of its versions, you can specify a condition that will cause the spell to end and release the targets. The condition can be as specific or as elaborate as you choose, but the DM must agree that the condition is has a likelihood of coming to pass. The conditions can be based on a creature's name, identity, or deity but otherwise must be based on observable actions or qualities and not based on intangibles such as level, class, or hit points. This spell cannot end prematurely by any means other than the specified condition.\\n\tYou can use a particular special component to imprison multiple creatures at a time, as long as they have less hit dice than the creature imprisoned that has the most hit dice. If you cast the spell again using the same component, the new target joins the previous one in its imprisonment. Each component can have up to three creatures imprisoned by it at a time.\\n",
        "time": "1 minute"
    }, {
        "classes": "None",
        "components": "V, S",
        "duration": "Instantaneous",
        "id": 3423,
        "level": 5,
        "name": "Inversify",
        "range": "120 feet",
        "ritual": 0,
        "school": "Illusion",
        "sources": "Compendium Arcana",
        "text": "\tYou play on a creature's deepest insecurities, conjuring a terrible illusion based on their shortcomings to assault them. One creature you can see within range must make an Intelligence saving throw or take psychic damage equal to the sum of all the damage it's taken within the last minute. A creature takes half of this damage on a successful save. In either case, this can deal a maximum of 45 damage.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 6th level or higher, the maximum damage this spell can do increases by 15 for every spell slot level above 5th.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V, S",
        "duration": "Concentraction, up to 1 minute",
        "id": 3435,
        "level": 9,
        "name": "Karma",
        "range": "60 feet",
        "ritual": 0,
        "school": "Divination",
        "sources": "Compendium Arcana",
        "text": "\tYou seize control of the possible future, and bend your enemie's fate to your will. Each creature you choose within a 40 foot cube centered on a point within range must make a Wisdom saving throw or have its fate be altered until the spell ends. A creature can repeat this saving throw at the end of each of its turns, ending the effect on itself on a success. A creature who's fate is altered has disadvantage on attack rolls, ability checks, and saving throws, and their proficiency bonus is reduced by 1.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "S, M (a wax seal)",
        "duration": "24 hours",
        "id": 3487,
        "level": 0,
        "name": "Marvelous Letter",
        "range": "Touch",
        "ritual": 0,
        "school": "Conjuration",
        "sources": "Compendium Arcana",
        "text": "\tYou conjure a letter containing a message of up to 100 words in front of you. It flies to a target that you designate at a speed of 6 mph. If it does not reach the target in 24 hours, it disappears. This letter cannot be dampened or torn, but when a creature presses the seal it opens. If the designated target touches it in any way, it opens. When the letter opens, the spell ends.\\n",
        "time": "1 minute"
    }, {
        "classes": "None",
        "components": "V, S, M (a lodestone and a pinch of ash)",
        "duration": "Instantaneous",
        "id": 3489,
        "level": 9,
        "name": "Mass Disintegrate",
        "range": "300 feet",
        "ritual": 0,
        "school": "Transmutation",
        "sources": "Compendium Arcana",
        "text": "\tUp to eight thin green rays spring from you, each striking a target that you can see within range. A target can be a creature, an object, or a creation of magical force, such as the wall created by wall of force. Each creature can only be hit by one ray. A creature targeted by a ray must make a Dexterity saving throw. On a failed save, the target takes 10d6 + 60 force damage. If this damage reduces the target to 0 hit points, it is disintegrated. A disintegrated creature and everything it is wearing and carrying, except magic items, are reduced to a pile of fine gray dust. The creature can be restored to life only by means of a true resurrection or a wish spell. A ray automatically disintegrates a large or smaller nonmagical object or creation of magical force. If a target is a huge or larger object or creation of force, a ray disintegrates a 20-foot-cube portion of it. A magic item is unaffected by these rays.\\n",
        "time": "1 action"
    }, {
        "classes": "Cleric",
        "components": "V, S",
        "duration": "Instantaneous",
        "id": 3491,
        "level": 10,
        "name": "Mass Heal (Epic)",
        "range": "300 feet",
        "ritual": 0,
        "school": "Evocation",
        "sources": "Compendium Arcana",
        "text": "\tA flood of healing energy flows from you into creatures around you. You restore up to 1000 hit points, divided as you choose among any number of creatures that you are aware of within range. Creatures healed by this spell act as if they had lesser restoration cast upon them. You can choose different lesser restoration effects for each creature. This spell heals undead and constructs.\\n",
        "time": "1 action"
    }, {
        "classes": "Sorcerer, Wizard",
        "components": "V, S",
        "duration": "Instantaneous",
        "id": 3507,
        "level": 10,
        "name": "Meteor Swarm (Epic)",
        "range": "Sight",
        "ritual": 0,
        "school": "Evocation",
        "sources": "Compendium Arcana",
        "text": "\tBlazing orbs of fire plummet to the ground at ten different points you can see. Each creature in a 40-foot-radius sphere centered on each point you choose must make a Dexterity saving throw. The sphere spreads around corners. A creature takes 10d6 fire damage and 10d6 bludgeoning damage on a failed save, or half as much damage on a successful one. A creature in the area of more than one fiery burst is affected only once.\\n\tThe spell damages objects in the area, ignites flammable objects that aren't being worn or carried, and deals double damage to structures.\\n",
        "time": "1 action"
    }, {
        "classes": "Bard, Wizard",
        "components": "V, S",
        "duration": "Concentration, up to 1 minute",
        "id": 3527,
        "level": 7,
        "name": "Mordenkainen's Sword (Improved)",
        "range": "30 feet",
        "ritual": 0,
        "school": "Evocation",
        "sources": "Compendium Arcana",
        "text": "\tYou create a sword-shaped plane of force that hovers within range. It lasts for the duration.\\n\tWhen the sword appears, you can move the sword up to 30 feet, and make up to three melee spell attacks. Each creature or object can only be hit once until the end of your turn. On a hit, a target takes force damage equal to 4d6 plus your spellcasting ability modifier. If a creature moves away from the sword in a way that could trigger an Opportunity Attack, as if a creature occupied the sword's space, you can use your reaction to make one attack against it using the sword.\\n\tUntil the spell ends, you can use a bonus action on each of your turns to move the sword up to 30 feet and repeat the three attacks against the same targets or different ones.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V, S, M (one solid diamond cube worth at least 5,000 gp for every level of the spell you wish to make permanent, which the spell consumes)\\n    ",
        "duration": "Instantaneous",
        "id": 3560,
        "level": 8,
        "name": "Permanency",
        "range": "Self",
        "ritual": 0,
        "school": "Abjuration",
        "sources": "Compendium Arcana",
        "text": "\tThis spell makes another spell permanent by altering the very nature of its magic, stretching the spell across time itself. The first spell you cast after casting Permanency that has a duration of 1 minute or longer is made permanent. A permanent spell has a duration of Until Dispelled, regardless of the spell's description. It is surppressed inside an area of antimagic. If the spell is of 7th level or lower, ability checks made to dispell it treat it as an 8th level spell.\\n",
        "time": "1 hour"
    }, {
        "classes": "None",
        "components": "S, M (a sheet of parchment and 10 gp worth of cut gems, which the spell consumes)",
        "duration": "Until dispelled",
        "id": 3567,
        "level": 2,
        "name": "Pictograph",
        "range": "Self",
        "ritual": 0,
        "school": "Transmutation",
        "sources": "Compendium Arcana",
        "text": "\tYou transmute a sheet of parchment you hold to flawlessly portray a flat depiction of what you see when you cast the spell. Even if the sheet is larger, the depiction you produce can be no more than 1 foot by 1 foot, and captures only what you see. The sheet is not dyed or an illusion. Rather, the sheet is physically transmuted, and remains that way until dispelled. The transmuted sheet appears indistinguishable from a very true-to-life painting.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V",
        "duration": "Concentration, up to 1 minute",
        "id": 3578,
        "level": 4,
        "name": "Portend Luck",
        "range": "120 feet",
        "ritual": 0,
        "school": "Divination",
        "sources": "Compendium Arcana",
        "text": "\tYou tune into a creature's luck, and gain insight into their future. One creature you can see within range must make a Charisma saving throw. A creature can choose to willingly fail this saving throw. On a failed save, roll 1d20, and record the number rolled. Until the spell ends, you can replace one attack roll, saving throw, or ability check made by you or the target creature with the recorded d20 roll. You can do so after the die is rolled, but before any of its effects occur. Once you do so, the spell ends.\\n",
        "time": "1 action"
    }, {
        "classes": "Bard",
        "components": "S",
        "duration": "Instantaneous",
        "id": 3580,
        "level": 10,
        "name": "Power Word Heal (Epic)",
        "range": "60 feet",
        "ritual": 0,
        "school": "Evocation",
        "sources": "Compendium Arcana",
        "text": "\tA wave of healing energy washes over the creature you choose. The target regains all its hit points and hit dice. If the creature is charmed, frightened, paralyzed, stunned, incapacitated, petrified, poisoned, prone, or any combination of the above, the conditions end for that creature. The creature loses all levels of exhaustion, if it has any.\\n",
        "time": "1 bonus action"
    }, {
        "classes": "Bard, Sorcerer, Warlock, Wizard",
        "components": "V",
        "duration": "Instantaneous",
        "id": 3582,
        "level": 10,
        "name": "Power Word Kill (Epic)",
        "range": "120 feet",
        "ritual": 0,
        "school": "Enchantment",
        "sources": "Compendium Arcana",
        "text": "\tYou utter a word of power that can compel one creature you can see within range to die instantly. If the creature you choose has 300 hit points or fewer, it dies. Otherwise this spell has no effect.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V",
        "duration": "Instantaneous",
        "id": 3583,
        "level": 7,
        "name": "Power Word Pacify",
        "range": "30 feet",
        "ritual": 0,
        "school": "Enchantment",
        "sources": "Compendium Arcana",
        "text": "\tYou utter a word of power that can compel one creature you see within range to become calm. If the target has 150 hit points or fewer, it is pacified. Otherwise, the spell has no effect. While the target is pacified, it can't willingly act in a way that damages other creatures. A pacified creature can make a Wisdom saving throw at the end of each of its turns, ending the effect on itself on a success. It can also make this saving throw the first time it takes damage on a turn.\\n",
        "time": "1 action"
    }, {
        "classes": "Warlock, Wizard",
        "components": "V, S, M (a clear, crystal or glass orb)",
        "duration": "1 minute",
        "id": 3619,
        "level": 2,
        "name": "Ray of Enfeeblement (Improved)",
        "range": "90 feet",
        "ritual": 0,
        "school": "Necromancy",
        "sources": "Compendium Arcana",
        "text": "\tA black beam of enervating energy springs from your finger toward a creature within range. The creature must make a Constitution saving throw. On a failed save, the target's speed is reduced by 10 feet, the target deals half damage with melee weapon attacks, and the target has disadvantage on Strength and Dexterity checks.\\n\tAt the end of each of the target's turns, it can make a Constitution saving throw against the spell. On a success, the spell ends.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "S, M (a book or several sheets of parchment)",
        "duration": "Instantaneous",
        "id": 3624,
        "level": 0,
        "name": "Razor Tome",
        "range": "30 feet",
        "ritual": 0,
        "school": "Transmutation",
        "sources": "Compendium Arcana",
        "text": "\tYou momentarily transmute several pieces of parchment to have razor sharp edges as they fly out to slice a creature in range, before safely returning to your book or hand. Choose one creature within range, or two creatures within range that are within 5 feet of each other. A single target must succeed on a Dexterity saving throw or take 2d4 slashing damage. If you selected two targets, each one must succeed on a Dexterity saving throw or take 1d4 slashing damage.\\n\tThis spell's damage increases by 2d4 when you reach 5th level (4d4), 11th level (6d4), and 17th level (8d4). You can target a number of creatures in range up to the number of damage dice you roll for this spell, and can split up the damage dice however you like.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "S",
        "duration": "Instantaneous",
        "id": 3625,
        "level": 6,
        "name": "Redirect Spell",
        "range": "60 feet",
        "ritual": 0,
        "school": "Abjuration",
        "sources": "Compendium Arcana",
        "text": "\tYou attempt to redirect the magic of a spell cast by another creature you can see within range. The spell being cast can only target one creature or one point to be eligible for redirection. If it is a spell of 6th level or lower, it's effects are redirected to another target of your choice that you can see within 60 feet of you, as if that target was the spell's original destination. If the redirected spell requires concentration, you can decide to maintain concentration on it, instead of the original caster. The spell still uses the original caster's spell save DC and spellcasting ability modifier. If the original spell is 7th level or higher, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, the spell is redirected.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 7th level or higher, the original spell is redirected if its level is less than or equal to the level of the spell slot you used.\\n",
        "time": "1 reaction, which you take when you see a creature within range cast a spell"
    }, {
        "classes": "None",
        "components": "V, S, M (a gold dragon scale worth at least 200 gp, which the spell consumes)",
        "duration": "Concentration, up to 7 days",
        "id": 3647,
        "level": 10,
        "name": "Safiya's Metamorphosis",
        "range": "1 mile",
        "ritual": 0,
        "school": "Transmutation",
        "sources": "Compendium Arcana",
        "text": "\tYou transmute any non-living, non-magical matter within a 30-foot radius sphere centered on a point you can see within range. The matter changes into a different material of your choice. You can change all matter within the sphere into one material, or you can change different types of matter into different materials. A new material can be anything, so long as you have seen it before. It then replaces the old material, occupying the same space, size, and shape the old one did.\\n\tFor example, you could turn an iron sword with a gold pommel into an adamantine sword with a diamond pommel, or transform all of it into acid. You could transform molten rock into a flower-scented breeze, fire into wine, and anything in-between.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "S",
        "duration": "Until Dispelled",
        "id": 3656,
        "level": 5,
        "name": "Seal",
        "range": "120 feet",
        "ritual": 0,
        "school": "Abjuration",
        "sources": "Compendium Arcana",
        "text": "\tOne door, window, gate, chest, or other entryway or container of your choice that you can see within range closes and becomes locked for the duration. Any creatures in the way of a closing object are shunted to one side of your choice. You and creatures you designate when you cast this spell can open the object normally. You can also set a password that, when spoken within 5 feet of the object, suppresses this spell for 1 round. Otherwise, it is impassable and unbreakable until the spell is dispelled or suppressed. Ability checks to dispel it are made with disadvantage.\\n",
        "time": "1 action"
    }, {
        "classes": "Druid, Wizard",
        "components": "V, S, M (a jade circlet worth at least 5,000 gp, which you must place on your head before you cast the spell)",
        "duration": "Concentration, up to 1 hour",
        "id": 3674,
        "level": 10,
        "name": "Shapechange (Epic)",
        "range": "Self",
        "ritual": 0,
        "school": "Transmutation",
        "sources": "Compendium Arcana",
        "text": "\tYou assume the form of a different creature for the duration. The new form can be of any creature with a challenge rating equal to 24 or lower. You must have seen the creature at least once. You transform into an average example of that creature, one without any class levels or the Spellcasting trait. You gain any Innate Spellcasting trait of the creature, however.\\n\tYour game statistics are replaced by the statistics of the chosen creature, though you can retain your alignment and Intelligence, Wisdom, and Charisma scores, or any combination thereof. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus listed in its statistics is higher than yours, use the creature's bonus in place of yours. You can't use any lair actions of the new form.\\n\tYou assume the hit points and Hit Dice of the new form. When you revert to your normal form, you return to the number of hit points you had before you transformed. If you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. As long as the excess damage doesn't reduce your normal form to 0 hit points, you aren't knocked unconscious.\\n\tYou retain the benefit of any features from your class, race, or other source and can use them, provided that your new form is physically capable of doing so. You can't use any special senses you have (for example, darkvision) unless your new form also has that sense. You can only speak if the creature can normally speak.\\n\tWhen you transform, you choose whether your equipment falls to the ground, merges into the new form, or is worn by it. Worn equipment functions as normal. The DM determines whether it is practical for the new form to wear a piece of equipment, based on the creature's shape and size. Your equipment doesn't change shape or size to match the new form, and any equipment that the new form can't wear must either fall to the ground or merge into your new form. Equipment that merges has no effect in that state.\\n\tDuring this spell's duration, you can use your bonus action to assume a different form following the same restrictions and rules for the original form, with one exception: if your new form has more hit points than your current one, your hit points remain at their current value.\\n",
        "time": "1 bonus action"
    }, {
        "classes": "None",
        "components": "V, S",
        "duration": "Instantaneous",
        "id": 3718,
        "level": 6,
        "name": "Sphere of Sound",
        "range": "120 feet",
        "ritual": 0,
        "school": "Evocation",
        "sources": "Compendium Arcana",
        "text": "\tDeafening sounds, ranging from thunderous booms to metallic shrieks, expand to fill a 30-foot radius sphere centered on a point you can see within range. Each creature within the sphere must make a Constitution saving throw. On a failed save, a creature takes 8d8 thunder damage and is deafened for 1d8 hours. A creature takes half as much damage on a successful save, and isn't deafened. This sound can be heard up to 10 miles away.\\n",
        "time": "1 action"
    }, {
        "classes": "Druid",
        "components": "V, S",
        "duration": "Concentration, up to 1 minute",
        "id": 3741,
        "level": 10,
        "name": "Storm of Vengeance (Epic)",
        "range": "Sight",
        "ritual": 0,
        "school": "Conjuration",
        "sources": "Compendium Arcana",
        "text": "\tA churning storm cloud forms, centered on a point you can see and spreading to a radius of 500 feet. Lightning flashes in the area, thunder booms, and strong winds roar. Each creature under the cloud (no more than 10,000 feet beneath the cloud) when it appears must make a Constitution saving throw. On a failed save, a creature takes 5d6 thunder damage and becomes deafened for 5 minutes.\\n\tEach round you maintain concentration on this spell, the storm produces additional effects on your turn.\\n\tRound 2: Acidic rain falls from the cloud. Each creature and object under the cloud takes 5d6 acid damage. Metal structures take double damage as they deteriorate.\\n\tRound 3: You call ten bolts of lightning from the cloud to strike ten creatures or objects of your choice beneath the cloud. A given creature or object can't be struck by more than one bolt. A struck creature must make a Dexterity saving throw. The creature takes 10d6 lightning damage on a failed save, or half as much damage on a successful one.\\n\tRound 4: Hailstones rain down from the cloud. Each creature under the cloud takes 5d6 bludgeoning damage. Structures take double damage.\\n\tRound 5-10: Gusts and freezing rain assail the area under the cloud. The area becomes difficult terrain and is heavily obscured. Each creature there takes 5d6 cold damage. Ranged weapon attacks in the area are impossible. Creatures maintaining concentration on spells must make a concentration check equal to your spell save DC at the end of each of their turns. Finally, gusts of strong wind (ranging from 20 to 50 miles per hour) automatically disperse fog, mists, and similar phenomena in the area, whether mundane or magical. Structures take 5d6 bludgeoning damage each turn.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V, S, M (a jar of snake oil)",
        "duration": "Concentration, up to 1 minute",
        "id": 3768,
        "level": 9,
        "name": "Terrifying Visage",
        "range": "Self",
        "ritual": 0,
        "school": "Illusion",
        "sources": "Compendium Arcana",
        "text": "\tYou adopt a horrific appearance, using illusory magic to change your features so they resemble that of a medusa. When a creature that can see you starts its turn within 60 feet of you, you can force it to make a Constitution saving throw. If the saving throw fails by 7 or more, the creature is instantly petrified. Otherwise, a creature that fails the save begins to turn to stone and is restrained. The restrained creature must repeat the saving throw at the end of its next turn, becoming petrified on a failed save or ending the effect on a success. The petrification lasts until the creature is freed by the greater restoration spell or other magic. Unless surprised, a creature can avert its eyes to avoid the saving throw at the start of its turn. If the creature does so, it can't see you until the start of its next turn, when it can avert its eyes again. If the creature looks at you in the meantime, it must immediately make the save. A creature can use its action to make an Intelligence (Investigation) check to disbelieve the illusion, at which point the horrifying visage becomes faint and transparent. A creature cannot do this and avert its eyes. Creatures with truesight are unaffected by this spell.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V, S, M (a hunting horn carved from the wood of a tree grown in the Astral plane, worth at least 500 gp)",
        "duration": "Instantaneous",
        "id": 3769,
        "level": 10,
        "name": "Thalantyr's Summons",
        "range": "120 feet",
        "ritual": 0,
        "school": "Conjuration",
        "sources": "Compendium Arcana",
        "text": "\tThe greatest summoning spell a mortal can learn. You summon two creatures of challenge rating 24 or lower that appear within unoccupied spaces that you can see within range. The summoned creatures are friendly to you and your companions.\\n\tThe creatures are, for all intents and purposes, their own beings. Roll initiative for the summoned creatures separately. They understand and obey any commands that you issue to them without fail, and you can command them verbally on your turn (no action required by you). If you don't issue any commands to them, they act according to their nature, and according to the fact that they are friendly to you and your companions. The DM has the creatures' statistics.\\n",
        "time": "1 action"
    }, {
        "classes": "Sorcerer, Wizard",
        "components": "V",
        "duration": "Instantaneous",
        "id": 3783,
        "level": 10,
        "name": "Time Stop (Epic)",
        "range": "Self",
        "ritual": 0,
        "school": "Transmutation",
        "sources": "Compendium Arcana",
        "text": "\tYou briefly stop the flow of time for everyone but yourself. No time passes for other creatures, while you take 1d8 + 1 turns in a row, during which you can use actions and move as normal.\\n\tThis spell ends if one of the actions you use during this period, or any effects that you create during this period, affect a creature other than you or an object being worn or carried by someone other than you.\\n",
        "time": "1 bonus action"
    }, {
        "classes": "None",
        "components": "V, S",
        "duration": "Concentration, up to 7 days",
        "id": 3794,
        "level": 7,
        "name": "Traveler’s Ward",
        "range": "120 feet",
        "ritual": 0,
        "school": "Divination",
        "sources": "Compendium Arcana",
        "text": "\tYou summon a mystical ward to aid in the travel of those effected. Choose any number of willing creatures within range. Until this spell ends, those creatures gain the following benefits: Difficult terrain no longer costs them extra movement to traverse. They are immune to exhaustion. They take no damage from nonmagical plants and minor hazards, such as walking through brambles or over sharp rocks. They gain the effects of the sanctuary spell. If this effect ends for a creature, they regain the effect after 1 minute.\\n",
        "time": "1 hour"
    }, {
        "classes": "Bard, Warlock, Wizard",
        "components": "V, S, M (a drop of mercury, a dollop of gum arabic, and a wisp of smoke)",
        "duration": "Concentration, up to 1 hour",
        "id": 3798,
        "level": 10,
        "name": "True Polymorph (Epic)",
        "range": "90 feet",
        "ritual": 0,
        "school": "Transmutation",
        "sources": "Compendium Arcana",
        "text": "\tChoose one creature or a number of non-magical objects that you can see within range that have more than 0 hit points. You transform the creature into a different creature, the creature into an object, or the objects into creature (the objects must be neither worn nor carried by another creature). The transformation lasts for the duration, or until the target drops to 0 hit points or dies. If you concentrate on this spell for the full duration, the transformation becomes permanent.\\n\tAn unwilling creature can make a Wisdom saving throw, and if it succeeds, it isn't affected by this spell.\\n\tCreature into Creature: If you turn a creature into another kind of creature, the new form can be any kind you choose whose challenge rating is equal to or less than the target's (or its level, if the target doesn't have a challenge rating). The target's game statistics, including mental ability scores, are replaced by the statistics of the new form. It retains its alignment and personality.\\n\tThe target assumes the hit points of its new form, and when it reverts to its normal form, the creature returns to the number of hit points it had before it transformed. If it reverts as a result of dropping to 0 hit points, any excess damage carries over to its normal form. As long as the excess damage doesn't reduce the creature's normal form to 0 hit points, it isn't knocked unconscious.\\n\tThe creature is limited in the actions it can perform by the nature of its new form, and it can't speak, cast spells, or take any other action that requires hands or speech unless its new form is capable of such actions.\\n\tThe target's gear melds into the new form. The creature can't activate, use, wield, or otherwise benefit from any of its equipment.\\n\tObject into Creature: You can turn an object into any kind of creature, as long as the creature's size is no larger than the object's size and the creature's challenge rating is 10 or lower. You can target more objects if you change them into creatures of a challenge rating lower than 10. 10 objects can be transformed into 10 CR 1 creatures, 2 objects into 2 CR 5 creatures, and so on.\\n\tThe creature(s) are friendly to you and your companions. They act on each of your turns. You decide what action they take and how they move. The DM has the creature's statistics and resolves all of their actions and movement.\\n\tIf the spell becomes permanent, you no longer control the creature(s). They might remain friendly to you, depending on how you have treated them.\\n\tCreature into Object: If you turn a creature into an object, it transforms along with whatever it is wearing and carrying into that form. The creature's statistics become those of the object, and the creature has no memory of time spent in this form, after the spell ends and it returns to its normal form.\\n",
        "time": "1 action"
    }, {
        "classes": "Cleric, Druid",
        "components": "V, S, M (a sprinkle of holy water and diamonds worth at least 25,000 gp, which the spell consumes)",
        "duration": "Instantaneous",
        "id": 3800,
        "level": 10,
        "name": "True Resurrection (Epic)",
        "range": "Touch",
        "ritual": 0,
        "school": "Necromancy",
        "sources": "Compendium Arcana",
        "text": "\tYou touch a creature that has died. If the creature's soul is free and willing, the creature is restored to life with all its hit points.\\n\tIf the creature is unwilling, you make three ability checks versus those of the creature, one Intelligence, Wisdom, and Charisma check against those of the same nature. If you win the majority of the checks (caster wins ties), the spell is successful, otherwise it fails. If a soul is bound by some other entity, use those entity's stats for the checks.\\n\tThis spell closes all wounds, neutralizes any poison, cures all diseases, and lifts any curses affecting the creature when it died. The spell replaces damaged or missing organs and limbs.\\n\tThe spell can even provide a new body if the original no longer exists, in which case you must speak the creature's name, common title, or pseudonym. The creature then appears in an unoccupied space you choose within 10 feet of you.\\n",
        "time": "1 action"
    }, {
        "classes": "Wizard",
        "components": "V, S",
        "duration": "Concentration, up to 1 minute",
        "id": 3842,
        "level": 10,
        "name": "Weird (Epic)",
        "range": "120 feet",
        "ritual": 0,
        "school": "Illusion",
        "sources": "Compendium Arcana",
        "text": "\tDrawing on the deepest fears of a group of creatures, you create illusory creatures in their minds, visible only to them. Each creature of your choice in a 60-foot-radius sphere centered on a point you choose within range takes 4d10 psychic damage, and must make a Wisdom saving throw. On a failed save, a creature becomes frightened for the duration. The illusion calls on the creature's deepest fears, manifesting its worst nightmares as an implacable threat.\\n\tAt the start of each of the frightened creature's turns, it takes 4d10 psychic damage. An affected creature cannot willingly move closer to you, has disadvantage on ability checks and attack rolls, and cannot concentrate on spells. An affected creature can use an action on its turn to make an Intelligence (Investigation) check against your spell save DC. If the check is successful, the spell ends for that creature at the end of its current turn.\\n",
        "time": "1 action"
    }, {
        "classes": "Fighter (Eldritch Knight), Sorcerer, Warlock, Wizard",
        "components": "V, S, M (a clear, crystal or glass orb)",
        "duration": "1 minute",
        "id": 3850,
        "level": 1,
        "name": "Witch Bolt (Improved)",
        "range": "60 feet",
        "ritual": 0,
        "school": "Evocation",
        "sources": "Compendium Arcana",
        "text": "\tA beam of crackling, blue energy lances out toward a creature within range, forming a sustained arc of lightning between you and the target. Make a ranged spell attack against that creature. On a hit, the target takes 1d12 lightning damage, and on each of your turns for the duration, you can use your action to deal 2d6 lightning damage to the target automatically. The spell ends if you use your action to cast another spell. The spell also ends if the target is ever outside the spell's range or if it has total cover from you.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the initial damage increases by 1d12 for each slot level above 1st, and the sustained damage increases by 1d6 for each slot level above 1st.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V, S, M (the skull of a lich worth at least 999 gp, which the spell consumes)",
        "duration": "Concentration, up to 1 minute",
        "id": 3858,
        "level": 10,
        "name": "Xzar's Soulblight",
        "range": "90 feet",
        "ritual": 0,
        "school": "Necromancy",
        "sources": "Compendium Arcana",
        "text": "\tYou will the powers of death to infect one creature of your choice that you can see within range. That creature must make a Constitution saving throw when you first cast this spell, and at the end of each of its turns while you concentrate on it. If it ever fails this saving throw, the spell ends, and the creature is cursed with Soulblight. This curse can only be removed by a greater restoration spell cast using a 9th-level spell slot, or a wish spell. While a creature is cursed, it gains the following effects:\\n\tEvery time the creature finishes a long rest, its' Constitution score is reduced by 1. Every time a creature not cursed with Soulblight spends 1 hour within 30 feet of one that is, it must make a Constitution saving throw or become cursed as well. This effect ignores total cover and penetrates magical barriers and defenses created by spells of 8th level or lower.\\n\tFinally, any creature that dies while affected by this curse reanimates as a zombie under your command after 24 hours. These creatures obey your orders to the best of their abilities. If you give them no orders, they will wander and attempt to kill other living creatures they come across. Whenever a zombie comes into physical contact with a creature not cursed with Soulblight (usually by making an attack), that creature must make a DC 14 Constitution saving throw or become cursed as well. A creature killed by these zombies animates after 24 hours as if it died while cursed.\\n",
        "time": "1 action"
    }, {
        "classes": "None",
        "components": "V, S, M (a glass prism infused with platinum, worth at least 1,000 gp)",
        "duration": "Until Dispelled",
        "id": 3860,
        "level": 10,
        "name": "Zahn's Fantasy",
        "range": "Sight",
        "ritual": 0,
        "school": "Illusion",
        "sources": "Compendium Arcana",
        "text": "\tSummoning the strongest illusion magic known, you create the illusion of any number of sensory phenomena, which appears at a spot that you can see and lasts for the duration. It seems completely real, and can include sounds, smells, temperature, and other sensations appropriate to the thing depicted. You can't create sufficient heat or cold to cause damage, a sound loud enough to deal thunder damage or deafen a creature, or a smell that might sicken a creature (like a troglodyte's stench).\\n\tThe illusion is not physical, however it can invoke tactile sensations, such as a gentle breeze, rough bark, or a prickling as if one was being watched. It can even emulate arcane sensations, such as the auras seen when using detect magic. The illusion can appear to move and emulate different sensations within itself, such as if you create the illusion of a town, complete with people walking and talking as the smells of a market waft through the air.\\n\tAs long as you can see the illusion, you can use your action to cause the image to move to any other spot you can see. As it changes location, you can alter it so that its movement seems natural for the illusion. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking.\\n\tPhysical interaction with the illusion may reveal it to be an illusion, because although it can invoke tactile sensations, things can still pass through it. A creature that uses its action to examine the image can determine that it is an Illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the Illusion for what it is, the creature can see through the image, and its other sensory qualities become faint to the creature.\\n",
        "time": "24 hours"
    }
]
