[{
        "spell_classes": "Bard",
        "spell_components": "V, S, M (A drop of ale or beer)",
        "spell_duration": "8 Hours",
        "spell_id": 1277,
        "spell_level": 1,
        "spell_name": "Ale Goggles",
        "spell_range": "30 Feet",
        "spell_ritual": 0,
        "spell_school": "Illuision",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "Depending upon one's philosophy, this spell either heightens or retards the target's perceptions. The target makes a Wisdom saving throw, if it fails the target perceives everyone else as having an enchanting appearance. Thus, even average looking folk look better. This give everyone interacting with the target advantage on Appearance related checks.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric, Druid, Imagist, Paladin, Ranger",
        "spell_components": "V, S, M, (Rare herbs and oils worth 100 gp that the spell consumes)",
        "spell_duration": "Instantaneous",
        "spell_id": 1278,
        "spell_level": 2,
        "spell_name": "Analyze Ancestry",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Divination",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell provides a complete genealogy back ten generations. You know the identity of each of the individual's forebears including name and race",
        "spell_time": "24 Hours"
    }, {
        "spell_classes": "Cleric, Druid, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1279,
        "spell_level": 0,
        "spell_name": "Analyze Fertility",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Divination ",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell gives the caster an insight into the reproductive capabilities of the target, including when a female is most fertile. It identifies problems such as impotence and infertility. It also reveals any conception influencing spells such as block the seed and fiendish seed as well as their spell level",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Sorcerer, Wizard",
        "spell_components": "V, S, M (A small graphic motion flip book)",
        "spell_duration": "1 Minute",
        "spell_id": 1280,
        "spell_level": 1,
        "spell_name": "Animate Image",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Illusion",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell creates a visual representation of a piece of text or static graphic. The image performs any acts indicated by the text or extrapolated from the graphic. The animated image is a flat, two dimensional, full color animated image and is seen the same way by all parties viewing it.\n\nImages created from text are reasonable representations but not necessarily completely accurate. For instance, a historical biography of King Ferfensia that includes a detailed description or a portrait of the king produces an image corresponding to the text or illustration. A different text that merely recounts an exploit of King Ferfensia but lacks a description of the king merely produces an image of a regal-looking male with the details supplied by the caster. Neither image is guaranteed to resemble what the king looks like in reality.\n\nThe spell can be cast upon a book, scroll, tapestry, or other textual or visual representation. If cast upon a three-dimensional object such as a statue, the image produced is still just a flat, two-dimensional one floating above or in front of the item.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Cleric, Imagist",
        "spell_components": "V, S",
        "spell_duration": "Concentration, 1 Hour ",
        "spell_id": 1281,
        "spell_level": 3,
        "spell_name": "Beauty's Caress",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "When touched, the target becomes much more attractive, poised, and self confident. They gain advantage and 1d4 bonus to Appearance and Charisma scores. Requires Concentration",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Sorcerer, Wizard",
        "spell_components": "V, S, M (A tiny clay face devoid of any features)",
        "spell_duration": "1 Day",
        "spell_id": 1282,
        "spell_level": 3,
        "spell_name": "Blandness",
        "spell_range": "30 feet",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "The target's Appearance score is lowered to the average Appearance score of that creature's race. See the Appendix for average Appearance scores The spell has no effect on Animals, Constructs, Elementals, Oozes, Plants, Undead, or Vermin. The target does not take disadvantage or advantage for any Appearance skill check. Any unlisted create is assumed to have a base score of 10",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric, Paladin, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "1 Hour",
        "spell_id": 1283,
        "spell_level": 4,
        "spell_name": "Blessed Seed",
        "spell_range": "Self",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell infuses you with celestial energy that infuses your sperm or womb with power. The next time you copulate with a member of the opposite gender, any pregnancy rolls are made with disadvantage. Any child conceived in this manner is Half Celestial. A contagion spell terminates the pregnancy without inflicting disease.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Cleric, Warlock, Wizard",
        "spell_components": "V, S, M (A lemon rind)",
        "spell_duration": "1 Day",
        "spell_id": 1284,
        "spell_level": 1,
        "spell_name": "Block the Seed",
        "spell_range": "Self",
        "spell_ritual": 0,
        "spell_school": "Abjuration",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "ou are incapable of getting someone pregnant or becoming pregnant for the duration of the spell. You can still contract sexually transmitted diseases.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric",
        "spell_components": "V, S, M (A drop of sexual fluid from each of your targets)",
        "spell_duration": "1 Hour",
        "spell_id": 1285,
        "spell_level": 6,
        "spell_name": "Body to Body",
        "spell_range": "90 Feet",
        "spell_ritual": 0,
        "spell_school": "Abjuration",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "The spell targets one creature. The target makes a Wisdom save, on a failed save, the target is magically linked to the caster. On the caster's will any spell that the caster casts on themselves also affects the targets. All targets must be within range of the caster.\n\nAt Higher Levels When casting this spell using a 7th level spell slot and higher increase the targets by 1.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Druid, Imagist, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantanious",
        "spell_id": 1286,
        "spell_level": 5,
        "spell_name": "Calm Weather",
        "spell_range": "2 Miles",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "Calm weather removes any transmutations that affect weather. For each such effect, you make spell check (d20 + spell attack bonus) against the DC of the weather effect. Success means that the spell ends.\n\nIf the effects come from a permanent magic item the effect is suppressed for 8 Hours",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Imagist, Sorcerer, Wizard",
        "spell_components": "V, M (Two platinum rings worth at least 200 gp worn by you and the target)",
        "spell_duration": "Instantaneous",
        "spell_id": 1287,
        "spell_level": 7,
        "spell_name": "Come to Me",
        "spell_range": "Same Plane",
        "spell_ritual": 0,
        "spell_school": "Conjuration",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell instantly transports a willing ally to you. The subject recognizes you and understands the spell is to summon it to you. The creature appears adjacent to you, in a space you choose.\n\nThe creature must be in an area where magic can be cast and must be able to travel extra dimensionally. If the targeted creature is unable to answer the summon the spell fails.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Until Dispelled",
        "spell_id": 1289,
        "spell_level": 3,
        "spell_name": "Cursed Orgasm",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "The targeted creature must make a Constitution save, on a failed save, the next time that the subject achieves orgasm they are wracked with incredible pain. The target takes 5d10 points of damage.\n\nAt Higher Levels When casting this spell using a 4th level spell slot and higher increase the damage by 1d10.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Imagist, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "1 Day",
        "spell_id": 1290,
        "spell_level": 0,
        "spell_name": "Depilatory",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell enables you to selectively shave hair and prevent its regrowth for 1 Day.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S, M (A small mirror)",
        "spell_duration": "1 Day",
        "spell_id": 1291,
        "spell_level": 4,
        "spell_name": "Desperation",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Necromancy",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "The target must make a Wisdom save, on a failed save the target suffers the effects of the spell. The target is filled with self doubt and lacks confidence, perceiving themselves to be homely, tongue tied, and an inept lover, incompetent in any and all social and sexual aspects of life.\n\nThe target suffers disadvantage on all Appearance and Charisma checks. Desperation hits the target hard in their ego, The target takes a -4 penalty to all Appearance and Charisma checks as their desperation shows.\n\nThe spell ends if the target has sex.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric, Druid, Imagist, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1292,
        "spell_level": 0,
        "spell_name": "Detect Pregnancy",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Divination ",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "You can tell if the creature touched is pregnant or is hosting another creature, such as a Slaad's implanted young.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1293,
        "spell_level": 2,
        "spell_name": "Disrobe",
        "spell_range": "100 Feet",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "The target makes a Wisdom saving throw, on a failed save the creature suffers the spell's effects. The creature's clothing, including undergarments, belts, and footwear, loosen and fall off its body, leaving it naked. Nonmagical jewelry, including rings, earrings, and necklaces also fall, sliding off as if covered in grease.\n\nObjects that are held remain in the creature's grasp, as well as magic items that are worn. A creature wearing non magical armor must make a Dexterity save or halve their armor bonus due to the clumsy way in which it dangles off the body. It takes half the time to refit armor loosened this way as it takes to don it completely. It requires a full round action to don regular clothing.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Imagist",
        "spell_components": "V, S",
        "spell_duration": "1 Day",
        "spell_id": 1294,
        "spell_level": 0,
        "spell_name": "Divine Mark",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Transmutation ",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "On a failed Wisdom save. This spell allows you to inscribe a small personal mark. It commonly resembles a hickey. The mark is visible unless the target attempts to disguise it with make-up or cover it with clothing.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Imagist",
        "spell_components": "V, S",
        "spell_duration": "1 Hour",
        "spell_id": 1295,
        "spell_level": 2,
        "spell_name": "Eminently Talented",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell brings out an individuals full potential and primal urges in bed, granting a +4 on Sexual Performance checks.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Druid",
        "spell_components": "V, S",
        "spell_duration": "10 Minutes",
        "spell_id": 1296,
        "spell_level": 1,
        "spell_name": "Engorged Gait",
        "spell_range": "30 feet",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "On a failed Constitution save. The target creature's feet swell and its movement becomes awkward and ungainly. The creature's speed is reduced by half. This affects the creature's jumping distance as normal. Multiple engorged gait effects don't stack.\n\nWings and flying speed are reduced unless the flight is extraordinary, magical, or supernatural in nature. This spell counters and dispels expeditious retreat.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Druid",
        "spell_components": "V, S",
        "spell_duration": "Concentration, Up to 1 Minute",
        "spell_id": 1297,
        "spell_level": 2,
        "spell_name": "Engorged Strike",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "Engorged Strike causes the target's fists to swell, enhancing the damage of an unarmed blow. Treat the creature as one size category larger for purposes of determining damage dealt.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S, M (A small mirror)",
        "spell_duration": "Until dispelled",
        "spell_id": 1298,
        "spell_level": 3,
        "spell_name": "False Confidence",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Necromancy",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "On a failed Wisdom save. The target is filled with confidence, perceiving himself to be attractive, smooth talking, an excellent lover, and competent in every social and sexual aspect of life. The target takes a -2 penalty on all Appearance and Charisma checks, coming across pompous, arrogant, and selfish in every situation. The DM should subtract -2 from the player's dice rolls secretly. The spell can be removed by remove curse",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Druid",
        "spell_components": "V, S, M (An emerald worth at least 1,000gp, which the spell consumes)",
        "spell_duration": "10 Hours",
        "spell_id": 1299,
        "spell_level": 9,
        "spell_name": "Fecund Growth",
        "spell_range": "Up to 100ft",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "A bright green burst of energy emanates from the caster, causing all living entities, including plants, insects, and animals, to undergo tremendous growth. All plant life, including trees, triple in size, along with new growth emerging from the ground, over the course of 3 rounds.\n\nIn addition, flowers bloom, crops reach their full growth, and trees bear large, nourishing fruit. Fruit, berries, grain, and nuts picked from a fecund area provides the same benefits as a good berry spell for one day, after which the fruit falls off the tree, losing all magical properties. Once the duration of the spell ends, the plants resume their normal cycle of growth.\n\nAny creature with an Intelligence score of two or lower doubles in size as if affected by an animal growth spell. In addition, they increase by one age category. A newborn animal, for instance, ages to adolescence. Normally harmless creatures remain as such, just bigger. Sentient creatures are allowed a Constitution save. Failure indicates the creatures increases in size as if affected by an enlarge person spell, lasting 10 Hours.\n\nIn addition, the creature must make a second Fortitude save. If it fails, the creature ages by one age category. Once the effect ends, creatures return to their normal size, although they remain at the new age category.",
        "spell_time": "1 Round"
    }, {
        "spell_classes": "Cleric, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S, M (A rotted seed covered in sexual fluid)",
        "spell_duration": "1 Hour",
        "spell_id": 1300,
        "spell_level": 4,
        "spell_name": "Fiendish Seed",
        "spell_range": "Self",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell infuses you with demonic energy that infuses your sperm or womb with power. The next time you copulate with a member of the opposite gender, any pregnancy rolls are made with disadvantage. Any child conceived in this manner is either a Half Devil or a Half Demon, player choice. A cure spell terminates the pregnancy dealing 1d6 points of damage to the mother.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1301,
        "spell_level": 1,
        "spell_name": "Find a Soulmate",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Divination",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell allows the touched creature to immediately know where someone who can be a true love is, and whether they are in love with the creature as well. This effect is similar to a locate creature spell, although it is not blocked by running water and can only locate the true love if they are on the same plane of existence.\n\nThe affected creature is under no compulsion to seek out their true love, although their thoughts are constantly filled with images of the person and a desire to find them.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric, Socerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 Hour",
        "spell_id": 1302,
        "spell_level": 4,
        "spell_name": "Ghost Touch",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "Ghost touch makes a weapon, fifty projectiles, or an article of clothing able to interact with incorporeal creatures. An item with ghost touch cast on it counts as either corporeal or incorporeal at any given time. This spell gives a weapon or ammunition the ghost touch weapon property.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Imagist, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1303,
        "spell_level": 0,
        "spell_name": "Grope",
        "spell_range": "120 feet",
        "spell_ritual": 0,
        "spell_school": "Transmutation ",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This variation of the mage hand spell lets you \"feel\" a creature from a distance as if you were actually touching it. The creature feels a sensation as if being lightly groped or caressed on their bare skin by a hand, while the caster experiences the sensation as if he were physically touching the target. The caster does not actually touch the target, and does not gain the benefit of any spell, effect, or attack that relies on touch. Grope cannot be used to deal damage or to push the target in any way.\n\nAs long as they are targeted by this spell, the target of grope suffers disadvantage on any Concentration checks.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric, Druid",
        "spell_components": "V, S",
        "spell_duration": "Concentration, Up to 1 Minute",
        "spell_id": 1304,
        "spell_level": 3,
        "spell_name": "Healing Sphere",
        "spell_range": "30 feet",
        "spell_ritual": 0,
        "spell_school": "Conjuration",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "A glowing orb of positive energy sheds light equivalent to a light spell. It hovers near you for the duration of the spell or until you use a standard action to send it to a creature within range. The orb heals 2d8 points of damage.\n\nAt Higher Levels When casting this spell using a spell slot of 4th or higher increase the healing die done by 1d8.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Imagist, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "1 Hour",
        "spell_id": 1305,
        "spell_level": 5,
        "spell_name": "Hedonist's Delight",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "You confer on the subject heightened sensitivity to pleasurable sensations. Food tastes better, cloth feels softer, sex stimulates more strongly, and orgasms approach awe inspiring. Any cure spell cast on the target is maximized. Any Craft check the target undertakes during the duration is made with advantage.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric, Sorcerer, Wizard",
        "spell_components": "V, S, M (A whithered grain stalk)",
        "spell_duration": "Until dispelled",
        "spell_id": 1306,
        "spell_level": 4,
        "spell_name": "Impotency",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "A male creature that is touched by the caster becomes permanently impotent and can never gain an erection. A female becomes frigid and completely disinterested in sex. Beyond the obvious side effects, creatures suffer disadvantage on all Charisma checks and saves, because of frustration and the negative impact to the ego. Impotency is countered by remove curse.",
        "spell_time": "1 Hour"
    }, {
        "spell_classes": "Druid",
        "spell_components": "V, S, M (A few grains of sugar, and pubic hairs)",
        "spell_duration": "Concentration, up to 10 Minutes",
        "spell_id": 1307,
        "spell_level": 6,
        "spell_name": "Infestation",
        "spell_range": "300 Feet",
        "spell_ritual": 0,
        "spell_school": "Conjuration",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "Swarming, biting insects fill a 20 feet radius sphere centered on a point you choose within range. The sphere spreads around corners. The sphere remains for the duration, and its area is lightly obscured. The sphere’s area is difficult terrain.\n\nWhen the area appears, each creature in it must make a Constitution saving throw. A creature takes 4d10 piercing damage on a failed save, or half as much damage on a successful one. A creature must also make this saving throw when it enters the spell’s area for the first time on a turn or ends its turn there.\n\nIntermixed in the swarm of insects are innumerable fine sized creatures called Lover's Lice. When a creature fails their Constitution saving throw they will also be infested by Lover's Lice that carry one of the following STDs; burning release, crotch plague, or fever touch. Chapter 2\n\nAt Higher Levels When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d10 for each slot level above 5th.",
        "spell_time": "1 Round"
    }, {
        "spell_classes": "Cleric, Paladin",
        "spell_components": "V, S",
        "spell_duration": "Until Dispelled",
        "spell_id": 1308,
        "spell_level": 3,
        "spell_name": "Innocents of the Virgin",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Enchantment",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "On a failed Wisdom save. Once touched, the creature affected by this spell loses all knowledge of sex, sexual techniques, and methods of reproduction. The subject suffers disadvantage on Sexual Performance checks as well as Persuation and Deception checks that deal with seduction or sexual innuendo. This spell is countered by remove curse.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Druid",
        "spell_components": "V, S, M (A fresh and healthy seed from a plant)",
        "spell_duration": "1 Hour",
        "spell_id": 1309,
        "spell_level": 8,
        "spell_name": "Invigorate",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "Powerful, invigorating life force fills the target creature. The target creature gains advantage Constitution checks and a remarkable stamina. In addition, the creature becomes remarkably fertile and has a 100% chance of conceiving if it engages in sex during the duration of the spell. Birth control may affect conception\n\nThe creature becomes permanently fertile if it was sterile before, due to age, disease, or magical effects. This spell has no effect on creatures that cannot normally conceive or produce children, such as constructs or undead, or reproduce in a different manner, such as plants.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Druid, Ranger",
        "spell_components": "V, S",
        "spell_duration": "Concentration, 10 Minutes",
        "spell_id": 1310,
        "spell_level": 4,
        "spell_name": "Irrational Attraction",
        "spell_range": "30 feet",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "On a failed Wisdom save. This spell causes the target creature to become consumed with an irrational attraction to another being within sight, chosen by the caster. This attraction occurs regardless of race, type, or gender, although source of attraction must be a creature. During the duration of the spell, the target does not willingly attack the object of attraction. The target takes no actions other than extolling the virtues and beauty of the object of its desire, although they defends themselves as normal, as well as the object of their attraction. If possible, the target does everything in their power to engage in sex with the subject.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric, Druid, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S, M (Sexual fluid of the target creature)",
        "spell_duration": "Until Dispelled",
        "spell_id": 1311,
        "spell_level": 3,
        "spell_name": "Jealousy",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Necromancy",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "On a failed Wisdom saving throw. You place a curse on the subject. If the target attempts sex with any creature other than yourself, she experiences wracking pain causing 5d10 points of damage. If you have placed a divine or arcane mark upon the creature, you can cast the spell at any range. This spell lasts until the caster dies or countered by remove curse.\n\nAt Higher Levels When casting this spell using a spell slot of 4th level or higher, the damage increases by 1d10 for each spell slot above 3rd",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric, Druid, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S, M (Sexual fluid of the target creature)",
        "spell_duration": "Until Dispelled",
        "spell_id": 1312,
        "spell_level": 3,
        "spell_name": "Jealousy",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Necromancy",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "On a failed Wisdom saving throw. You place a curse on the subject. If the target attempts sex with any creature other than yourself, she experiences wracking pain causing 5d10 points of damage. If you have placed a divine or arcane mark upon the creature, you can cast the spell at any range. This spell lasts until the caster dies or countered by remove curse.\n\nAt Higher Levels When casting this spell using a spell slot of 4th level or higher, the damage increases by 1d10 for each spell slot above 3rd",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Sorcerer, Wizard",
        "spell_components": "V, S, M (Perfumes, herbs, and powdered gemstones worth 1,000gp which the spell consumes)",
        "spell_duration": "Instantaneous",
        "spell_id": 1313,
        "spell_level": 5,
        "spell_name": "Kiss of Life",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Conjuration",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "The caster can restore life to a very recently deceased creature by kissing it. The caster can bring back to life creatures that have been dead up to 10 days, as raise dead, except as noted. Bringing someone back from the dead in this manner is very draining to the caster. He must make a Constitution saving throw against the spell DC or gain 3 levels of exhaustion.",
        "spell_time": "1 Round"
    }, {
        "spell_classes": "Cleric, Druid, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Until Dispelled",
        "spell_id": 1314,
        "spell_level": 3,
        "spell_name": "Liar's Curse",
        "spell_range": "30 feet",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "On a failed Wisdom save. You place a curse on the subject, choosing either to focus on the target's penis (if applicable), or nose.\n\nEach time the target lies, the chosen body part becomes larger.\n\nThis spell is countered by remove curse.",
        "spell_time": "1 Round"
    }, {
        "spell_classes": "Cleric",
        "spell_components": "V, S",
        "spell_duration": "Until dispelled",
        "spell_id": 1315,
        "spell_level": 3,
        "spell_name": "Life bond",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Divination",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "When cast, this spell allows the affected creature to permanently know the relative position and condition of a being that has been designated as a true love. The spell only works if the character and the other being are in love with each other. If the love is not true, then the spell fails. In most cases, both lovers receive this spell, to allow them to know the condition of the other. Depending upon their philosophy, a creature may have more than one true love.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric, Druid",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 Hour",
        "spell_id": 1316,
        "spell_level": 5,
        "spell_name": "Life Shell",
        "spell_range": "10 feet radius on self",
        "spell_ritual": 0,
        "spell_school": "Abjuration",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "You bring into being a mobile, hemispherical energy field that prevents the entrance of anything or anyone except for living creatures. No nonliving substances, be they arrows, magic items, or clothes may pass into the barrier, though energy attacks penetrate unimpeded. Any items within the barrier when it is created are unaffected. Forcing the barrier against creatures that the spell keeps at bay strains and collapses the field.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Cleric, Sorcerer, Wizard",
        "spell_components": "S",
        "spell_duration": "1 Hour",
        "spell_id": 1317,
        "spell_level": 3,
        "spell_name": "Limited Telepathy",
        "spell_range": "100 feet",
        "spell_ritual": 0,
        "spell_school": "Divination",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell enables you to create a connection with one other creature with an Intelligence score of 6 or higher within range. Until the spell ends, you and the target can instantaneously share words, images, sounds, and other sensory messages. The target recognizes you as the creature it is communicating with. No special power or influence is established as a result of the spell.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Cleric, Sorcerer, Wizard",
        "spell_components": "S",
        "spell_duration": "1 Hour",
        "spell_id": 1318,
        "spell_level": 3,
        "spell_name": "Limited Telepathy",
        "spell_range": "100 feet",
        "spell_ritual": 0,
        "spell_school": "Divination",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell enables you to create a connection with one other creature with an Intelligence score of 6 or higher within range. Until the spell ends, you and the target can instantaneously share words, images, sounds, and other sensory messages. The target recognizes you as the creature it is communicating with. No special power or influence is established as a result of the spell.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Sorcerer, Wizard",
        "spell_components": "V, S, M (A small crystal bead and incense, consumed on use)",
        "spell_duration": "8 Hours",
        "spell_id": 1319,
        "spell_level": 4,
        "spell_name": "Love Nest",
        "spell_range": "20 feet",
        "spell_ritual": 0,
        "spell_school": "Evocation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell creates a large but cozy tent or yurt made from sturdy and colorful material. The interior is extremely comfortable, filled with pillows, veils, incense, and candles. If the caster wishes, there is also a small fireplace or stove, complete with a small amount of wood. The love nest provides the same physical protection from the elements as a normal tent. In addition, everyone inside the love nest gains advantage on Wisdom saves against any scrying attempts.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Cleric, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1320,
        "spell_level": 2,
        "spell_name": "Magic Probe",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Divination",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "On a failed Wisdom save. Magic probe reveals all spells currently active on the target. The caster knows the name of any spells and the spell level, but no other details. For example, if the target of this spell is a sorcerer with mage armor, and vampiric touch cast on herself, the magic probe reveals these spells and spell levels to the caster of the probe.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Cleric, Paladin",
        "spell_components": "V, S, M (A heart shaped ruby worth 50gp)",
        "spell_duration": "Concentration, up to 1 Hour",
        "spell_id": 1321,
        "spell_level": 2,
        "spell_name": "Mantle of Love",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Abjuration",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "You imbue the subject with magical energy that protects them from harm, granting them advantage on all saves. If you and the subject of the spell move out of sight of each other, the spell ends.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard",
        "spell_components": "V, S, M (A drop of ale or beer)",
        "spell_duration": "1 Day",
        "spell_id": 1322,
        "spell_level": 3,
        "spell_name": "Mass Ale Goggles",
        "spell_range": "60 feet",
        "spell_ritual": 0,
        "spell_school": "Illusion",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "Choose a point in range, choose up to 6 creatures in a 30 foot sphere centered on that point. You retard each of the target's perception. Each target makes a Wisdom saving throw.\n\nEach target perceives everyone else as having an enchanting appearance. Thus, even average looking folk look better. This give everyone interacting with each target advantage on Appearance related checks.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, 10 Minutes",
        "spell_id": 1323,
        "spell_level": 6,
        "spell_name": "Mass Orgasmic Vibrations",
        "spell_range": "60 feet",
        "spell_ritual": 0,
        "spell_school": "Enchantment",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "A flood of mysterious energy washes out from the point of your choice. Choose up to 6 creatures in a 30 foot sphere centered on that point. Each target makes a Wisdom saving throw, on a failed throw the spell effects the target.\n\nYou make cause your targets to experience a shuddering orgasm throughout its body. The orgasm causes each target to become stunned for the duration of the spell. Creatures attacked while stunned can make another Wisdom Saving throw. A target that makes its saving throws till experiences pleasurable, but merely distracting, sensations.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Imagist, Sorcerer, Wizard",
        "spell_components": "V, S, M (A peacock's feather)",
        "spell_duration": "12 Hours",
        "spell_id": 1324,
        "spell_level": 6,
        "spell_name": "Mass Peacock's Beauty",
        "spell_range": "60 feet",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "Choose a point in range, choose up to 6 creatures in a 30 foot sphere centered on that point. The transmuted creatures becomes more attractive. The spell grants a +2 enhancement bonus to Appearance, adding the usual benefits to Appearance based ability checks. Casters who rely on Appearance for spell casting see an increase for their spell DCs and their spell attack bonus. Casters who rely on Appearance for spells are not able to prepare any additional bonus spells.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric, Imagist",
        "spell_components": "V, S, M (A small silver mirror)",
        "spell_duration": "1 Minute",
        "spell_id": 1326,
        "spell_level": 5,
        "spell_name": "Mass Sanctuary",
        "spell_range": "30 feet",
        "spell_ritual": 0,
        "spell_school": "Abjuration",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "Choose a point in range. You ward up to 6 creatures in a 30 foot sphere centered on that point against attack. Until the spell ends, any creature who targets the warded creature with an attack or a harmful spell must first make a Wisdom saving throw. On a failed save, the creature must choose a new target or lose the attack or spell. This spell doesn’t protect the warded creatures from area effects, such as the explosion of a fireball. If the warded creature makes an attack or casts a spell that affects an enemy creature, this spell ends.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Cleric, Warlock",
        "spell_components": "V, S",
        "spell_duration": "10 Minutes",
        "spell_id": 1327,
        "spell_level": 4,
        "spell_name": "Mass Vision of Exquisite Pleasure",
        "spell_range": "60 Feet",
        "spell_ritual": 0,
        "spell_school": "Enchantment",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "Choose a point in range, choose up to 6 creatures in a 30 foot sphere centered on that point. On a failed Wisdom saving throw. Images of tantalizing and overwhelming sexual pleasure consume the affected targets, causing them to pause in their tracks and revel in eroticism. While affected by the spell, the targets are stunned. The targets can make a Wisdom save each round to shake off the effect.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Cleric, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "8 Hour",
        "spell_id": 1329,
        "spell_level": 4,
        "spell_name": "Mind to Mind",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Divination",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell links the caster with one other individual. The caster and target can communicate telepathically. The caster and the target can share words, images, sounds, and other sensory messages. Any gaze attack to which the target subjected may affect the caster as well. The caster and the target each make their own saving throws.\n\nOnce the spell has been cast upon the subject, the distance between them and the caster does not affect the spell as long as they are on the same plane of existence. If they are ever on different planes, the spell ceases to function.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Imagist, Sorcerer, Wizard",
        "spell_components": "V, S, M (Finely crafted silver mirrors costing at least 1,000gp)",
        "spell_duration": "10 minutes",
        "spell_id": 1330,
        "spell_level": 4,
        "spell_name": "Mirror Talk",
        "spell_range": "Unlimited",
        "spell_ritual": 0,
        "spell_school": "Illusion",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell enables the caster to create a link from their focus mirror to any mirror elsewhere on the same plane. They must have carefully studied the mirror, but need not know where it is located. The link between mirrors enables those in front of the mirror to see through the opposing focus as if it were a window. Sights and sounds pass through the focus. This enables line of sight, but not line of effect.",
        "spell_time": "10 Minutes"
    }, {
        "spell_classes": "Bard, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "1 Round",
        "spell_id": 1331,
        "spell_level": 6,
        "spell_name": "Mirror Walk",
        "spell_range": "10 feet",
        "spell_ritual": 0,
        "spell_school": "Conjuration",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell creates a magical link between a Large or larger mirror within range and another mirror, at any distance, on the same plane of existence. You must have studied the destination mirror but do not need to know where it is located. For the duration, any creature can step into the target mirror and exit from the destination mirror by using 5 feet of movement.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Imagist, Sorcer, Warlock, Wizard",
        "spell_components": "V, M (A small wooden replica of an archery target)",
        "spell_duration": "1 Round",
        "spell_id": 1332,
        "spell_level": 2,
        "spell_name": "Miss",
        "spell_range": "30 feet",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "On a failed Wisdom save. You may thwart your target's next attack. Before the start of your next turn, any attack rolls made by the target are made with disadvantage.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S, M (A drop of sexual fluid)",
        "spell_duration": "Concentration, 5 Minutes",
        "spell_id": 1333,
        "spell_level": 3,
        "spell_name": "Orgasmic Vibrations",
        "spell_range": "30 feet",
        "spell_ritual": 0,
        "spell_school": "Enchantment",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "You cause your targets to experience a shuddering orgasm throughout its body. The orgasm causes each target to become stunned for the duration of the spell. Creatures attacked while stunned can make another Wisdom Saving throw. A target that makes its saving throws till experiences pleasurable, but merely distracting, sensations.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric, Imagist",
        "spell_components": "V, S",
        "spell_duration": "1 Day",
        "spell_id": 1334,
        "spell_level": 8,
        "spell_name": "Peace Aura",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Abjuration",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "Peace aura wards a particular site, building, or structure against violence. Anyone attempting to strike or otherwise attack a creature within the warded area, even with a targeted spell, takes 12d10 points of force damage. A creature with the Evil subtype, takes disadvantage on its saving throw.\n\nAt Higher Levels When casting this spell using a spell slot of 9th level increase the damage die to 15d10",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Imagist",
        "spell_components": "V, S, M (A peacock's feather)",
        "spell_duration": "1 Hour",
        "spell_id": 1335,
        "spell_level": 2,
        "spell_name": "Peacock's Beauty",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "\n2nd Level \n\nCasting Time: \nRange: \nComponents: \nDuration: \nThe transmuted creatures becomes more attractive. The spell grants a +2 enhancement bonus to Appearance, adding the usual benefits to Appearance based ability checks. Casters who rely on Appearance for spell casting see an increase for their spell DCs and their spell attack bonus. Casters who rely on Appearance for spells are not able to prepare any additional bonus spells.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Imagist",
        "spell_components": "V, S, M (A peacock's feather)",
        "spell_duration": "1 Hour",
        "spell_id": 1336,
        "spell_level": 2,
        "spell_name": "Peacock's Beauty",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "The transmuted creatures becomes more attractive. The spell grants a +2 enhancement bonus to Appearance, adding the usual benefits to Appearance based ability checks. Casters who rely on Appearance for spell casting see an increase for their spell DCs and their spell attack bonus. Casters who rely on Appearance for spells are not able to prepare any additional bonus spells.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1337,
        "spell_level": 3,
        "spell_name": "Phantasmal Lover",
        "spell_range": "100 feet",
        "spell_ritual": 0,
        "spell_school": "Illusion ",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "You create a phantasmal image of the most attractive creature imaginable to the subject directly in front of them. Only the target of the subject can see the phantasmal lover. You see only a vague shape. The target first gets a Wisdom save to recognize the image as unreal. If that save fails, the phantasm touches the subject, and the subject must succeed on a Constitution save or be stunned for ld6 rounds and gain 1 level of exhaustion.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Druid, Ranger",
        "spell_components": "V, S, M (A drop of lavender oil)",
        "spell_duration": "Concentration, 1 Hour",
        "spell_id": 1338,
        "spell_level": 3,
        "spell_name": "Pheromones",
        "spell_range": "10 feet",
        "spell_ritual": 0,
        "spell_school": "Enchantment",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "Your body produces a pleasing scent that affects creatures on a subliminal level. Creatures capable of smelling, excluding constructs and undead, regard you with a friendly attitude. You gain advantage on Deception, and Persuasion checks against the affected creatures. Creatures withing range must make a Wisdom save.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Imagist, Sorcerer, WIzard",
        "spell_components": "V, S",
        "spell_duration": "10 Minutes",
        "spell_id": 1339,
        "spell_level": 3,
        "spell_name": "Pillow Talk",
        "spell_range": "20 feet",
        "spell_ritual": 0,
        "spell_school": "Enchantment",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "A creature who is subject to this spell can't speak any deliberate and intentional lies to you. Any creature you choose in range that you have had sec with withing the last 10 minutes must make a Wisdom save. If the creature fails the save the creature is unaware of any magical compulsion.\n\nThe creature can make a Perception check against the spell DC to determine that it is under the effect of a spell. If successful, they realize they are speaking more freely than they should. If successful, the creature may avoid answering questions directly, as long as they remain within the boundaries of the truth. The subject still can't outright lie, but vague or partial answers are possible.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric, Paladin, Imagist",
        "spell_components": "V, S",
        "spell_duration": "1 Day",
        "spell_id": 1340,
        "spell_level": 2,
        "spell_name": "Pleasant Dreams",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Abjuration",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "\nnd Level \n\nCasting Time: \nRange: \nComponents: \nDuration: \nPleasant dreams protects the creature touched from influenced dreams, whether of mundane or magic origin. It prevents dream, wet dreams, a night hag's dream haunting, and similar sleep disturbances.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Sorcerer, Wizard",
        "spell_components": "V, S, M (An opaque silk veil)",
        "spell_duration": "10 Minutes",
        "spell_id": 1341,
        "spell_level": 3,
        "spell_name": "Privacy",
        "spell_range": "10 feet",
        "spell_ritual": 0,
        "spell_school": "Abjuration",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "You surround yourself with a sphere of power that negates all forms of divination. Scrying spells cannot perceive anything within the area. The spell or magical effect is suppressed while the target is in the area. Those within are immune to detect thoughts, suspicion and similar spells. The ward does not prevent communication and movement into and out of the area.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Sorcerer, Wizard",
        "spell_components": "V, S, M (A shrunken, rotting apple carved with a face)",
        "spell_duration": "1 Day",
        "spell_id": 1342,
        "spell_level": 3,
        "spell_name": "Repulsiveness",
        "spell_range": "60 feet",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "The target must make a Constitution save, if they fail the check they are under the effects of the spell. The target becomes hideous to gaze upon, taking 1d6 points of Appearance damage.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Cleric, Paladin",
        "spell_components": "V, S",
        "spell_duration": "1 Hour",
        "spell_id": 1343,
        "spell_level": 2,
        "spell_name": "Resist Temptation",
        "spell_range": "Self",
        "spell_ritual": 0,
        "spell_school": "Abjuration",
        "spell_sources": "",
        "spell_text": "The caster becomes hardened to sexual advances and magical effects that entice the caster. They gains advantage on Wisdom saves against charms, enchantments, or spell like effects that affect the attitude of the victim, charm person, charm monster, a bard's bardic song ability, or a harpy's captivating song as well as Charisma ability checks that have sexual overtones.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric, Sorcerer, Wizard",
        "spell_components": "V, S, M (A small mirror)",
        "spell_duration": "1 Day",
        "spell_id": 1345,
        "spell_level": 2,
        "spell_name": "Reverse Gender",
        "spell_range": "60 feet",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "The target makes a Constitution saving throw, on failure their gender is reversed. This spell reverses the gender of the target creature. This has no effect on the creature's ability scores, although it may result in the loss of a prestige class that is gender specific. A pregnant target gets second saving throw. If it fails, the unborn child dies.\n\nThe creature can make another pregnant if changed to a male and can become pregnant if changed to a female. Another reverse gender spell returns the creature to its original state, as does remove curse. It has no effect on creatures that have no true gender, such as constructs, ooze, and plants. This spell can be made permanent by casting the spell with diamond dust worth at least 1,000 gp. Remove curse can be used to dispel it in this case.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Socerer, WIzard",
        "spell_components": "V, S, M (A small magnet)",
        "spell_duration": "1 Hour",
        "spell_id": 1346,
        "spell_level": 4,
        "spell_name": "Seduction",
        "spell_range": "30 feet",
        "spell_ritual": 0,
        "spell_school": "Enchantment",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell incites a sudden, overwhelming lust in the target creature, focused overwhelming on the you. If the target fails its Wisdom saving throw, the creature's attitude shifts. The creature becomes \"friendly\" to the you, its mind and instincts focused completely on trying to have sex with the you. This spell compels the creature to use any method it can, short of force and magical coercion, to bed you. If the target's sexual orientation conflicts with the caster's gender, the target gains advantage on their save. The actual method of seduction employed by the creature varies by individual. Normally violent creatures show displays of their physical prowess, including attacking others, while more eloquent beings use words and body language to woo their new love.\n\nDuring this time, the target does not willingly attack, use spells or spell like abilities on the object of its desire. The effect ends as soon as the caster attacks or makes a violent gesture towards the target creature.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard",
        "spell_components": "V, S, M (A crushed gem worth 500gp, that the spell consumes)",
        "spell_duration": "1 Day",
        "spell_id": 1347,
        "spell_level": 6,
        "spell_name": "Shadow Life",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Necromancy",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell temporarily restores a creature to life. It works upon the target like a raise dead spell, except at the end of its duration, the target again dies. If a corpse already has been subject to a shadow life spell, the new spell fails.",
        "spell_time": "1 Hour"
    }, {
        "spell_classes": "Bard, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "1 Hour",
        "spell_id": 1348,
        "spell_level": 1,
        "spell_name": "Share Sensation",
        "spell_range": "Self",
        "spell_ritual": 0,
        "spell_school": "Illusion",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell targets one creature within sight. It enables you to feel physical sensations just ike your target feels. Although the caster feels pleasure and pain as the target does, you do not become wounded when the target takes damage nor healed if the target is cured.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S, M (A pair of golden lockets worn by you and the target worth at least 5,000gp)",
        "spell_duration": "10 Minutes",
        "spell_id": 1349,
        "spell_level": 9,
        "spell_name": "Spell Meld",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Evocation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell joins the caster and a willing, spell casting subject with a strong, mystical connection. Their spell casting abilities pool together. Either participant in the meld can cast spells from the other's spell repertoire. The caster must have an ability score sufficient to cast that level of spell and any material components or focuses required.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Cleric, Paladin",
        "spell_components": "V, S",
        "spell_duration": "10 Minutes",
        "spell_id": 1350,
        "spell_level": 4,
        "spell_name": "Succor",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Conjuration",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "The spell prevents 1 point of ability damage or drain per ability score.\n\nAt Higher Levels When casting this spell using a spell slot of 6th or higher add an additional point of prevented damage.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Cleric, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1351,
        "spell_level": 1,
        "spell_name": "Suspicion",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Divination",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell gives the caster an image of the target's last sexual encounter. The caster has a brief, mental image of the person with whom the target last had sex. If the target last masturbated, the image is of the target.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "1 minute",
        "spell_id": 1352,
        "spell_level": 2,
        "spell_name": "Touch Me Not",
        "spell_range": "Self",
        "spell_ritual": 0,
        "spell_school": "Abjuration",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "This spell charges your body with protective energy. You gain a +2 deflection bonus to your Armor Class. In addition, an opponent that touches or grapples you takes 1d8 points of damage. This spell is purely defensive. It does not make you armed, nor can you use it to make a melee attack, though it does deal damage on any enemy with whom you grapple. An ally can touch you without taking damage.\n\nAt Higher Levels When casting this spell using a spell slot of 3rd or higher increase the damage by 1d8.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Cleric, Druid, Imagist, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1353,
        "spell_level": 7,
        "spell_name": "True Form",
        "spell_range": "Touch",
        "spell_ritual": 0,
        "spell_school": "Transmutation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "The target makes a Wisdom saving throw, on a failed save all magic that alters a creature's true form or nature is released. This spell forces shape changers back into their natural form.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "1 Hour",
        "spell_id": 1354,
        "spell_level": 2,
        "spell_name": "Unseen Lover",
        "spell_range": "20 feet",
        "spell_ritual": 0,
        "spell_school": "Conjuration",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "An unseen lover is a variation of the unseen servant spell. It creates an invisible, mindless force that performs sexual acts on verbal command from the caster. The unseen lover is generally shapeless, although it can be commanded to take a vague form similar to a male or female humanoid, with normal size physical features. Because it is not a living creature, the unseen lover cannot be used to activate any feats that require sexual congress with a living partner, such as Kundalini, Tantric, or Virility. In all other ways, this spell follows the same rules as unseen servant.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Cleric, Warlock",
        "spell_components": "V, S",
        "spell_duration": "10 Minutes",
        "spell_id": 1355,
        "spell_level": 1,
        "spell_name": "Vision of Exquisite Pleasure",
        "spell_range": "30 feet",
        "spell_ritual": 0,
        "spell_school": "Enchantment",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "On a failed Wisdom saving throw. Images of tantalizing and overwhelming sexual pleasure consume the affected target, causing themto pause in their tracks and revel in eroticism. While affected by the spell, the person is stunned. The creature can make a Wisdom save each round to shake off the effect.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Bard, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1356,
        "spell_level": 4,
        "spell_name": "Wet Dreams",
        "spell_range": "Unlimited",
        "spell_ritual": 0,
        "spell_school": "Illusion",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "You send a pleasant, but tiring vision to a specific creature that you name or otherwise specifically designate. The erotic dream allows restful sleep, but leaves the subject fatigued, though able to regain spells. For the next day, the subject also suffers disadvantage on saving throws against mind affecting spells.\n\nThe difficulty of the save depends on how well you know the subject and what sort of physical connection you have to that creature.\n\nKnowledge\tSave Modifier\nSecondhand (You have heard of the target)\t+5\nFirsthand (You have met the target)\t+0\nFamiliar (You know the target well)\t-5\nConnection\tSave Modifier\nLikeness or Picture\t-2\nPossession or Garment\t-4\nBody Part, Lock of Hair, Bit of Nail\t-10\n\nIf the recipient is awake when the spell begins, you can choose to cease casting (ending the spell) or to enter a trance until the recipient goes to sleep, whereupon you become alert again and complete the casting. If you are disturbed during the trance, you must succeed on a Concentration check as if you were in the midst of casting a spell or the spell ends.\n\nIf you choose to enter a trance, you are not aware of your surroundings or the activities around you while in the trance. You are defenseless, both physically and mentally, while in the trance.\n\nCreatures that don't sleep or dream are immune to this spell. A victim cannot be subjected to more than one wet dreams spell at a time.",
        "spell_time": "10 Minutes"
    }, {
        "spell_classes": "Cleric, Warlock",
        "spell_components": "V",
        "spell_duration": "Instantaneous",
        "spell_id": 1357,
        "spell_level": 7,
        "spell_name": "Word of Repression",
        "spell_range": "40 feet",
        "spell_ritual": 0,
        "spell_school": "Evocation",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "Any creature within the area who hears the word of repression, and has engaged in sexual activity, except masturbation (see below), within the past day, suffers the following effects. In cases where this is not known, assume a 20% chance for each individual creature.\n\nThe effects are cumulative and concurrent. One Wisdom saving throw is allows against these effects.\n\nImpotency: The creature is rendered impotent, as the spell, for day. This has no effect on creatures that do not have sex, such as undead, constructs, or plants.\n\nStunned: The creature is stunned for 1 round.\n\nConfused: The creature is confused, as by the confusion spell, or ld10 minutes. This is a mind-affecting enchantment effect.\n\nKilled: Living creatures take 7d10 damage. Creatures that do not have sex, such as undead, constructs, or plants are unaffected.\n\nHD\tEffect\nEqual to caster level\tImpotent\nUp to caster level -1\tStunned, Impotent\nUp to caster level -5\tConfused, Stunned, Impotent\nUp to caster level -10\tKilled, Confused, Stunned, Impotent\n\nIn addition, creatures that succumb to any of the effects listed above also suffer disadvantage to all Sexual Performance checks for ld4 days. Creatures whose HD exceeds your caster level are unaffected by word of repression. Creatures that have masturbated only receive a +5 bonus to their Will save.",
        "spell_time": "1 Action"
    }, {
        "spell_classes": "Druid, Sorcerer, WIzard",
        "spell_components": "V, S",
        "spell_duration": "Permanent",
        "spell_id": 1358,
        "spell_level": 8,
        "spell_name": "Youth's Beauty",
        "spell_range": "Self",
        "spell_ritual": 0,
        "spell_school": "Enchantment",
        "spell_sources": "Book of Erotic Fantasy",
        "spell_text": "You not only cease showing signs of aging, but actually look more youthful as you age. You look one year younger each year that you age, until you reach an apparent age of between 15 and 30 years old. (You may choose to stop the \"age reversal\" at any time.)\n\nIn addition, you remain sexually virile and are able to become pregnant or impregnate someone else. However, your body still ages as normal, suffering any other penalties. If you die and are brought back to life through raise dead, your appearance reverts to its original look. However, resurrection., true resurrection, miracle, or wish restores you with the youthful appearance in place.",
        "spell_time": "1 Action"
    }
]
