[
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Concentration, up to 1 minute",
    "level": 5,
    "name": "Agonizing Chill",
    "range": "90 feet",
    "ritual": 0,
    "school": "Enchantment",
    "sources": "The Elemental Spellbook",
    "text": "\tYou afflict a creature you can see within rangewith a crippling cold that fills its entire body. Thecreature immediately takes 3d10 cold damage, thenmust make a Constitution saving throw or beaffected by the spell for the duration. A creature thatis immune to cold damage is unaffected by this spell.An affected creatures movements are slowed bythe oppressive cold filling its body. Its speed ishalved; it suffers a –2 penalty to its AC; it hasdisadvantage on attack rolls, Dexterity checks, andDexterity saving throws; it has disadvantage onConstitution saving throws to maintainconcentration on spells; it can take either an actionor a bonus action on its turn, but not both; and itcant take reactions.At the end of each of the affected creatures turns,it can repeat the saving throw, ending the effect onitself on a success. On a failed save, the creaturetakes an additional 3d10 cold damage.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 6th level or higher, you can target oneadditional creature for each slot level above 5th.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Concentration, up to 1 minute",
    "level": 7,
    "name": "Arctic Wind",
    "range": "Self (120-foot line)",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tA line of frigid wind 120 feet long and 15 feet wideblasts from you in a direction you choose for thespells duration. Whenever a creature starts its turnin the line, that creature takes 5d8 cold damage andmust make a Strength saving throw or be pushed 30feet away from you in a direction following the line.Any creature in the line must spend 2 feet ofmovement for every 1 foot it moves when movingcloser to you.The wind disperses gas or vapor, and itextinguishes all nonmagical flames in the area, evenprotected flames such as those of lanterns. Magicalflames in the area are immediately dispelled.As a bonus action on each of your turns before thespell ends, you can change the direction in whichthe line blasts from you.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Instantaneous",
    "level": 9,
    "name": "Aurora Blast",
    "range": "500 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou call upon the frigid power of arctic nights,summoning multicolored beams of light to strikeyour foes with supernatural cold.Eight beams of vivid light streak down from thesky at points you choose within range. Each beam is10 feet wide, and each must strike a different point,although a big enough creature may be struck bymultiple beams.A creature struck by one or more beams mustmake a Constitution saving throw, taking 20d6 colddamage per beam on a failed save, or half as muchdamage on a successful one.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Concentration, up to 1 minute",
    "level": 6,
    "name": "Blizzard",
    "range": "150 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tUntil the spell ends, heavy snow swirls throughthe air throughout a 50-foot-tall cylinder with a 100-foot radius centered on a point you choose withinrange. The area is lightly obscured, exposed flames inthe area are doused, and ranged attack rolls in thearea have disadvantage. Thick snow coats theground in the area, making it difficult terrain.When the blizzard appears, each creature in thearea must make a Constitution saving throw, taking4d10 cold damage on a failed save or half as muchdamage on a successful one. A creature must alsomake this saving throw when it enters the spellsarea for the first time on a turn or ends its turnthere. If a creature is flying when it fails this savingthrow, the creature falls to the ground.You are unaffected by this spell. Additionally, youmay designate a number of other creatures up toyour spellcasting ability modifier to also beunaffected by this spell.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "S",
    "duration": "Concentration, up to 1 minute",
    "level": 1,
    "name": "Coldsnap",
    "range": "Self",
    "ritual": 0,
    "school": "Enchantment",
    "sources": "The Elemental Spellbook",
    "text": "\tAn aura of cold air and a pale blue light radiatesout from you to a distance of 30 feet. This areamoves with you and stays centered on you.Whenever a creature within this spells area takescold damage from a spell you cast, increase thatdamage by 2d6.",
    "time": "1 bonus action"
  },
  {
    "classes": "None",
    "components": "V, S, M (a tiny pebble)",
    "duration": "Instantaneous",
    "level": 5,
    "name": "Comet Strike",
    "range": "400 feet",
    "ritual": 0,
    "school": "Conjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tA 20-foot radius sphere of dirty ice plummets tothe ground on a point you can see within range.Each creature in the area of impact must make aStrength saving throw. A creature which fails itssave takes 4d8 bludgeoning damage and 4d6 colddamage and is knocked prone. On a successful save,a creature takes half as much damage and does notfall prone. Objects in the area are also damaged. Thecomet dissolves immediately after impact.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 6th level or higher, the bludgeoningdamage increases by 1d8 for each slot level above5th.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S, M (a diamond worth 1,000 gp, which the spell consumes)",
    "duration": "Until dispelled",
    "level": 8,
    "name": "Cryostasis",
    "range": "Touch",
    "ritual": 0,
    "school": "Abjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYou encase a willing creature in a cocoon of ice,putting it in a state of suspended animation untilthe spell ends. The creature is unconscious until thespell ends. Time does not pass for the creature whilethe spell is active.The icy casing is immune to all damage. The spellends if the ice is affected by a disintegrate spell.Ability checks made to dispel this spell via dispelmagic are made with disadvantage. Spells and othereffects are unable to pass through the ice to affectthe creature inside.Upon casting this spell, you can designate anamount of time after which the spell will end on itsown, safely releasing the encased creature.",
    "time": "1 hour"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Concentration, up to 1 minute",
    "level": 6,
    "name": "Deep Freeze",
    "range": "60 feet",
    "ritual": 0,
    "school": "Transmutation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou attempt to turn one creature that you can seewithin range into solid ice. The creature must makea Constitution saving throw. On a failed save, it isrestrained as its body begins to harden, and it gainsvulnerability to fire damage. On a successful save,the creature isn’t affected. A creature that is immuneto cold damage is unaffected by this spell.A creature restrained by this spell must makeanother Constitution saving throw at the end ofeach of its turns. If it successfully saves against thisspell three times, the spell ends. If it fails its savesthree times, it is turned to ice and subjected to thepetrified condition (except for its continuedvulnerability to fire damage) for the duration. Thesuccesses and failures don’t need to be consecutive;keep track of both until the target collects three of akind. If the affected creature takes fire damage, ithas advantage on its next saving throw.If the creature is physically broken while frozen, itsuffers from similar deformities if it reverts to itsoriginal state.If you maintain your concentration on this spellfor the entire possible duration, the creature isturned to ice until the effect is removed.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Concentration, up to 1 minute",
    "level": 3,
    "name": "Flashfreeze",
    "range": "60 feet",
    "ritual": 0,
    "school": "Enchantment",
    "sources": "The Elemental Spellbook",
    "text": "\tYou attempt to instantly freeze a target solid.Choose one Medium or smaller creature you can seewithin range. If that creature fails a Constitutionsaving throw, it freezes in place and is paralyzed forthe duration.A creature that is immune to cold damage isunaffected by this spell and a creature that isresistant to cold damage has advantage on thesaving throw.As long as a creature is paralyzed by this spell, ithas vulnerability to fire damage. However, if thecreature takes at least 10 points of fire damage atonce, that creature is no longer affected by this spell.An affected creature can repeat the saving throwat the end of each of its turns, ending the effect onitself on a success.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 4th level or higher, you can target oneadditional creature for each slot level above 3rd. Forevery two creatures you could target, you caninstead choose to target a single Large creature.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "1 round",
    "level": 0,
    "name": "Foot Freeze",
    "range": "30 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou cause thick frost to form around a creaturesfeet to immobilize it. Choose a creature you can seewithin range that is touching a floor or othersurface. The creature must succeed on a Dexteritysaving throw or be frozen to the surface. If thesurface is immobile, the creatures speed is reducedto 0.The frost dissolves at the end of the affectedcreatures turn. An affected creature can break freeearly by spending an action.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S, M (a tiny sheet of glass)",
    "duration": "Concentration, up to 10 minutes",
    "level": 3,
    "name": "Frigid Barrier",
    "range": "60 feet",
    "ritual": 0,
    "school": "Conjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYou create sheets of ice on one or more solidsurfaces within range. Each sheet is a 5-foot-squarepanel thats 1 foot thick, and you can create anumber of sheets up to your spellcasting abilitymodifier. The panels can be in any orientation aslong as at least one edge of each panel is anchoredto a solid surface or another panel, although aparticularly lopsided structure may collapse.If a panel cuts through a creatures space when itappears, that creature is pushed to the nearestunoccupied space and must make a Dexterity savingthrow, taking 2d8 cold damage on a failed save orhalf as much damage on a successful one.As a bonus action on each of your turns for theduration, you can create or dissolve any number ofpanels, as long as there are never more panels inplace at one time than your spellcasting abilitymodifier.These sheets of ice are objects that can bedamaged and therefore breached. Each panel has AC10 and 20 hit points, and is vulnerable to firedamage.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Instantaneous",
    "level": 0,
    "name": "Frigid Grasp",
    "range": "Touch",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou reach out and touch a creature, shocking itssystem with sudden cold. Make a melee spell attack.On a hit, the target takes 1d12 cold damage.This spells damage increases by 1d12 when youreach 5th level (2d12), 11th level (3d12), and 17th level(4d12).",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V",
    "duration": "1 round",
    "level": 0,
    "name": "Frost Trap",
    "range": "Self",
    "ritual": 0,
    "school": "Abjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tA weapon, claw, fist, or other physical attack isabruptly chilled upon contact with you. Theattacking creature must make a Dexterity savingthrow. If the creature fails, then the weapon (orbody part, in the case of unarmed or natural attacks)is frozen to your body and cannot be used untilfreed.The frost dissolves at the beginning of the affectedcreatures next turn. The spell can be ended early if acreature within reach uses an action to pull theweapon free of the frost.",
    "time": "1 reaction, which you take when you are hit by a weapon attack"
  },
  {
    "classes": "None",
    "components": "V, S, M (an oblong bead of blue glass)",
    "duration": "Instantaneous",
    "level": 1,
    "name": "Ice Beam",
    "range": "Self (30-foot line)",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tA beam of pale blue light forming a line 30 feetlong and 5 feet wide flashes out from youroutstretched hand in a direction you choose. Eachcreature in the line must make a Dexterity savingthrow. On a failed save, a creature takes 2d8 colddamage, and until the beginning of your next turnits speed is halved and it cant take reactions. On asuccessful save, a creature takes half as muchdamage and does not suffer the other effects.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 2nd level or higher, the damageincreases by 1d8 for each slot level above 1st.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "S",
    "duration": "Concentration, up to 1 minute",
    "level": 4,
    "name": "Ice Blades",
    "range": "Self",
    "ritual": 0,
    "school": "Conjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYou conjure three snowflakes the size of sawblades in your space. The blades spin in the air andorbit around you for the duration.When you cast this spell and as a bonus action oneach of your turns thereafter, you can launch anynumber of the blades toward one or more targetswithin 120 feet of you. Make a ranged spell attack foreach blade. On a hit, a blade deals 1d8 slashingdamage and 2d4 cold damage. Regardless of whetheran attack hits or misses, all blades return to yourspace immediately after the attack.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 5th level or higher, you create oneadditional blade for each slot level above 4th.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "1 hour",
    "level": 4,
    "name": "Ice Body",
    "range": "Self",
    "ritual": 0,
    "school": "Transmutation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou change yourself into a being of magical ice.You keep your general size and shape and retain allyour abilities, but equipment that you are wearingmelds into your body and ceases to function for theduration.While under the effects of this spell, you havevulnerability to fire damage; immunity to cold andpoison damage; and resistance to bludgeoning,piercing, and slashing damage from nonmagicalweapons. Additionally, whenever a creature hits youwith a melee attack or ends its turn in directcontact with you (such as through a grapple), thatcreature takes 1d6 cold damage.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 6th or 7th level, the duration increasesto 8 hours. When you cast this spell using a spell slotof 8th or 9th level, the duration increases to 24hours.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S, M (a hollow glass orb)",
    "duration": "Concentration, up to 10 minutes",
    "level": 7,
    "name": "Ice Cave",
    "range": "Self",
    "ritual": 0,
    "school": "Conjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYou encase your surroundings with ice, lockingyourself and nearby creatures in a cave-like prison ofice. The maximum size of the enclosure is a 60-footradius sphere centered on you, but sturdy surfaceswill be lined with ice to form the interior contoursof the area. The ice is 6 inches thick where layeredonto existing surfaces, and 3 feet thick where freestanding.If the ice cuts through a creatures space, thecreature is pushed either inside or outside theenclosure (your choice). When the ice appears, youcan cause up to 10 icy stalactites or stalagmites toform, jabbing abruptly inward from the walls, floor,or ceiling of the ice cave. Each spike is 5 feet longand 3 feet wide at the base. A creature whose spacegets spiked must make a Dexterity saving throw,taking 2d8 piercing damage and 3d6 cold damage perspike on a failed save, or half as much damage on asuccessful one.As a bonus action on each of your turns, you cancause up to 5 spikes to erupt or dissolve (or a mix ofboth).",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "S",
    "duration": "Instantaneous",
    "level": 9,
    "name": "Ice Mountain",
    "range": "1 mile",
    "ritual": 0,
    "school": "Conjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tWith a gesture, you cause a glacial mountain of iceto erupt from the ground at a point you choosewithin range. The mountain is 200 feet high at thepeak, with jagged slopes down to a roughly circularbase with a radius of 100 feet.The mountain rises to its full height almostimmediately, likely with catastrophic results for anystructures on or above the ground where the spelltakes effect. A flying creature where the mountainappears must make a Dexterity saving throw, taking10d10 bludgeoning damage on a failed save or half asmuch damage on a successful one. A non-flyingcreature within the area takes 5d10 bludgeoningdamage and is abruptly tossed 50 feet in the airabove the mountain.The entire mountain is made of ice, and istherefore subject to melting and other natural forcesas normal, leaving behind a 1-foot-deep crater ifentirely removed.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "S",
    "duration": "Instantaneous",
    "level": 2,
    "name": "Ice Shield",
    "range": "Self",
    "ritual": 0,
    "school": "Conjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYou conjure a barrier of ice to block incomingattacks. You gain a +5 bonus to AC against thetriggering attack. If the attack still hits, the ice isshattered but absorbs some of the impact, reducingthe damage you take from the attack by 10.If the triggering attack misses, then the ice shieldfuses to the ground to create a 4 foot by 4 footbarrier thats 4 inches thick and can provide cover.(If you are flying or otherwise not on a solid surface,then the ice simply falls.) This ice wall has AC 10 and20 hit points, and is vulnerable to fire damage. Theice is nonmagical after being conjured, and will thusmelt naturally.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 3rd level or higher, for each slot levelabove 2nd, the damage it can absorb from thetriggering attack increases by 5 and the hit points ofa lingering shield increase by 10.",
    "time": "1 reaction, which you take when you are hit by an attack"
  },
  {
    "classes": "None",
    "components": "V, S, M (a shard of glass)",
    "duration": "Instantaneous",
    "level": 1,
    "name": "Ice Spike",
    "range": "30 feet",
    "ritual": 0,
    "school": "Conjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYou conjure an icy, 5-foot-tall stalagmite whicherupts from the ground at a point you can seewithin range. This stalagmite is 3 feet wide at thebase and tapers to a jagged point at the top.A creature in the space when the spike appearsmust make a Dexterity saving throw. On a failedsave, the creature takes 1d8 piercing damage and 2d6cold damage and is knocked prone in the nearestunoccupied space of your choice within 5 feet of thespike. On a successful save, the creature takes onlyhalf damage and is not knocked prone, but is stillpushed out of the spikes space.If there is no unoccupied space within 5 feet of thespike, the creature has disadvantage on the savingthrow and the spike shatters and dissolvesimmediately after dealing its damage. Otherwise, thespike occupies the space it was conjured in untildestroyed or melted by normal means.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 2nd level or higher, the piercing damageincreases by 1d8 for each slot level above 1st.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "1 round",
    "level": 0,
    "name": "Ice Ward",
    "range": "Self",
    "ritual": 0,
    "school": "Abjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYour body is encircled by glowing blue runes,granting you a barrier of chill magic. Until the endof your next turn, you have resistance to fire andcold damage.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Concentration, up to 1 hour",
    "level": 3,
    "name": "Ice Warrior",
    "range": "60 feet",
    "ritual": 0,
    "school": "Conjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYou conjure a medium creature made of magicalice in the shape of a humanoid warrior. The icewarrior appears in an unoccupied space you can seewithin range, and disappears if it is reduced to 0 hitpoints or when the spell ends. It is considered anelemental.The summoned warrior is friendly to you and yourcompanions. The warrior acts immediately after youin the initiative order. It obeys any verbal commandsyou issue to it (no action required by you), but itsabilities are limited (see below). If you dont issueany commands to the warrior, it defends itself fromhostile creatures but otherwise takes no actions.The ice warrior cannot take any actions except theAttack, Dash, Disengage, or Dodge actions. It has thestatistics of a veteran (Monster Manual page 350)except that it cannot speak, its longsword attack isalways one-handed, it deals an extra 1d4 cold damageon a hit, and it lacks the shortsword and crossbowattack options. Additionally, it has vulnerability tofire damage and immunity to cold, necrotic, andpoison damage.\r\n\tAt Higher Levels: When you cast this spell usingcertain higher-level spell slots, you can summonmore warriors: two warriors with a 5th-level slot,three warriors with a 7th-level slot, and fourwarriors with a 9th-level slot.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Concentration, up to 1 minute",
    "level": 2,
    "name": "Icicle Blast",
    "range": "Self (30-foot cone)",
    "ritual": 0,
    "school": "Conjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYou unleash a wave of cold that causes jagged icecrystals to rapidly form on surfaces in the area. Theground, walls, and other solid surfaces within thearea become layered in ice for the duration.Affected areas of the ground are difficult terrain,and any creature that falls prone on affected groundor is forcefully slammed into an affected surfacetakes 1d8 piercing damage (in addition to thedamage from the fall or other effect).Each creature on the ground in the area when youcast the spell must make a Dexterity saving throw.On a failed save, a creature takes 2d6 cold damageand falls prone (taking the piercing damagedescribed above). On a successful save, a creaturetakes half as much cold damage and does not fallprone.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 3rd level or higher, the cold damageincreases by 1d6 for each slot level above 2nd.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "S",
    "duration": "Concentration, up to 1 minute",
    "level": 1,
    "name": "Oppressive Cold",
    "range": "60 feet",
    "ritual": 0,
    "school": "Enchantment",
    "sources": "The Elemental Spellbook",
    "text": "\tYou overwhelm a creature with debilitating cold.Choose a creature you can see within range to makea Constitution saving throw. On a failed save, thatcreature is affected for the duration. A creature withresistance to cold damage has advantage on thissaving throw, and a creature with immunity to colddamage is unaffected by the spell.An affected creatures speed is halved, it cant takereactions, and it has disadvantage on weapon attacksand Dexterity saving throws. The creature also gainsvulnerability to fire damage, but ceases to beaffected by this spell after taking any fire damage.A creature can repeat the saving throw at the endof each of its turns. On a success, that creature is nolonger affected by the spell. On a failure, thecreature takes 1d6 cold damage.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 2nd level or higher, you can target oneadditional creature for each slot level above 1st.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Up to 1 hour",
    "level": 0,
    "name": "Refreshing Chill",
    "range": "10 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tThis spell is a minor magical trick thatcryomancers use for practice. You create one of thefollowing magical effects within range:• You create a small, harmless sensory effect, suchas a sprinkling of snowflakes or a patch of thinfrost.• You chill up to 1 cubic foot of nonliving materialfor 1 hour.• You grant a creature advantage on savingthrows against hot weather for 1 hour.• You instantaneously freeze a volume of waterno more than 1 foot in any dimension.If you cast this spell multiple times, you can haveup to three of its non-instantaneous effects active ata time, and you can dismiss such an effect as anaction.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "1 hour",
    "level": 8,
    "name": "Reign of Winter",
    "range": "Self (200-foot sphere)",
    "ritual": 0,
    "school": "Transmutation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou grip the area with an oppressive cold. At thetime you cast the spell, all fires in the area—bothmagical and nonmagical—are instantly extinguished.New fires cannot be started in the area, and firesbrought into the area are immediately extinguished.Fire damage cannot be dealt in the area.Bodies of water within the area—including flowingwater, such as a river or waterfall—are frozen solid.If a body of water extends beyond the spells area,the portion of water within the area is frozen.Whenever a creature enters the area for the firsttime on a turn or starts its turn there, it must makea Constitution saving throw, taking 4d10 colddamage on a failed save or half as much damage ona successful save. Any creature which does not haveresistance or immunity to cold damage has theirspeed halved and cannot take reactions as long asthey are in the area.If a creature within the area casts a spell or usesan ability that includes fire damage, the entire spellor ability fails with no effect, and the creature mustsave against the spell as described above. A creaturewhich fails the save in this way is blasted withretributive cold and is paralyzed until the end oftheir next turn.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "S, M (a small ball of cotton)",
    "duration": "Concentration, up to 1 minute",
    "level": 2,
    "name": "Snowball",
    "range": "60 feet",
    "ritual": 0,
    "school": "Conjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYou conjure a two-inch wide ball of ice and snowin your hand, which you can launch at your foes as abonus action. When you do so, choose a point youcan see within range. The snowball streaks towardthat point, then detonates in a frigid blast with a5-foot radius. Each creature within the blast mustmake a Dexterity saving throw, taking 5d4 colddamage on a failed save or half as much damage ona successful save.If you choose not to launch the snowballimmediately, you can spend your action on futureturns to increase the spells power. For each actionspent empowering the snowball, the size of thedamage dice improves by one step. The damage dicecannot improve beyond d12s. Similarly, each actionspent empowering the snowball increases the radiusof the blast by 5 feet, up to a maximum radius of 25feet.If the spell ends before you launch the snowball, itdetonates at its current power level. If the snowballcannot reach the target point (for example, if youtargeted a point on the other side of a pane of glass)then it detonates upon striking a barrier.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 3rd level or higher, the damage increasesby one die for each slot level above 2nd.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S, M (a piece of cotton)",
    "duration": "Concentration, up to 10 minutes",
    "level": 1,
    "name": "Snowfield",
    "range": "90 feet",
    "ritual": 0,
    "school": "Conjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYou conjure a layer of snow that coats the groundin a 20-foot-radius area centered on a point youchoose within range. The snow is 1 foot deep,making the area difficult terrain. A creature thatends its turn in the snow takes 1d4 cold damage. Thesnow dissolves when the spell ends.Fire SpellsUse these spells to create a fire-themed spellcasteror pick and choose to supplement a more diversemagical portfolio. Fire spells are all about burning,but that doesn’t mean a pyromancer doesn’t stillhave a few tricks up their sleeve.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S, M (a pinch of soot)",
    "duration": "Concentration, up to 1 minute",
    "level": 2,
    "name": "Ash Cloud",
    "range": "90 feet",
    "ritual": 0,
    "school": "Conjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYou create a 20-foot-radius sphere of swirlingsmoke, soot, ash, and embers. The cloud spreadsaround corners, and its area is lightly obscured. Thecloud lingers in the area for the duration.A creature which enters the cloud for the firsttime on a turn or starts its turn there must make aConstitution saving throw or be affected by thespell. An affected creatures eyes water and stingfrom the hot embers, giving it disadvantage onattack rolls and Wisdom (Perception) checks thatrely on sight. Whenever an affected creature ends itsturn outside the cloud, that creature can repeat thesaving throw, ending the effect on itself on asuccess.A moderate wind (at least 10 miles per hour)disperses the cloud after 4 rounds. A strong wind (atleast 20 miles per hour) disperses it after 1 round.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 5th level or higher, an affected creatureis also blinded.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Instantaneous",
    "level": 0,
    "name": "Cinder Flare",
    "range": "30 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou cause an eruption of bright embers to burstnear the eyes of one creature you can see withinrange. The creature must succeed on a Dexteritysaving throw or be blinded until the start of its nextturn.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "S",
    "duration": "Instantaneous",
    "level": 5,
    "name": "Consume Flame",
    "range": "Touch",
    "ritual": 0,
    "school": "Transmutation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou touch an open flame and extinguish it,absorbing its power. You gain temporary hit pointsbased on the size and power of the fire. Touching asource of fire as part of this spell does not harm you.If the consumed fire is a nonmagical flame the sizeof a Medium creature or smaller, you gain 5temporary hit points. The number of temporary hitpoints gained increases by 5 for each size categoryabove Medium.If the consumed fire is an ongoing spell effect,then the spell ends and you gain a number oftemporary hit points equal to 10 plus 5 per spell levelof the spell consumed.You can also consume the heat from lava, coolingand hardening it in the process. You gain temporaryhit points equal to the radius (in feet) of the area oflava cooled, up to a maximum radius of 30 feet.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V",
    "duration": "Concentration, up to 1 minute",
    "level": 1,
    "name": "Corona",
    "range": "Self",
    "ritual": 0,
    "school": "Enchantment",
    "sources": "The Elemental Spellbook",
    "text": "\tAn aura of dry heat and a faint orange lightradiates out from you to a distance of 30 feet. Thisarea moves with you and stays centered on you.Whenever a creature within this spells area takesfire damage from a spell you cast, increase thatdamage by 2d6.",
    "time": "1 bonus action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Instantaneous",
    "level": 3,
    "name": "Detonate",
    "range": "Self (15-foot sphere)",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou set off a fiery explosion centered on yourself.Each creature in the area other than yourself mustmake a Strength saving throw. On a failed save, acreature takes 5d8 fire damage, is pushed 10 feetaway from you, and is knocked prone. On asuccessful save, a creature takes half as muchdamage and isnt pushed or knocked prone.The fire ignites flammable objects in the area thatarent being worn or carried. In addition, unsecuredobjects that are completely within the area of effectare automatically pushed 10 feet away from you bythe spells effect, and the spell emits a thunderousboom audible out to 300 feet.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 4th level or higher, the damage increasesby 1d8 for each slot level above 3rd.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S, M (a small pebble and a bit of sulfur)",
    "duration": "Concentration, up to 1 minute",
    "level": 5,
    "name": "Eruption",
    "range": "60 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou cause a volcanic eruption. Choose a point youcan see on the ground within range. The groundwithin 5 feet of the chosen point becomes difficultterrain. A creature standing on the affected areawhen you cast this spell must make a Dexteritysaving throw, taking 4d6 fire damage on a failed saveor half as much damage on a successful one. Acreature must also make this saving throw when itends its turn in the affected area.Additionally, four fiery globs launch into the airfrom the eruption site, rising to a height of 20 feetbefore crashing down at four separate points youcan see within 30 feet of the eruption site. Acreature within 5 feet of an impact must saveagainst the spells damage, as above.For the duration, you can use a bonus action oneach of your turns to cause the volcano to launchthree more globs of magma.When the spell ends, the fire and magmadisappear, but the difficult terrain of the eruptionsite remains until cleared.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 6th level or higher, increase the damagedealt by each glob of magma by 1d6 for each slotlevel above 5th.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "4 hours",
    "level": 9,
    "name": "Flame Body",
    "range": "Self",
    "ritual": 0,
    "school": "Transmutation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou transform yourself into a being of pure flame.You retain your size category and general shape, aswell as your existing features and abilities, and forthe duration you gain the following benefits.You glow with an orange light, shedding brightlight out to a 30-foot radius and dim light for anadditional 30 feet. You gain a flying speed of 60 feet.Whenever a creature moves to within 10 feet ofyou, starts its turn there, or hits you with a meleeattack, that creature takes 5d10 fire damage. Youhave immunity to bludgeoning, piercing, slashing,and fire damage.You can cast fireball as a 3rd-level spell withoutexpending a spell slot. Whenever you roll firedamage for a spell you cast, roll dice that are onestep larger than normal. For example, a spell thatnormally deals 8d6 fire damage would deal 8d8 firedamage instead.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "S",
    "duration": "Instantaneous",
    "level": 1,
    "name": "Flame Slash",
    "range": "15 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou swing your arm in a wide arc, and a stream offire follows along at a distance. Choose a pointwithin range. Fire fills a line 5 feet wide and 20 feetlong from that point, but every part of the line is anequal distance from you, thus forming an arc.Each creature in the area must make a Dexteritysaving throw. A creature takes 3d6 fire damage on afailed save, or half as much damage on a successfulone.The fire ignites flammable objects in the area thatarent being worn or carried.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 2nd level or higher, the damageincreases by 1d6 for each slot level above 1st.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S, M (a tiny brass ring)",
    "duration": "Concentration, up to 1 minute",
    "level": 6,
    "name": "Flame Vortex",
    "range": "90 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou cause a mighty tornado of fire to erupt,trapping your enemies in a hellish inferno.Choose a point you can see on the ground withinrange. The vortex forms with an interior radiusbetween 5 and 20 feet (your choice) surrounded by 1-foot-thick flames, which are opaque. The vortexreaches 60 feet upwards, and the diameter at thetop is double the diameter of the bottom.When the vortex appears, each creature whosespace is crossed by the flames must make a Dexteritysaving throw. On a failed save, a creature takes 6d8fire damage and is pulled into an unoccupied spaceinside the vortex (if possible). On a successful save, acreature takes half as much damage and is notpulled in. A creature who is not pulled in, either dueto a successful save or a lack of space, is pushed outto the nearest unoccupied space within 5 feet of theflames (if possible).A creature trapped inside the vortex can use itsaction to try and force its way through the flames toescape. To do so, it makes a Strength saving throw.On a successful save, it pushes through the flamesand exits the vortex, unless there is not enoughspace for it or it does not have enough movement toleave. On a failed save, the creature remains in thevortex. In either case, the creature trying to pushthrough the flames takes 6d8 fire damage.If a trapped creature does not attempt to pushthrough the flames and does not otherwise escapethe vortex on its turn, that creature takes 3d8 firedamage at the end of its turn.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 7th level or higher, the damage increasesby 1d8 for each spell level above 6th.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "1 round",
    "level": 0,
    "name": "Flame Ward",
    "range": "Self",
    "ritual": 0,
    "school": "Abjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYour body is encircled by glowing red runes,granting you a barrier of warmth. Until the end ofyour next turn, you have resistance to cold and firedamage.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Instantaneous",
    "level": 0,
    "name": "Flame Wreath",
    "range": "5 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou surround yourself in a brief vortex of fire. Eachcreature other than you within range must succeedon a Dexterity saving throw or take 1d6 fire damage.This spells damage increases by 1d6 when youreach 5th level (2d6), 11th level (3d6), and 17th level(4d6).",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Instantaneous",
    "level": 4,
    "name": "Ghostflame",
    "range": "Self (30-foot cone)",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou extend your arms and release a swirlingtorrent of pure, lightless heat, visible only as amirage-like shimmer in the air. Each creature in thearea must make a Dexterity saving throw. A creaturetakes 7d6 fire damage on a failed save, or half asmuch damage on a successful one. If a creature hasresistance to fire damage, that resistance does notapply to this spell.The heat from this spell ignites any flammableobjects in the area that arent being worn or carried.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 5th level or higher, the damage increasesby 1d6 for each slot level above 4th.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S, M (a pinch of sand)",
    "duration": "Concentration, up to 10 minutes",
    "level": 3,
    "name": "Heat Shimmer",
    "range": "Self (60-foot sphere)",
    "ritual": 0,
    "school": "Illusion",
    "sources": "The Elemental Spellbook",
    "text": "\tYou fill the area with a dry heat that causesshimmering mirages to interfere with visibility. Thearea remains centered on you and moves with you.A creature or object of Medium size or smaller isheavily obscured with respect to any observerlooking through at least 20 feet of the spells area.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "S",
    "duration": "Concentration, up to 1 hour",
    "level": 3,
    "name": "Hypnotic Flame",
    "range": "60 feet",
    "ritual": 0,
    "school": "Enchantment",
    "sources": "The Elemental Spellbook",
    "text": "\tChoose a flame you can see within range, such asa torch or a fireplace. Each creature of your choicethat can see the flame must make a Wisdom savingthrow. A creature that is immune to being charmedsucceeds automatically, and a creature that isfighting you or your allies has advantage on the save.If the flame poses a clear threat (such as if thebuilding youre in is on fire), then all viewers haveadvantage on the save.On a failed save, an observer becomesincapacitated and has its speed reduced to 0 as itstops to watch the flame for the duration. The effectends for a creature if that creature takes anydamage, is attacked by a creature it can see, or canno longer see the flame.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "S",
    "duration": "Concentration, up to 1 minute",
    "level": 1,
    "name": "Ignite Aether",
    "range": "30 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tWith an arcane gesture, you cause a creature youcan see within range to burst into flames. Thecreature takes 2d8 fire damage and must make aDexterity saving throw. On a success, the spell ends.On a failure, the creature is on fire and takes anadditional 1d6 fire damage on the start of each of itsturns. An affected creature can use its action toextinguish the flames, ending the spell.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 2nd level or higher, for each slot levelabove 1st, the initial damage increases by 1d8 and theongoing damage increases by 1d6.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Concentration, up to 1 minute",
    "level": 8,
    "name": "Inferno Rain",
    "range": "200 feet",
    "ritual": 0,
    "school": "Conjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYou conjure a swirling cloud of fiery wrathoverhead, which rains down fire selectively on yourenemies. The cloud is a 5-foot-thick horizontal diskwith a 100-foot radius centered on a point you cansee within range at least 20 feet above you. The spellfails if there is not enough room to accommodatethe cloud, although the cloud can spread aroundcorners, and weak barriers (such as windows) aredestroyed and broken through as it appears.When the cloud appears and as an action on eachof your turns until the spell ends, streams of fire raindown on a number of points beneath the cloud upto your spellcasting ability modifier. A creaturestruck by a stream of fire must make a Dexteritysaving throw, taking 10d8 fire damage on a failedsave or half as much damage on a successful one.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "S",
    "duration": "Instantaneous",
    "level": 5,
    "name": "Meteor Dash",
    "range": "Self",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou wreathe yourself in fire and launch yourselflike a meteor, flying in a direction of your choice.If you would strike a creature, that creature canmake a Dexterity saving throw. On a successful save,your trajectory continues past the creature withoutstriking them, but they take 2d6 fire damage fromthe near miss. On a failed save, you strike thatcreature.You continue flying in a straight line until youstrike a creature, collide with a solid surface, or fly adistance of 120 feet. Minor barriers, such as simplewooden doors or common fruit carts, are destroyedwithout interrupting your flight path.If you strike a creature or a solid surface, thecreature or object takes 8d6 fire damage and 4d6bludgeoning damage, and the creature is knockedprone if it is Large or smaller. Other creatures within10 feet of the point of impact (besides yourself) mustmake a Dexterity saving throw, taking 8d6 firedamage on a failed save, or half as much fire damageon a successful one.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 6th level or higher, the fire damageincreases by 1d6 for each slot level above 5th.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S, M (incense and charcoal worth at least 500 gp, which the spell consumes)",
    "duration": "Concentration, up to 1 hour",
    "level": 6,
    "name": "Peer Through Flames",
    "range": "Self",
    "ritual": 0,
    "school": "Divination",
    "sources": "The Elemental Spellbook",
    "text": "\tYou gain the ability to pass your senses intodistant flames, allowing you to spy or communicate.Upon casting this spell, you become aware of thelocation of every nonmagical flame within 100 miles.As an action, you can pass your consciousness intoany one of those flames. When you do so, you cansee and hear as though you were in the selectedflames location, but you are deaf and blind withregard to your own senses. You can continue toobserve through the flame until the spell ends, untilyou switch to a different flame as an action, or untilyou resume your normal senses as an action.While you are observing through a flame, you canchoose to speak through it as well. Doing so causesthe flame to take on the rough shape of your face,and maintains this visage until you are no longerpresent in that flame.",
    "time": "1 minute"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Instantaneous",
    "level": 5,
    "name": "Purifying Flame",
    "range": "Self (30-foot cone)",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou release a cone of golden flame that burnsaway impurities. Each creature in the area mustmake a Dexterity saving throw. Undead creatureshave disadvantage on this saving throw. A creaturetakes 8d6 fire damage on a failed save, or half asmuch damage on a successful one.For each damage die that rolls a 5 or a 6, oneongoing spell or magical effect in the area isdispelled unless it is of a higher spell level than thespell slot used to cast this spell. The lowest-levelspells in the area are dispelled first.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 6th level or higher, the damage increasesby 1d6 for each slot level above 5th.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Concentration, up to 10 minutes",
    "level": 3,
    "name": "Servant of Flame",
    "range": "60 feet",
    "ritual": 0,
    "school": "Conjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYou summon a group of four magma mephits(Monster Manual page 216) which appear inunoccupied spaces that you can see within range.Each mephit that remains when the spell endsvanishes without a trace.The summoned mephits are friendly to you andyour companions. Roll initiative for the mephits as agroup, which has its own turns. They obey anyverbal commands that you issue to them (no actionrequired by you). If you dont issue any commandsto them, they defend themselves from hostilecreatures, but otherwise take no actions.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 4th level or higher, you summon 1d4additional mephits for each slot level above 3rd.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S, M (a bit of wax and string)",
    "duration": "10 minutes",
    "level": 0,
    "name": "Spirit Candles",
    "range": "60 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou create up to three ghostly blue flames withinrange, which hover in the air and burn withoutproducing heat or using oxygen. Each flame shedsbright light in a 10-foot radius and dim light for anadditional 10 feet.As a bonus action on your turn, you can move theflames up to 30 feet to a new spot within range. Aflame winks out if it exceeds the spells range, or ifyou cast this spell again.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S, M (a pinch of fine ash)",
    "duration": "Instantaneous",
    "level": 4,
    "name": "Utter Immolation",
    "range": "60 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tA vertical column of intense flame erupts from theground in a 15-foot-radius, 30-foot-high cylindercentered on a point within range. Each creature inthe area must make a Dexterity saving throw, taking6d8 fire damage on a failed save, or half as muchdamage on a successful one. A creature reduced to 0hit points by this damage is entirely consumed,leaving behind only ash.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 5th level or higher, the damage increasesby 1d8 for each spell level above 4th.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "S",
    "duration": "Up to 1 hour",
    "level": 0,
    "name": "Warmth",
    "range": "10 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tThis spell is a minor magical trick thatpyromancers use for practice. You create one of thefollowing magical effects within range:• You create a tiny flame in your hand for up to 1hour, shedding light as a candle and capable oflighting a lantern, torch, or other easilyflammable material.• You warm up to 1 cubic foot of nonlivingmaterial for 1 hour.• You grant a creature advantage on savingthrows against cold weather for 1 hour.• You instantaneously snuff out a flame no largerthan a small campfire.If you cast this spell multiple times, you can haveup to three of its non-instantaneous effects active ata time, and you can dismiss such an effect as anaction.Lightning SpellsUse these spells to create a lightning-themedspellcaster or pick and choose to supplement a morediverse magical portfolio. Lightning spells allow youto stun your enemies, short-circuit other spells, andof course deal lightning damage.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S, M (a ball bearing)",
    "duration": "1 minute",
    "level": 4,
    "name": "Ball Lightning",
    "range": "120 feet",
    "ritual": 0,
    "school": "Conjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYou summon a 4-foot-diameter ball of cracklingelectrical energy that bounces around the battlefield.When you cast the spell, you launch the ball at acreature you can see within range. The target mustmake a Dexterity saving throw, taking 4d8 lightningdamage on a failed save or half as much damage ona successful save.At the start of the targeted creatures turn, the ballchanges direction to launch itself at the nearestother creature within 30 feet. The new target mustsave against the spells damage. This process repeatsfor the duration of the spell.If two creatures are tied for the nearest, the newtarget is selected randomly from among them. If nonew target is in range, the ball waits until a creaturecomes within 30 feet and then launches.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 5th level or higher, the damage increasesby 1d8 for each slot level above 4th.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "1 minute",
    "level": 3,
    "name": "Blinding Arc",
    "range": "60 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tAn electrical spark flashes brightly at a point youcan see within range. Each creature within 15 feet ofthe flash must make a Dexterity saving throw or beblinded for the duration. An affected creature canmake a Constitution saving throw at the end of eachof its turns, ending the effect on itself on a success.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "S",
    "duration": "1 round",
    "level": 3,
    "name": "Charge",
    "range": "Touch",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou build a charge while running and then releaseit in a devastating electric punch. After casting thisspell, before the end of your next turn you can spenda bonus action to deliver the punch, which ends thespell. The target must make a Dexterity savingthrow, taking 6d6 lightning damage on a failed saveor half as much damage on a successful save.The spell becomes more powerful if you move in astraight line toward your target immediately beforedelivering the punch. For every 5 feet moved thisway, replace one of the damage dice with a d12.Make this substitution before rolling. If at least fourdice are replaced this way, then a target that fails itssave is also pushed 10 feet away from you andknocked prone.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 4th level or higher, the damage increasesby 1d6 for each slot level above 3rd.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Instantaneous",
    "level": 4,
    "name": "Crackling Burst",
    "range": "90 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou blast a creature or object with lightning,which then arcs to a number of other targets up toyour spellcasting ability modifier within 30 feet ofthe primary target.Each target must make a Dexterity saving throw,taking 5d10 lightning damage on a failed save or halfas much damage on a successful save. If the primarytarget is wearing heavy armor made primarily ofmetal or is a creature made primarily of metal (suchas an iron golem) then the secondary targets havedisadvantage on their saving throws.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 5th level or higher, the damage increasesby 1d10 for each slot level above 4th.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Instantaneous",
    "level": 9,
    "name": "Decimation Bolts",
    "range": "Self (500-foot lines)",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou fire ten bolts of destructive elemental power.Each bolt fills a line 500 feet long and 5 feet wide.Each creature within the area must make a Dexteritysaving throw. On a failed save, a creature takes 20d6lightning damage and is stunned until the end ofthat creatures next turn. On a successful save, thecreature takes half as much damage and is notstunned.Any spells or magical effects within the area ofone or more bolts are dispelled.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S, M (a piece of wool)",
    "duration": "Concentration, up to 10 minutes",
    "level": 2,
    "name": "Electric Armaments",
    "range": "Touch",
    "ritual": 0,
    "school": "Enchantment",
    "sources": "The Elemental Spellbook",
    "text": "\tYou touch a metal weapon, metal shield, or suit ofmetal armor and imbue it with elemental lightningfor the duration.If the imbued object is a weapon, it deals an extra1d6 lightning damage on a hit.If the imbued object is a shield or a suit of armor,whenever the wearer is hit by a melee attack, theattacker takes 1d6 lightning damage.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 3rd level or higher, the damage increasesby 1d6 for each slot level above 2nd.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Concentration, up to 1 minute",
    "level": 3,
    "name": "Electric Fence",
    "range": "90 feet",
    "ritual": 0,
    "school": "Abjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYou create an invisible, spherical perimeter arounda point you can see within range. The area has aradius of 15 feet. Whenever a creature would enteror leave this area without teleporting, the spelldelivers an electric shock.An affected creature must make a Constitutionsaving throw. On a failed save, the creature takes 3d8lightning damage and until the beginning of its nextturn its speed is reduced to 0 and it cant gain anybonuses to its speed. This occurs before the creaturecrosses the threshold. On a successful save, thecreature takes half as much damage and itsmovement is not impeded.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 4th level or higher, the damage increasesby 1d8 for each slot level above 3rd.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S, M (a tiny glass globe with silver filigree worth 250 gp)",
    "duration": "Instantaneous",
    "level": 4,
    "name": "Electromagnetic Pulse",
    "range": "Self (30-foot sphere)",
    "ritual": 0,
    "school": "Abjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYou release a burst of electric energy that fills thearea, spreading around corners. Each creaturebesides you in the area must make a Constitutionsaving throw, taking 2d12 lightning damage on afailed save or half as much damage on a successfulone.Additionally, each active spell or magical effect inthe area whose spell level is no more than half thelevel of the slot used to cast this spell isautomatically dispelled. For each other spell ormagical effect in the area, make an ability checkusing your spellcasting ability. The DC of this checkequals 10 plus the spells level. On a success, the spellends.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 5th level or higher, the damage increasesby 1d12 for each slot level above 4th.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S, M (a dead firefly)",
    "duration": "Concentration, up to 1 minute",
    "level": 2,
    "name": "Enliven Corpse",
    "range": "30 feet",
    "ritual": 0,
    "school": "Necromancy",
    "sources": "The Elemental Spellbook",
    "text": "\tYou force an electric charge into a Small orMedium corpse, forcing it to move according to yourwill. The corpse is not conscious and does not act onits own—its more like a puppet than an undeadcreature.As part of casting this spell, and as an action oneach of your turns thereafter, you can force thesubject to move with a speed of 30 feet and make amelee attack with one of its limbs. This attack usesyour spell attack bonus. On a hit, it deals 2d8lightning damage.The corpse has an AC equal to your spell save DC.It has no hit points, but whenever it takes damageyou must make a Constitution saving throw tomaintain concentration as though you had taken thedamage. The corpse automatically fails all savingthrows and ability checks.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "1 round",
    "level": 0,
    "name": "Gather Power",
    "range": "Self",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou store up electrical power for a future blast.The next time you roll lightning damage for one ofyour spells before the end of your next turn, thatdamage increases by 1d10.This spells damage increases by 1d10 when youreach 5th level (2d10), 11th level (3d10), and 17th level(4d10).",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Instantaneous",
    "level": 0,
    "name": "Jolt",
    "range": "90 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou fire a bolt of electricity at a creature or objectwithin range. Make a ranged spell attack against thetarget. On a hit, the target takes 1d10 lightningdamage.This spells damage increases by 1d10 when youreach 5th level (2d10), 11th level (3d10), and 17th level(4d10).",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Concentration, up to 1 hour",
    "level": 5,
    "name": "Lightning Army",
    "range": "150 feet",
    "ritual": 0,
    "school": "Enchantment",
    "sources": "The Elemental Spellbook",
    "text": "\tYou infuse up to five willing creatures withinrange with lightning to grant them speed andpower. An affected creatures speed increases by 10feet, and it gains a +2 bonus to AC and to Dexteritysaving throws.Whenever an affected creature hits with a weaponattack, the attack deals an extra 1d8 lightningdamage. Whenever an affected creature is hit by amelee attack, the attacker takes 1d8 lightningdamage. Whenever a creature ends its turn in directcontact with an affected creature (such as bygrappling), that creature takes 1d8 lightning damage.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 6th level or higher, you can affect anadditional five creatures for each slot level above 5th.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, M (a weapon)",
    "duration": "Instantaneous",
    "level": 0,
    "name": "Lightning Blade",
    "range": "5 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tAs part of the action used to cast this spell, youmust make a melee weapon attack against onecreature within range. Otherwise, the spell fails.On a hit, the target suffers the normal effects ofthe attack, and one other creature within 10 feet ofthe target takes 1d8 lightning damage.When you reach 5th level, one additionalsecondary target takes lightning damage. Threesecondary targets are affected at 11th level, and fourat 17th level.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Instantaneous",
    "level": 2,
    "name": "Lightning Blast",
    "range": "Self (15-foot cone)",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou release a blast of elemental lightning. Eachcreature in the area must make a Dexterity savingthrow, taking 3d8 lightning damage on a failed saveor half as much damage on a successful one.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 3rd level or higher, the damage increasesby 1d8 for each slot level above 2nd.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Instantaneous",
    "level": 3,
    "name": "Lightning Leap",
    "range": "60 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tChoose a point you can see within range. Youteleport to the chosen point through a streak oflightning. Each creature in a 5-foot-wide line fromyour starting point to your destination must make aDexterity saving throw. A creature takes 5d8lightning damage on a failed save, or half as muchdamage on a successful one.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 4th level or higher, the damage increasesby 1d8 for each slot level above 3rd.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S, M (a small crystal lens)",
    "duration": "Concentration, up to 1 minute",
    "level": 1,
    "name": "Lightning Orb",
    "range": "60 feet",
    "ritual": 0,
    "school": "Conjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYou conjure a 6-inch-diameter ball of glowing,crackling light that hovers at a point you choosewithin range. The orb sheds bright light in a 10-footradius and dim light for an additional 10 feet. As abonus action on each of your turns you can movethe orb up to 30 feet, though it winks out and thespell ends if it moves outside the spells range.For the duration, whenever you cast a spell thatdeals lightning damage, you can choose to use theorb as the point of origin for the spell.",
    "time": "1 bonus action"
  },
  {
    "classes": "None",
    "components": "S",
    "duration": "1 minute",
    "level": 5,
    "name": "Lightning Rod",
    "range": "Self",
    "ritual": 0,
    "school": "Abjuration",
    "sources": "The Elemental Spellbook",
    "text": "\tYou absorb incoming lightning, taking no damageand instead gaining temporary hit points equal tothe prevented damage until the spell ends. Wheneveryou roll lightning damage for a spell you cast, youcan sacrifice any number of the temporary hit pointsgranted by this spell and add the same number tothe damage roll.As long as you still have any of these temporaryhit points remaining, your speed increases by 10 feetand you have advantage on Dexterity saving throws.",
    "time": "1 reaction, which you take when you would take lightning damage"
  },
  {
    "classes": "None",
    "components": "V",
    "duration": "1 round",
    "level": 0,
    "name": "Lightning Speed",
    "range": "Self",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou infuse your legs with electricity, adding speedand abruptness to your movements. Until the end ofyour turn, attacks of opportunity against you havedisadvantage.",
    "time": "1 bonus action"
  },
  {
    "classes": "None",
    "components": "V, S, M (strands of glass filigree)",
    "duration": "Concentration, up to 10 minutes",
    "level": 8,
    "name": "Lightning Tether",
    "range": "150 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou cause tendrils of lightning to spring forth outof the ground, walls, ceilings, or other sturdysurfaces to grasp and hold your enemies. A numberof creatures you can see up to twice yourspellcasting ability modifier must each succeed on aDexterity saving throw or be affected by the spell. Acreature more than 20 feet from any solid surface isunaffected.An affected creature is leashed by animatedlightning and instantly pulled to its anchoringsurface. The creatures speed becomes zero. At thebeginning of an affected creatures turn, thatcreature takes 5d12 lightning damage.A creature can break free by spending an actionand succeeding on a Strength check against yourspell save DC. Regardless of whether the checksucceeds or fails, the creature takes 5d12 lightningdamage as it strains against the tether.If a tethered creature casts a spell, it must make aConstitution saving throw as though concentrating.On a failed save, the spell is wasted with no effect.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Concentration, up to 1 minute",
    "level": 6,
    "name": "Lingering Shock",
    "range": "90 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou place an electric charge within a creature youcan see within range. The target takes 2d8 lightningdamage and must succeed on a Constitution savingthrow or be stunned until the beginning of its nextturn and be affected by the spell for the duration.An affected creature repeats this process at thestart of each of its turns. If the creature accumulatesthree successful saving throws against the spell, thecreature is no longer affected.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "S",
    "duration": "Instantaneous",
    "level": 1,
    "name": "Magnet Pull",
    "range": "90 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou create an electrical imbalance to generate amagnetic pull. Choose a metal object that weighs nomore than 20 pounds. If the object is not being wornor carried and is not otherwise restrained, it fliestoward you where you can either catch it or let itfall at your feet. If the target is fastened to a solidsurface or otherwise prevented from moving, it maybe possible to pull it free with an ability check usingyour spellcasting ability, at the DMs discretion.If the targeted object is being carried, the wieldermust make a Dexterity save or have the objectpulled from its grasp and fly toward you asdescribed above. If the object is being worn (such asone of the plates of a suit of armor), the wearermust instead make a Strength saving throw or bepulled 15 feet toward you.Alternatively, you can target a creature that ismade largely of metal (such as an iron golem). Sucha creature is affected in the same way as a creaturewearing a targeted object, as described above.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 2nd level or higher, the weight of theobject you can target increases by 20 pounds foreach slot level above 1st.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "S",
    "duration": "Concentration, up to 1 minute",
    "level": 7,
    "name": "Pulse Cannon",
    "range": "Self (90-foot cone)",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou fill the area with overwhelming electricalpower. Each creature which enters the area for thefirst time on a turn or starts its turn there mustmake a Constitution saving throw. On a failed save, acreature takes 7d8 lightning damage and is stunneduntil the start of its next turn. On a successful save,a creature takes half as much damage and is notstunned.As a bonus action on each of your turns, you canchange the direction of the spells area.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "4 hours",
    "level": 9,
    "name": "Raiju Ascension",
    "range": "Self",
    "ritual": 0,
    "school": "Transmutation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou transform yourself in a being of pure lightningwith terrible power. You retain your size categoryand general shape, as well as your existing featuresand abilities, and for the duration you gain thefollowing benefits.You glow with a yellow or blue light (your choice),shedding bright light out to a 30-foot radius and dimlight for an additional 30 feet. You gain a flyingspeed of 60 feet, and can choose to pass throughsolid objects, although you take 2d10 force damage ifyou end your turn inside a solid object.You have immunity to bludgeoning, piercing, andslashing damage. You are also immune to lightningdamage, and any effect that would deal lightningdamage to you instead grants you that manytemporary hit points. Any creature that hits youwith a melee attack takes 4d12 lightning damage.You can cast lightning bolt as a 3rd-level spellwithout expending a spell slot. All your spells andabilities ignore other creatures resistance tolightning damage.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V, S",
    "duration": "Instantaneous",
    "level": 1,
    "name": "Shock",
    "range": "90 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tA bolt of lightning springs from your outstretchedhand toward a creature or object you can see withinrange. Make a ranged spell attack. On a hit, thetarget takes 3d10 lightning damage.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 2nd level or higher, the damageincreases by 1d10 for each slot level above 1st.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V",
    "duration": "Concentration, up to 10 minutes",
    "level": 7,
    "name": "Shocking Aura",
    "range": "Self (30-foot sphere)",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tFor the duration, the area is filled with latentelectrical charges, filling the air with a fainthumming noise. Whenever a creature enters the areafor the first time on a turn or starts its turn there, itmust make a Dexterity saving throw, taking 7d8lightning damage on a failed save or half as muchdamage on a successful one. You can choose toexempt any number of creatures from this effect.If you would be hit by a ranged weapon attack,you can use your reaction to strike the projectilewith lightning. A nonmagical projectile is destroyed,while a magical projectile is deflected harmlessly outof the air.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V",
    "duration": "Instantaneous",
    "level": 8,
    "name": "Smiting Bolt",
    "range": "150 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou summon a 5-foot-radius bolt of lightning thatstreaks down from the heavens and strikes theground at a point you choose within range. Eachcreature in the path of the bolt must make aDexterity saving throw, taking 12d12 lightningdamage on a failed save or half as much damage ona successful one.",
    "time": "1 action"
  },
  {
    "classes": "None",
    "components": "V",
    "duration": "Instantaneous",
    "level": 0,
    "name": "Static",
    "range": "5 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tWith a word of rebuke, you send an electric shockback at the creature that hit you. The attackingcreature must succeed on a Constitution savingthrow or take 1d4 lightning damage.This spells damage increases by 1d4 when youreach 5th level (2d4), 11th level (3d4), and 17th level(4d4).",
    "time": "1 reaction, which you take when a creature within range hits you with a melee attack"
  },
  {
    "classes": "None",
    "components": "V, S, M (a scrap of woolen fabric)",
    "duration": "Concentration, up to 10 minutes",
    "level": 5,
    "name": "Stormcloud",
    "range": "100 feet",
    "ritual": 0,
    "school": "Evocation",
    "sources": "The Elemental Spellbook",
    "text": "\tYou conjure a massive, swirling storm cloudoverhead. The cloud takes the shape of a horizontalcircle with a 100-foot radius, centered on a point youchoose within range. The cloud is 5 feet thick andopaque.Whenever an airborne creature comes within 50feet of any part of the cloud for the first time on aturn or starts its turn there, a bolt of lightningstrikes out from the cloud at the creature. Such acreature must make a Dexterity saving throw, taking5d10 lightning damage on a failed save or half asmuch damage on a successful one. If a creaturebecomes airborne while within this area, it too mustsave against this spells damage.\r\n\tAt Higher Levels: When you cast this spell using aspell slot of 6th level or higher, the damage increasesby 1d10 for each slot level above 5th.",
    "time": "1 action"
  }
]
