[{"item_attunment":null,"item_description":"This cutting knife, designed for food preparation, was made such that the blade always remains sharp no matter how many times it is used. When used in food preparation, the wielder of this knife may imbue the ingredients with minor magical effects for an hour as if they were casting the _prestidigitation_ cantrip. The wielder may clean, moisten, dry, chill, warm, color, flavor or scent up to one cubic foot of edible material every hour. The wielder of the knife may also use it as a melee attack weapon which deals 1d4 damage on a hit.","item_id":1,"item_name":"Knife of Food Preparation","item_pic":"https://cdn.discordapp.com/attachments/589178600415166525/617041065999859732/unknown.png","item_rarity":"Common","item_source":"WolframHydroxide","item_type":"Wondrous item"},{"item_attunment":null,"item_description":"Any food item placed in this bowl looks more appealing to those who behold it, though it cannot hide texture and taste. The beholder may see through the illusion if they use an action to make an Intelligence (Investigation) check against DC 13. On a success, the illusion fades and the true nature of the food is revealed.","item_id":3,"item_name":"Bowl of Appetizing Presentation","item_pic":"https://cdn.discordapp.com/attachments/589178600415166525/617041065999859732/unknown.png","item_rarity":"Common","item_source":"WolframHydroxide","item_type":"Wondrous item"},{"item_attunment":null,"item_description":"A Librarian Tome appears to be a small, green, clothbound book with an elven symbol on its cover, and is oddly light in its weight. In ancient times, these tomes were used for gaining remote access to a great repository of written knowledge, and were used as a field reference text. The pages of this tome are blank, but if it comes in contact with another book, spellbook, map, chart or other written text containing knowledge or information, the outside material will become blank after 1d4 hours of direct contact, and the pages of the Librarian Tome will be filled with new information commensurate to that absorbed. The source of this information is unknown, but appears to be drawn from the collected works of many authors, races, religions, fields of study, and time periods. Despite its small size, the Librarian Tome can hold an immensely large number of different texts. To find information that has already been deposited in the tome, the reader simply opens it and it will open to the proper page.\n\nThe book also keeps the information it provides accurate to the best extent available, resisting magical alteration such as _illusory script_ or erasure, magical or non-magical. Pages ripped from the book shrivel and crumble to dust within seconds, regrowing in the book within 1d4 days. If a contributor to the book dies (be it the bearer or someone who contributed a piece of knowledge for the book to consume), all information which they earned is erased from the book, lost forever until rediscovered. ","item_id":4,"item_name":"Librarian Tome","item_pic":"https://cdn.discordapp.com/attachments/589178600415166525/617041065999859732/unknown.png","item_rarity":"Very Rare","item_source":"WolframHydroxide","item_type":"Wondrous item"},{"item_attunment":0,"item_description":"(Requires attunement by a Bard)\n\nThis staff is made of carved and inscribed brass and mahogany. Along its length are runic inscriptions of various quotes from famous speeches and epic poems. The staff has seven charges. As an action, the wielder may cast one of the following spells, expending charges as dictated: _dissonant whispers_ (1 charge), _suggestion_ (2 charges), or _calm emotions_ (3 charges). The staff regains 1d4 charges every day at dawn. If the staff's last charge is expended, roll a d20. On a 1, the staff withers and shrieks with a banshee-like wail, dealing 2d12 psychic damage to all who can hear it.","item_id":5,"item_name":"Staff of the Orator","item_pic":"https://cdn.discordapp.com/attachments/589178600415166525/617041065999859732/unknown.png","item_rarity":"Uncommon","item_source":"WolframHydroxide","item_type":"Wondrous item (staff)"},{"item_attunment":null,"item_description":"As an action, the wearer may cast _sanctuary_, as the spell, with save DC 15. Only the wearer is a valid target of the spell. Once cast, the wearer must wait one hour before casting the spell from the item again.","item_id":7,"item_name":"Amulet of Reprieve","item_pic":"https://cdn.discordapp.com/attachments/589178600415166525/617041065999859732/unknown.png","item_rarity":"Common","item_source":"WolframHydroxide","item_type":"Wondrous item (amulet)"},{"item_attunment":null,"item_description":"Whenever the bearer uses this ring, which appears to be a fine signet ring made of platinum, to impress a seal into wax or some other medium (though wax is by far most common), she can use her action to cause the seal to become either a _glyph of warding_ with the Explosive Runes effect or an _arcane lock_ on the object it seals. Both effects have the same strength as if they were cast using a 4th level spell slot. Moving the object on which the seal has been placed does not trigger or dispel the seal.\n","item_id":8,"item_name":"Ring of Sealing","item_pic":"https://cdn.discordapp.com/attachments/589178600415166525/617041065999859732/unknown.png","item_rarity":"Rare","item_source":"WolframHydroxide","item_type":"Ring"},{"item_attunment":null,"item_description":"These stone blocks were used by ancient elven architects to allow the creation of impossibly large structures. Each _Keystone of the Steadfast Fortress_ is a small, vaguely wedge-like stone block with a single handhold. When used as the final block in a stone construction, the _Keystone of the Steadfast Fortress_ will hold the entire structure together no matter the force against it. The structure becomes immutable and indestructible from nearly all angles. However, as it functions as a normal keystone, its removal will imediately cause the entire structure to collapse, even if it was otherwise sound. To remove it, a creature must grasp the keystone and lift it from its position. If the creature cannot lift at least 200 pounds, the attempt automatically fails. Otherwise, the creature must make a DC 20 Strength check. On a failed check, the creature must make a DC 20 Constitution saving throw or gain one level of exhaustion. On a success, the keystone is removed and the entire structure collapses 2 rounds later.","item_id":9,"item_name":"Keystone of the Steadfast Fortress","item_pic":"https://cdn.discordapp.com/attachments/589178600415166525/617041065999859732/unknown.png","item_rarity":"Very Rare","item_source":"WolframHydroxide","item_type":"Wondrous item"},{"item_attunment":null,"item_description":"(Requires Attunement)\n\nThis seemingly normal, if ornate, quill is capable of writing on its own without instruction or ink. As it draws on the user's own mind to know what to write, spells above 1st level requiring concentration cannot be cast while the quill is scribing, nor can two quills be used at the same time by one person. The quill is capable of scribing spell scrolls and transcribing spells into a spellbook, but any material components must be set nearby before beginning. The quill can be activated for no more than 8 hours each day.","item_id":10,"item_name":"Quill of the Scrivenor","item_pic":"https://cdn.discordapp.com/attachments/589178600415166525/617041065999859732/unknown.png","item_rarity":"Common","item_source":"WolframHydroxide","item_type":"Wondrous item"},{"item_attunment":null,"item_description":"This intricately carved and inlaid jacinth grants the boon of sapience to items of great sentimental value. Only an item which is among the most prized possessions of a person (living or dead) is a valid target for the purposes of this item.\n\nIf the command word \"Ista\" is spoken while holding the gem to an item of great sentimental value made of inorganic material, the gem gathers the emotional energy implanted in the object and distills it into a soul replica which is the perfect reflection of the emotions which have seeped into the object. The item is aware of what the owner was feeling in each instance in which the emotions were emplaced, and these emotions function as memories for the new entity. The object gains the statistics of an intelligent item, and its alignment and personality traits are determined by the DM. The alignment should reflect the feelings poured into it. If it was viewed as a means toward world conquest, it too will aim to achieve that goal and will have a lawful evil alignment. If a rogue collected it out of greed and pored over it for years, enchanted by its splendor, it will have a chaotic neutral alignment, and will likely have a narcissistic personality.\n\nUpon activating the gem, it adheres to the target, embedding itself in the object's material. Unless the command word is spoken again while touching the gem, it cannot be removed from the object except by destroying the gem or by means of a _wish_. If the gem is removed, the soul replica simply dissolves back into the emotions from which it came, and any memories it carried from the time of emplacement to removal are irrevocably lost. ","item_id":11,"item_name":"Gem of Sapience","item_pic":"https://cdn.discordapp.com/attachments/589178600415166525/617041065999859732/unknown.png","item_rarity":"Legendary","item_source":"WolframHydroxide","item_type":"Wondrous item"},{"item_attunment":null,"item_description":"(Requires Attunement)\n\nThis set of bloodstone chessmen is never complete. It only contains enough pieces for a single player's army, at most. When a lock of someone's hair, willingly given, is wrapped thrice around a chess piece, it creates a bond with that person. A piece cannot have more than one lock wrapped around it, or it ceases to function. A single set of chessmen contains 1d10+5 chessmen, but never contains a king. Each chessman shares the following properties: \n\n1) When the person to whom a chessman is bonded is facing mortal peril, the chessman secretes a red, blood-like mineral substance. If the bound person dies, the hair crumbles to ash, and the bond is broken.\n\n2) When a chessman is placed on a map, and the person to whom the chessman is bound is within the region the map depicts, the chessman will gravitate toward the subject's location, depicting and following their movements.","item_id":12,"item_name":"Tactician's Chessmen","item_pic":"https://cdn.discordapp.com/attachments/589178600415166525/617041065999859732/unknown.png","item_rarity":"Rare","item_source":"WolframHydroxide","item_type":"Wondrous item"},{"item_attunment":null,"item_description":"These multi-lensed goggles have been specially designed to allow the user to more easily view the various layers of their surroundings without the hassle of external magic casting. The goggles can have up to five sets of lenses. Although they are built to house five different types of lens, a pair that is found or bought starts with only 1d3 sets of lenses. Roll on the  following table to determine which lenses are present in the device. Any missing lenses can be crafted by following the instructions in each table entry. Switching between lenses requires 1 minute of uninterrupted action.\n\n##### Lenses\n| 1d5 | Lens Properties \n| 1 | **Magic:** While these deep purple lenses are active, the wearer benefits from the effects of the _detect magic_ spell. These lenses require a magically active crystal to carve into the lenses, which are then enchanted.\n| 2 | **Ether:** While active, the wearer can see out to 20 feet into the border ethereal. The lenses themselves must be crafted from the freshly-expressed silk of a phase spider. Use of hardened silk will cause the lens to cloud and be unusable. The lenses are invisible to the unaided eye, and require the skill of an arcanist to work and shape. |\n| 3 | **Illusion:** While using these lenses, the wearer can see invisible creatures and objects out to 20 feet, and the DCs of Intelligence(Investigation) checks to discern illusions are reduced by 5. To craft these lenses, a large, euhedral quartz crystal must be cut, polished, enchanted and covered in a film of pure alchemical silver. |\n| 4 | **Darkness:** These lenses give the wearer darkvision out to 60 feet, or increase darkvision by 60 feet. The lenses must be carved from a large, clear chunk of natural fulgrite. |\n| 5 | **Identification:** These lenses label each item in sight with unobtrusive labels, and focusing on any item gives a more detailed description. The lenses can accurately identify any item which could be identified with a DC 15 Intelligence check. Also, after inspecting an item for five minutes, the wearer can cast _identify_ from the lenses without using a spell slot. The lenses cannot be used to cast _identify_ again until 1d4 hours have passed. The crafting of these lenses requires performing arcane rituals linking the lenses to a phylactery containing a miniature tome of lore costing at least 500 gp |","item_id":13,"item_name":"Artificer's Goggles","item_pic":"https://cdn.discordapp.com/attachments/589178600415166525/617041065999859732/unknown.png","item_rarity":"Rare","item_source":"WolframHydroxide","item_type":"Wondrous item"},{"item_attunment":null,"item_description":"This ink appears to be nothing more than an exquisitely fine black ink. Anything written with the ink is under the effect of _illusory script_ until it is dispelled. The user can make all of the normal arrangements as if they were casting _illusory script_. The vial of ink contains enough ink for 15 pages, after which it runs out.\n","item_id":14,"item_name":"Ink of Discretion","item_pic":"https://cdn.discordapp.com/attachments/589178600415166525/617041065999859732/unknown.png","item_rarity":"Common","item_source":"WolframHydroxide","item_type":"Wondrous item"}]