[{"item_description":"Crafted from a thick, red fabric, this banner measures 5 feet high and 3 feet wide. The krig (war) rune is displayed on the fabric with round, metal plates sewn into it. It can be attached to a 10-foot pole to serve as a standard. Furling or unfurling the banner requires an action. The banner has the following properties.\n\nMark of Courage. As a bonus action, you can touch the unfurled banner and cause it to emanate courage. You and your allies are immune to the frightened condition while within 20 feet of it. This benefit lasts for 10 minutes or until the banner is furled. Once you use this property, you can't use it again until you finish a short or long rest.\n\nSentinel Standard. You can see invisible creatures while they are within 20 feet of the unfurled banner and within your line of sight.\n\nStandard's Shield. As a bonus action, you can touch the unfurled banner and invoke this power. Any ranged attack roll that targets you or an ally of yours has disadvantage if the target is within 20 feet of the unfurled banner. This benefit lasts for 1 minute or until the banner is furled. Once you use this property, you can't use it again until you finish a short or long rest. \n\nGift of Battle. You can transfer the banner's magic to a place by tracing the krig rune on the ground with your finger. The point where you trace it becomes the center of a spherical area of magic that has a 500-foot radius and that is fixed to the place. The transfer takes 8 hours of work that requires the banner to be within 5 feet of you and during which you choose creatures, creature types, or both that will benefit from the magic. At the end, the banner is destroyed, and the area gains the following property:\n\nWhile in the 500-foot-radius sphere, the creatures you chose during the transfer process are immune to the frightened condition and gain a +1 bonus to attack rolls and AC.","item_id":1,"item_name":"Banner of the Krig Rune","item_pic":"","item_rarity":"Rare (Requires Attunement","item_source":"Storm King's Thunder","item_type":"Wonderous Item"},{"item_description":"This dragon's claw has been covered with a coat of molten silver, upon which has been inscribed the Wyrm (dragon) rune. The claw has the following properties.\n\nWyrmslayer. As an action, you can point the claw at a dragon within 30 feet of you. The dragon must then succeed on a DC 15 Constitution saving throw or gain vulnerability to all damage types until the end of your next turn. This property can be used three times. The claw regains all expended uses at the next dawn.\n\nWyrm Shield. While the claw is displayed on your person, you have resistance to the damage caused by any dragon's breath weapon.\n\nWyrm Ward. You can transfer the claw's magic to a place by tracing the wyrm rune on the ground with your finger. The point where you trace it becomes the center of a spherical area of magic that has a 100-foot radius and that is fixed to the place. The transfer takes 8 hours of work that requires the claw to be within 5 feet of you. At the end, the claw is destroyed, and the area gains the following property:\n\nWhile in the 100-foot-radius sphere, any dragon has disadvantage on saving throws and can have a flying speed no higher than 10 feet.","item_id":3,"item_name":"Claw of the Wyrm Rune","item_pic":"","item_rarity":"Rare (Requires Attunement)","item_source":"Storm King's Thunder","item_type":"Wondrous Item"},{"item_description":"his wooden gavel is small by giant reckoning but nearly the size of a warhammer in human hands. The venn (friend) rune is inscribed in mithral in the base of the haft. Among giants, this item is used as part of rituals to resolve disputes. The gavel has the following properties.\nArbiter’s Shield. At the start of every combat, attack rolls against you have disadvantage before the start of your first turn, provided that the gavel is on your person.\n\nBond of Amity. As an action, you can use the gavel to strike a point on a hard surface. The first time in the next minute that a creature within 60 feet of that point deals damage to another creature with an attack that hits, the attacker takes psychic damage equal to half the damage it dealt to the target. Once you use this property, you can’t use it again until you finish a long rest.\n\nGift of Truth. You can transfer the gavel’s magic to a place by tracing the venn rune on the ground with your finger. The point where you trace it becomes the center of a spherical area of magic that has a 30-foot radius and that is fixed to the place. The transfer takes 8 hours of work that requires the gavel to be within 5 feet of you. At the end, the gavel is destroyed, and the area gains the following property:\nWhenever a creature utters a lie while within the 30-foot-radius sphere, that creature takes 5 psychic damage and flinches visibly.","item_id":4,"item_name":"Gavel of the Venn Rune","item_pic":"","item_rarity":"Rare (Requires Attunement)","item_source":"Storm King's Thunder","item_type":"Wondrous Item"},{"item_description":"This appears to be a simple ingot of iron ore, about a foot long and a few inches across. Inspection of its surface reveals the faint, silvery outline of the Skold (shield) rune. The ingot has the following properties, which work only while it's on your person.\n\nRunic Shield. You have a + 1 bonus to AC.\n\nShield Bond. As a bonus action, choose a creature that you can see within 30 feet of you, other than yourself. Until the end of your next turn, any damage the target takes is reduced to l, but you take half the damage prevented in this way. The damage you take can't be reduced in any way. Once you use this property, you can't use it again until you finish a short or long rest.\n\nShield Ward. You can transfer the ingot's magic to a nonmagical item-a shield or a two-handed melee weapon-by tracing the Skold rune there with your finger. The transfer takes 8 hours of work that requires the two items to be within 5 feet of each other. At the end, the ingot is destroyed, and the rune appears in silver on the chosen item, which gains a benefit based on its form:\n\nShield. The shield is now a rare magic item that requires attunement. Its magic gives you a + 1 bonus to AC, and the first time after each of your long rests that damage reduces you to O hit points, you are instead reduced to 1 hit point. You must be wielding the shield to gain these benefits.\n\nWeapon. The weapon is now an uncommon magic weapon. It grants you a +l bonus to AC while you're holding it.","item_id":5,"item_name":"Ingot of the Skold Rune","item_pic":"","item_rarity":"Very Rare (Requires Attunement)","item_source":"Storm King's Thunder","item_type":"Wondrous Item"},{"item_description":"A navigation orb is a hollow, 7-foot-diameter sphere of thin, polished mithral with a large skye (cloud) rune embossed on its outer surface. The orb levitates 10 feet above the ground and is keyed to a particular cloud castle, allowing you to control that castle's altitude and movement while the orb is inside the castle. If the orb is destroyed or removed from its castle, the castle's altitude and location remain fixed until the orb is returned or replaced.\n\nAs an action, you can cause one of the following effects to occur if you are touching the orb:\n\nThe castle moves at a speed of 1 mph in a straight line, in a direction of your choice, until the castle stops or is made to stop, or until another action is used to change its direction. If this movement brings the castle into contact with the ground, the castle lands gently.\n\nThe castle, if it is moving, comes to a gradual stop.\n\nThe castle makes a slow, 90-degree turn clockwise or counterclockwise (turning a northerly view into a westerly view, for example). The castle can turn while it is moving in a straight line.\n\n\nAny creature touching the orb knows the altitude of the base of the castle above the ground or water below it.","item_id":6,"item_name":"Navigation Orb","item_pic":"","item_rarity":"Very Rare (Requires Attunement)","item_source":"Storm King's Thunder","item_type":"Wondrous Item"},{"item_description":"This spherical chunk of granite is about the size of a human fist. The stein rune—the rune of stone— appears on the orb as crystalline veins that play across its surface. When first grasped, the stone feels impossibly heavy, as if even a titan could not lift it. That feeling passes after a moment, allowing you to carry the stone with ease.\n\nIndomitable Stand (Simple Property). As an action, you scribe the stein rune onto the ground at your feet. Until you move, you have advantage on all ability checks and saving throws to resist effects that would force you to move. In addition, any creature that moves within 10 feet of you must succeed on a DC 12 Strength saving throw or have its movement immediately end.\n\nStone Soul (Simple Property). While you are attuned to this rune, you cannot be petrified.\n\nStone’s Secrets (Simple Property). As an action, you scribe this rune onto a stone wall or floor. You learn the location and size of all creatures standing on or touching that surface within 30 feet of you, though only for the moment when the property is used.\n\nCrushing Brand (Complex Property). Over the course of a short rest, you inscribe this rune using dirt or crushed stone onto one weapon that deals bludgeoning damage. The weapon gains a ghostly brown aura, and bludgeoning damage dealt by the weapon ignores resistance and immunity. If you roll the maximum on the weapon’s damage die or dice, the target of your attack is knocked prone if it is a creature. In addition, you can expend a spell slot to grant the weapon a bonus to attack rolls and damage rolls equal to the spell slot’s level divided by three. These effects last for 24 hours or until you use this property again.\n\nEarthen Step (Complex Property). While you are attuned to this rune, you can cast meld into stone as a bonus action. You regain this ability after a short or long rest.\n\nOverwhelming Bolt (Complex Property). As an action, you scribe this rune using dirt or crushed rock onto a creature within your reach as you expend a spell slot. The creature must succeed on a Strength saving throw (DC 12 + the level of the expended spell slot). On a failure, the creature takes 2d8 bludgeoning damage plus 1d8 bludgeoning damage per level of the expended spell slot and is knocked prone. On a successful saving throw, the creature takes half as much damage and is not knocked prone.\n\nGift of Stone. (Transfer Property). You can transfer the orb's magic to a nonmagical item-a shield or a pair of boots-by tracing the stein rune there with your finger. The transfer takes 8 hours of work that requires the two items to be within 5 feet of each other. At the end, the orb is destroyed, and the rune appears in silver on the chosen item, which gains a benefit based on its form:\n\nShield. The shield is now a rare magic item that requires attunement. While you wield it, you have resistance to all damage dealt by ranged weapon attacks. \n\nBoots. The pair of boots is now an uncommon magic item that requires attunement. While you wear the boots, you have advantage on Strength saving throws, and you can use your reaction to avoid being knocked prone.","item_id":7,"item_name":"Orb of the Stien Rune","item_pic":"","item_rarity":"Rare (Requires Attunement)","item_source":"Storm King's Thunder","item_type":"Master Rune"},{"item_description":"When you drink this potion, you become Huge for 24 hours if you are Medium or smaller, otherwise the potion does nothing. For that duration, your Strength becomes 25, if it isn't already higher, and your hit point maximum is doubled (your current hit points are doubled when you drink the potion). In addition, the reach of your melee attacks increases by 5 feet.\n\nEverything you are carrying and wearing also increases in size for the duration. When rolling damage for weapons enlarged in this manner, roll three times the normal number of dice; for example, an enlarged longsword would deal 3d8 slashing damage (instead of ld8), or 3d10 slashing damage (instead of ldlO) when used with two hands.\n\nWhen the effect ends, any hit points you have above your hit point maximum become temporary hit points. This potion is a pale white liquid made from the tongue of a giant clam, with a pungent aroma akin to that of rotting algae. It tastes sweet, however, when consumed.","item_id":8,"item_name":"Potion of Giant Size","item_pic":"","item_rarity":"Legendary","item_source":"Storm King's Thunder","item_type":"Potion"},{"item_description":"This adamantine alloy rod measures 4 feet long, weighs 100 pounds, and is sized to fit comfortably in a fire giant’s hand. The rod has two prongs at one end and a molded handle grip on the opposite end. Many copies of the malmr (metal) rune spiral around the length of the rod, forming a repeating pattern.\n\nThe rod has 10 charges and regains 1d6+4 of its expended charges daily at dawn. As an action, you can grasp it by the handle and expend 1 charge to cast locate object from it. When the rod is used to detect objects made of adamantine, such as fragments of the Vonindod construct, locate object’s range increases to 10 miles.","item_id":9,"item_name":"Rod of the Vonindod","item_pic":"","item_rarity":"Uncommon (Requires Attunement)","item_source":"Storm King's Thunder","item_type":"Wondrous Item"},{"item_description":"Built by dwarven gods and entrusted to the rulers of Shanatar, an ancient dwarven empire. The Wyrmskull Throne was a symbol of dwarven power and pride for ages untold. The throne hovers a foot off the ground and is a massive thing made of polished obsidian with oversized feet—the impaled skulls of four ancient blue dragons. Runes glisten in the carved obsidian winking to life with blue energy when the throne's powers are activated.\n\nAfter the fall of Shanatar, the Wyrmskull Throne fell into the clutches of less honorable creatures. A band of adventurers wrested the throne from the aquatic elf tyrant Gantar Kraok and sold it to the storm giant Neri for a considerable fortune. Neri had the throne magically enlarged and gave it to her husband, King Hekaton, as a gift, along with one of the Ruling Scepters of Shanatar, which she had found in a wreck at the bottom of the Trackless Sea. Only a creature attuned to a Ruling Scepter and in possession of it can harness the powers of the Wyrmskull Throne, which has become the centerpiece of King Ilekaton's throne room in the undersea citadel of Maelstrom. Fear of the throne's power has helped prevent evil giants from challenging or threatening Hekaton's leadership.\n\nAny creature not attuned to a Ruling Scepter who sits on the throne is paralyzed and encased in a magical force field. While encased, the creature can't be touched or moved from the throne. Touching a Ruling Scepter to the force field dispels the field, though the creature remains paralyzed until it is separated from the throne.\n\nAny creature seated on the throne can hear faint Whispers in Draconic- the whisperings of four blue dragons whose skulls adorn the throne. Although powerless, these spirits try to influence the decisions of the throne's master\n\nProperties of the Throne. The throne has 9 charges and regains all expended charges daily at dawn. A creature that sits on the throne while attuned to a Ruling Sceptor in its possession can harness the throne's properties, which are as follows:\n\nThe throne gains a flying speed of 30 feet and can hover and flies where the creature wills. This property doesn't expend any charges.\n\nBoth the throne and the creature sitting on it can move through earth and stone without disturbing the material they move through. This property doesn't expend any charges.\n\nAs an action, the creature can expend 1 charge to cast lightning bolt (spell save DC 19) from the throne. The spell is cast as though using a 9th-level spell slot and deals 49 (14d6) lightning damage. The bolt discharges from the mouth of one of the throne's blue dragon skulls.\n\nAs an action, the creature can expend 2 charges to cast the globe of invulnerability spell from the throne. The globe encloses both the creature and the throne.\n\nAs an action, the creature can expend 3 charges to create a spectral image of an ancient blue dragon that surrounds both it and the throne. The spectral dragon lasts for 1 minute. At the end of each of the creature's turns, the spectral dragon makes one bite attack and two claw attacks against targets of the creature's choice. These attacks have the same attack bonus, reach, and damage as an ancient blue dragon's bite and claw attacks.\n\nDestroying the Throne. The Wyrmskull Throne can be destroyed by breaking at least five Ruling Scepters of Shanatar simultaneously on it. This fact has never been recorded or sung of among the dwarves or any bards or storytellers, and it can't be discovered with an ability check. Characters who want to destroy the throne must go on a quest to learn the method for doing so. The throne's destruction triggers an explosion, as shards of obsidian fly out in all directions. Each creature and object within a 30-foot-radius sphere centered on the throne must succeed on a DC 21 Dexterity saving throw, taking 70 (20d6) slashing damage on a failed save, or half as much damage on a successful one.","item_id":10,"item_name":"Wyrmskull Throne","item_pic":"","item_rarity":"Artifact","item_source":"Storm King's Thunder","item_type":"Wondrous Item"},{"item_description":"This diamond contains the blood of a creature-blood that appears in the form of the blod (blood) rune. While the item is on your person, you can use your action to divine the location of the creature nearest to you that is related to the blood in the item and that isn't undead. You sense the distance and direction of the creature relative to your location. The creature is either the one whose blood is in the item or a blood relative.\n\nThis item is made from a large diamond worth at least 5,000 gp. When the blood of a creature is poured onto it during the creation process, the blood seeps into the heart of the gem. If the gem is destroyed, the blood evaporates and is gone forever. A vengeful being might use a blod stone to hunt down an entire bloodline. Such stones are sometimes given as gifts to siblings or handed down from parent to child.","item_id":11,"item_name":"Blod Stone","item_pic":"","item_rarity":"Rare (Requires Attunement)","item_source":"Storm King's Thunder","item_type":"Wondrous Item"},{"item_description":"The conch is slightly larger than a human head, with large spikes that add nearly another foot to its length. It weighs 20 pounds, and has the uveðr (storm) rune inscribed on its inside surface.\n\nAs an action, you can blow into the conch to teleport you and up to eight willing creatures to a fixed destination. This particular conch’s destination is in Maelstrom, the storm giant stronghold on the seafloor.","item_id":12,"item_name":"Conch of Teleportation","item_pic":"","item_rarity":"Very Rare (requires attunement)","item_source":"Storm King's Thunder","item_type":"Wondrous Item"},{"item_description":"In the Year of the Icy Axe (123 DR), the frost giant lord Gurt fell to Uthgar Gardolfsson-leader of the folk who would become the Uthgardt barbarians-in a battle that marked the ascendance of humankind over the giants in the Dessarin Valley. Gurt's greataxe was buried in Morgur's Mound until it was unearthed and brought back to Waterdeep. After laying in the city's vaults for decades, the axe was given to Harshnag, a frost giant adventurer, in recognition of his service to Waterdeep. Uthgardt barbarians recognize the weapon on sight and attack any giant that wields it.\n\nYou gain a +l bonus to attack and damage rolls made with this magic weapon. It is sized for a giant, weighs 325 pounds, and deals 3d12 slashing damage on a hit, plus an extra 2dl2 slashing damage if the target is human.\n\nThe axe sheds light as a torch when the temperature around it drops below O degrees Fahrenheit. The light can't be shut off in these conditions.\n\nAs an action, you can cast a version of the heat metal spell (save DC 13) that deals cold damage instead of fire damage. Once this power is used, it can't be used again until the next dawn.","item_id":13,"item_name":"Gurt’s Greataxe","item_pic":"","item_rarity":"Legendary (Requires Attunement)","item_source":"Storm King's Thunder","item_type":"Weapon (Greataxe)"},{"item_description":"The Korolnor Scepter is one of ten Ruling Scepters of Shanatar, forged by the dwarven gods and given to the ruling houses of the ancient dwarven empire. The Korolnor Scepter's location was unknown for the longest time until a storm giant queen, Neri, found it in a barnacle-covered shipwreck at the bottom of the Trackless Sea. The Ruling Scepters are all roughly the same size and shape, but their materials and properties vary.\n\nThe Korolnor Scepter is a tapered mithral rod as thick and long as a dwarf's forearm, with a small platinum knob at the bottom and a rounded disk adorned with a ring of seven tiny blue gems at the top.\n\nYou gain a +3 bonus to attack and damage rolls made with this scepter, which can be wielded as a magic club.\n\nYou can use the properties of the Wyrmskull Throne, as well as the properties of the scepter itself. The scepter has 10 charges, and it regains ld6 + 4 expended charges at dawn. Its properties are as follows:\n\nIf you are underground or underwater, you can use an action to expend 1 charge to determine the distance to the surface.\n\nAs an action, you can expend 2 charges to cast the sending spell from the scepter.\n\nAs an action, you can expend 3 charges to cast the teleport spell from the scepter. If the destination is within 60 feet of the Wyrmskull Throne, there is no chance of a teleport error or mishap occurring.","item_id":14,"item_name":"Korolnor Scepter","item_pic":"","item_rarity":"Legendary (Requires Attunement)","item_source":"Storm King's Thunder","item_type":"Wondrous Item"},{"item_description":"This triangular fire opal measures about three inches on each side and is half an inch thick. The ild rune—the rune of fire—shimmers within its core. Grasping this object causes a split second of searing, fiery pain to pass through you. That pain quickly fades, giving way to a warming glow.\n\nIgnite (Simple Property). As an action, you scribe the ild rune using ash onto a flammable object. That object immediately bursts into flame. While it burns, the fire extends 1 foot out from the rune you scribed.\n\nFire Tamer (Simple Property). As an action, you touch an open flame and scribe the ild rune within it with a hand motion. This causes the flame to immediately extinguish. For a large blaze, the fire is extinguished in a 10-foot radius around you. You can extend this distance by expending a spell slot when using the ild rune in this manner. The radius extends by 20 feet per level of the expended spell slot.\n\nFire’s Friend (Simple Property). While you are attuned to this rune, you have resistance to cold damage.\n\nCombustion (Complex Property). As an action, you scribe this rune using ash onto a creature within your reach as you expend a spell slot. The creature automatically takes 1d10 fire damage plus 1d10 fire damage per level of the expended spell slot.\n\nFlame Brand (Complex Property). Over the course of a short rest, you inscribe this rune using ash onto a melee or ranged weapon, or onto up to 20 pieces of ammunition. The weapon or ammunition gains a ghostly aura of yellow flame and deals fire damage instead of piercing, slashing, or bludgeoning damage. In addition, you can expend a spell slot while using this property to grant the weapon or ammunition a bonus to attack rolls and damage rolls equal to the spell slot’s level divided by three. These effects last for 24 hours or until you use this property again.\n\nFlame Stoker (Complex Property). While you are attuned to this rune, your fire attacks are deadlier. Whenever you roll fire damage from an attack or a spell you cast, you can reroll that damage and use the higher result.\n\nGift of Flame. (Transfer Property). You can transfer the opal's magic to a nonmagical item-a weapon or a suit of armor-by tracing the ild rune there with your finger. The transfer takes 8 hours of work that requires the two items to be within 5 feet of each other. At the end, the opal is destroyed, and the rune appears in red on the chosen item, which gains a benefit based on its form:\n\nWeapon. The weapon is now an uncommon magic weapon. It deals an extra ld6 fire damage to any target it hits.\n\nArmor. The armor is now a rare magic item that requires attunement. You have resistance to cold damage while wearing the armor.","item_id":15,"item_name":"Opal of the Ild Rune","item_pic":"","item_rarity":"Rare (Requires Attunement)","item_source":"Storm King's Thunder","item_type":"Master Rune"},{"item_description":"This blue pennant is crafted from silk and is five feet long and whips about as if buffeted by a wind. The vind (wind) rune appears on its surface, looking almost like a cloud. The pennant has the following properties, which work only while it's on your person.\n\nWind Step. As an action, you fly up to 20 feet. If you don't land at the end of this flight, you fall unless you have another means of staying aloft.\n\nComforting Wind. You can't suffocate.\n\nWind's Grasp. As a reaction when you fall, you can cause yourself to take no damage from the fall. Once you use this property, you can't use it again until you finish a short or long rest.\n\nWind Walker. While you are attuned to this rune, you can cast levitate as a bonus action. Once you use this property, you can't use it again until you finish a short or long rest.\n\nGift of Wind. You can transfer the pennant's magic to a nonmagical item-a suit of armor, a pair of boots, or a cloak-by tracing the vind rune there with your finger. The transfer takes 8 hours of work that requires the two items to be within 5 feet of each other. At the end, the pennant is destroyed, and the rune appears in silver on the chosen item, which gains a benefit based on its form:\n\nArmor. The armor is now an uncommon magic item that requires attunement. You gain a bonus to speed of 5 feet while you wear the armor, and if it normally imposes disadvantage on Stealth checks, it no longer does so.\n\nBoots/Cloak. The pair of boots or cloak is now a rare magic item that requires attunement. While wearing the item, you can convert up to 20 feet of your movement on each of your turns into flight. If you don't land at the end of this flight, you fall unless you have another means of staying aloft . You can also cast feather fall once from the item, and you regain the ability to do so when you finish a short or long rest.","item_id":16,"item_name":"Pennant of the Vind Rune","item_pic":"","item_rarity":"Very Rare (Requires Attunement)","item_source":"Storm King's Thunder","item_type":"Wondrous item"},{"item_description":"A robe of serpents is a stylish silk garment that is popular among wealthy nobles and retired assassins. The robe is emblazoned with ld4 + 3 stylized serpents, all brightly colored.\n\nAs a bonus action on your turn, you can transform one of the robe's serpents into a giant poisonous snake. The snake instantly falls from the robe, slithers into an unoccupied space next to you, and acts on your initiative count. The snake can tell friendly creatures from hostile ones and attacks the latter. The snake disappears in a harmless puff of smoke after 1 hour, when it drops to 0 hit points, or when you dismiss it (no action required). Once detached, a snake can't return to the robe. When all of the robe's snakes have detached, the robe becomes a nonmagical garment.","item_id":17,"item_name":"Robe of Serpents","item_pic":"","item_rarity":"Uncommon (Requires Attunement)","item_source":"Storm King's Thunder","item_type":"Wondrous Item"},{"item_description":"This shard of ice is long and slender, the size of a dagger. A rune glows within.\n\nFrigid Touch – As an action, touch a body of water and freeze it in a 10-ft-radius sphere. Must finish short/long rest to use again.\n\nFrost Friend – resistance to fire damage\n\nIcy Mantle – As an action, touch yourself or another with water on your finger. It creates an icy mantle of protection that reduces the next bludgeoning/piercing/slashing damage taken to 0 (within 1 min). Must finish short/ long rest to use again.\n\nWinter’s Howl – As an action, cast sleet storm (DC17). Regain after short/long rest.","item_id":18,"item_name":"Shard of the Ise Rune","item_pic":"","item_rarity":"Very Rare (Requires Attunement)","item_source":"Storm King's Thunder","item_type":"Wondrous item"}]