[{
    "spell_name": "Abi-Dalzim's Horrid Wilting",
    "spell_classes": "Sorcerer, Wizard, ",
    "spell_sources": "X,150,E,15",
    "spell_level": 8,
    "spell_school": "Necromancy",
    "spell_time": "1 Action",
    "spell_range": "150 ft",
    "spell_components": "V,S,M",
    "spell_compMaterial": "A bit of sponge",
    "spell_duration": "Instantaneous",
    "spell_ritual": null,
    "spell_text": "You draw the moisture from every creature in a 30-foot cube centered on a point you choose within range. Each creature in that area must make a Constitution saving throw. Constructs and undead aren't affected, and plants and water elementals make this saving throw with disadvantage. A creature takes 12d8 necrotic damage on a failed save, or half as much damage on a successful one.\n   Nonmagical plants in the area that aren't creatures, such as trees and shrubs, wither and die instantly."
}, {
    "spell_name": "Absorb Elements",
    "spell_classes": "Druid, Ranger, Sorcerer, Wizard, ",
    "spell_sources": "X,150,E,15",
    "spell_level": 1,
    "spell_school": "Abjuration",
    "spell_range": "Self",
    "spell_components": "S",
    "spell_duration": "1 rnd",
    "spell_ritual": null,
    "spell_text": "The spell captures some of the incoming energy, lessening its effect on you and storing it for your next melee attack. You have resistance to the triggering damage type until the start of your next turn. Also, the first time you hit with a melee attack on your next turn, the target takes an extra 1d6 damage of the triggering type, and the spell ends.\n   41-20: When you cast this spell using a spell slot of 2nd level or higher, the extra damage increases by 1d6 for each slot level above 1st."
}, {
    "spell_name": "Aganazzar's Scorcher",
    "spell_classes": "Sorcerer, Wizard, ",
    "spell_sources": "X,150,E,15",
    "spell_level": 2,
    "spell_school": "Evocation",
    "spell_time": "1 Action",
    "spell_range": "30-ft line",
    "spell_components": "V,S,M",
    "spell_compMaterial": "A red dragon's scale",
    "spell_duration": "Instantaneous",
    "spell_ritual": null,
    "spell_text": "A line of roaring flame 30 feet long and 5 feet wide emanates from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 3d8 fire damage on a failed save, or half as much damage on a successful one.\n   41-20: When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd."
}, {
    "spell_name": "Beast Bond",
    "spell_classes": "Druid, Ranger, ",
    "spell_sources": "X,150,E,15",
    "spell_level": 1,
    "spell_school": "Divination",
    "spell_time": "1 Action",
    "spell_range": "Touch",
    "spell_components": "V,S,M",
    "spell_compMaterial": "A bit of fur wrapped in a cloth",
    "spell_duration": "Conc, 10 min",
    "spell_ritual": null,
    "spell_text": "You establish a telepathic link with one beast you touch that is friendly to you or charmed by you. The spell fails if the beast's Intelligence is 4 or higher. Until the spell ends, the link is active while you and the beast are within line of sight of each other. Through the link, the beast can understand your telepathic messages to it, and it can telepathically communicate simple emotions and concepts back to you. While the link is active, the beast gains advantage on attack rolls against any creature within 5 feet of you that you can see."
}, {
    "spell_name": "Bones of the Earth",
    "spell_classes": "Druid, ",
    "spell_sources": "X,150,E,15",
    "spell_level": 6,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "120 ft",
    "spell_components": "V,S",
    "spell_duration": "Instantaneous",
    "spell_ritual": null,
    "spell_text": "You cause up to six pillars of stone to burst from places on the ground that you can see within range. Each pillar is a cylinder that has a diameter of 5 feet and a height of up to 30 feet. The ground where a pillar appears must be wide enough for its diameter, and you can target the ground under a creature if that creature is Medium or smaller. Each pillar has AC 5 and 30 hit points. When reduced to 0 hit points, a pillar crumbles into rubble, which creates an area of difficult terrain with a 10-foot radius that lasts until the rubble is cleared. Each 5-foot-diameter portion of the area requires at least 1 minute to clear by hand.\n   If a pillar is created under a creature, that creature must succeed on a Dexterity saving throw or be lifted by the pillar. A creature can choose to fail the save.\n   If a pillar is prevented from reaching its full height because of a ceiling or other obstacle, a creature on the pillar takes 6d6 bludgeoning damage and is restrained, pinched between the pillar and the obstacle. The restrained creature can use an action to make a Strength or Dexterity check (the creature's choice) against the spell's save DC. On a success, the creature is no longer restrained and must either move off the pillar or fall off it.\n   41-20: When you cast this spell using a spell slot of 7th level or higher, you can create."
}, {
    "spell_name": "Catapult",
    "spell_classes": "Sorcerer, Wizard, ",
    "spell_sources": "X,150,E,15",
    "spell_level": 1,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "60 ft",
    "spell_components": "S",
    "spell_duration": "Instantaneous",
    "spell_ritual": null,
    "spell_text": "Choose one object weighing 1 to 5 pounds within range that isn't being worn or carried. The object flies in a straight line up to 90 feet in a direction you choose before falling to the ground, stopping early if it impacts against a solid surface. If the object would strike a creature, that creature must make a Dexterity saving throw. On a failed save, the object strikes the target and stops moving. When the object strikes something, the object and what it strikes each take 3d8 bludgeoning damage.\n   41-20: When you cast this spell using a spell slot of 2nd level or higher, the maximum weight of objects that you can target with this spell increases by 5 pounds, and the damage."
}, {
    "spell_name": "Control Flames",
    "spell_classes": "Druid, Sorcerer, Wizard, ",
    "spell_sources": "X,152,E,16",
    "spell_level": 0,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "60 ft",
    "spell_components": "S",
    "spell_duration": "Instant. or 1 h",
    "spell_ritual": null,
    "spell_text": "You choose nonmagical flame that you can see within range and that fits within a 5-foot cube. You affect it in one of the following ways.\n • You instantaneously expand the flame 5 feet in one direction, provided that wood or other fuel is present in the new location.\n • You instantaneously extinguish the flames within the cube.\n • You double or halve the area of bright light and dim light cast by the flame, change its color, or both. The change lasts for 1 hour.\n • You cause simple shapes-such as the vague form of a creature, an inanimate object, or a location-to appear within the flames and animate as you like. The shapes last for 1 hour.\n   If you cast this spell multiple times, you can have up to three of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action."
}, {
    "spell_name": "Control Winds",
    "spell_classes": "Druid, Sorcerer, Wizard, ",
    "spell_sources": "X,152,E,16,UA:D,8",
    "spell_level": 5,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "300 ft",
    "spell_components": "V,S",
    "spell_duration": "Conc, 1 h",
    "spell_ritual": null,
    "spell_text": "You take control of the air in a 100-foot cube that you can see within range. Choose one of the following effects when you cast the spell. The effect lasts for the spell's duration, unless you use your action on a later turn to switch to a different effect. You can also use your action to temporarily halt the effect or to restart one you've halted.\n   47-73: A wind picks up within the cube, continually blowing in a horizontal direction you designate. You choose the intensity of the wind: calm, moderate, or strong. If the wind is moderate or strong, ranged weapon attacks that enter or leave the cube or pass through it have disadvantage on their attack rolls. If the wind is strong, any creature moving against the wind must spend 1 extra foot of movement for each foot moved.\n   44-77: You cause a sustained blast of strong wind to blow downward from the top of the cube. Ranged weapon attacks that pass through the cube or that are made against targets within it have disadvantage on their attack rolls. A creature must make a Strength saving throw if it flies into the cube for the first time on a turn or starts its turn there flying. On a failed save, the creature is knocked prone.\n   55-64: You cause a sustained updraft within the cube, rising upward from the cube's bottom side. Creatures that end a fall within the cube take only half damage from the fall. When a creature in the cube makes a vertical jump, the creature can jump up to 10 feet higher than normal."
}, {
    "spell_name": "Create Bonfire",
    "spell_classes": "Druid, Sorcerer, Warlock, Wizard, ",
    "spell_sources": "X,152,E,16",
    "spell_level": 0,
    "spell_school": "Conjuration",
    "spell_time": "1 Action",
    "spell_range": "60 ft",
    "spell_components": "V,S",
    "spell_duration": "Conc, 1 min",
    "spell_ritual": null,
    "spell_text": "You create a bonfire on ground that you can see within range. Until the spell ends, the magic bonfire fills a 5-foot cube. Any creature in the bonfire's space when you cast the spell must succeed on a Dexterity saving throw or take 1d8 fire damage. A creature must also make the saving throw when it moves into the bonfire's space for the first time on a turn or ends its turn there.\n   The bonfire ignites flammable objects in its area that aren't being worn or carried.\n   The spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8)."
}, {
    "spell_name": "Dust Devil",
    "spell_classes": "Druid, Sorcerer, Wizard, ",
    "spell_sources": "X,154,E,17",
    "spell_level": 2,
    "spell_school": "Conjuration",
    "spell_time": "1 Action",
    "spell_range": "60 ft",
    "spell_components": "V,S,M",
    "spell_compMaterial": "A pinch of dust",
    "spell_duration": "Conc, 1 min",
    "spell_ritual": null,
    "spell_text": "Choose an unoccupied 5-foot cube of air that you can see within range. An elemental force that resembles a dust devil appears in the cube and lasts for the spell's duration.\n   Any creature that ends its turn within 5 feet of the dust devil must make a Strength saving throw. On a failed save, the creature takes 1d8 bludgeoning damage and is pushed 10 feet away from the dust devil. On a successful save, the creature takes half as much damage and isn't pushed.\n   As a bonus action, you can move the dust devil up to 30 feet in any direction. If the dust devil moves over sand, dust, loose dirt, or light gravel, it sucks up the material and forms a 10-foot-radius cloud of debris around itself that lasts until the start of your next turn. The cloud heavily obscures its area.\n   41-20: When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd."
}, {
    "spell_name": "Earthbind",
    "spell_classes": "Druid, Sorcerer, Warlock, Wizard, ",
    "spell_sources": "X,154,E,17",
    "spell_level": 2,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "300 ft",
    "spell_components": "V",
    "spell_duration": "Conc, 1 min",
    "spell_ritual": null,
    "spell_text": "Choose one creature you can see within range. Yellow strips of magical energy loop around the creature. The target must succeed on a Strength saving throw, or its flying speed (if any) is reduced to 0 feet for the spell's duration. An airborne creature affected by this spell safely descends at 60 feet per round until it reaches the ground or the spell ends."
}, {
    "spell_name": "Earth Tremor",
    "spell_classes": "Bard, Druid, Sorcerer, Wizard, ",
    "spell_sources": "X,155,E,17",
    "spell_level": 1,
    "spell_school": "Evocation",
    "spell_time": "1 Action",
    "spell_range": "10 ft",
    "spell_components": "V,S",
    "spell_duration": "Instantaneous",
    "spell_ritual": null,
    "spell_text": "You cause a tremor in the ground within range. Each creature other than you in that area must make a Dexterity saving throw. On a failed save, a creature takes 1d6 bludgeoning damage and is knocked prone. If the ground in that area is loose earth or stone, it becomes difficult terrain until cleared, with each 5-foot-diameter portion requiring at least 1 minute to clear by hand.\n   41-20: When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st."
}, {
    "spell_name": "Elemental Bane",
    "spell_classes": "Druid, Warlock, Wizard, ",
    "spell_sources": "X,155,E,17",
    "spell_level": 4,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "90 ft",
    "spell_components": "V,S",
    "spell_duration": "Conc, 1 min",
    "spell_ritual": null,
    "spell_text": "Choose one creature you can see within range, and choose one of the following damage types - acid, cold, fire, lightning, or thunder. The target must succeed on a Constitution saving throw or be affected by the spell for its duration. The first time each turn the affected target takes damage of the chosen type, the target takes an extra 2d6 damage of that type. Moreover, the target loses any resistance to that damage type until the spell ends.\n   41-20: When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th. The creatures must be within 30 feet of each other when you target them."
}, {
    "spell_name": "Erupting Earth",
    "spell_classes": "Druid, Sorcerer, Wizard, ",
    "spell_sources": "X,155,E,17",
    "spell_level": 3,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "120 ft",
    "spell_components": "V,S,M",
    "spell_compMaterial": "A piece of obsidian",
    "spell_duration": "Instantaneous",
    "spell_ritual": null,
    "spell_text": "Choose a point you can see on the ground within range. A fountain of churned earth and stone erupts in a 20-foot cube centered on that point. Each creature in that area must make a Dexterity saving throw. A creature takes 3d12 bludgeoning damage on a failed save, or half as much damage on a successful one. Additionally, the ground in that area becomes difficult terrain until cleared. Each 5-foot-square portion of the area requires at least 1 minute to clear by hand.\n   41-20: When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d12 for each slot level above 3rd."
}, {
    "spell_name": "Flame Arrows",
    "spell_classes": "Druid, Ranger, Sorcerer, Wizard, ",
    "spell_sources": "X,156,E,18",
    "spell_level": 3,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "Touch",
    "spell_components": "V,S",
    "spell_duration": "Conc, 1 h",
    "spell_ritual": null,
    "spell_text": "You touch a quiver containing arrows or bolts. When a target is hit by a ranged weapon attack using a piece of ammunition drawn from the quiver, the target takes an extra 1d6 fire damage. The spell's magic ends on the piece of ammunition when it hits or misses, and the spell ends when twelve pieces of ammunition have been drawn from the quiver.\n   41-20: When you cast this spell using a spell slot of 4th level or higher, the number of pieces of ammunition you can affect with this spell increases by two for each slot level above 3rd."
}, {
    "spell_name": "Frostbite",
    "spell_classes": "Druid, Sorcerer, Warlock, Wizard, ",
    "spell_sources": "X,156,E,18",
    "spell_level": 0,
    "spell_school": "Evocation",
    "spell_time": "1 Action",
    "spell_range": "60 ft",
    "spell_components": "V,S",
    "spell_duration": "Instantaneous",
    "spell_ritual": null,
    "spell_text": "You cause numbing frost to form on one creature that you can see within range. The target must make a Constitution saving throw. On a failed save, the target takes 1d6 cold damage, and it has disadvantage on the next weapon attack roll it makes before the end of its next turn.\n   The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6)."
}, {
    "spell_name": "Gust",
    "spell_classes": "Druid, Sorcerer, Wizard, ",
    "spell_sources": "WGtE,107,X,157,E,19,UA:D,6",
    "spell_level": 0,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "30 ft",
    "spell_components": "V,S",
    "spell_duration": "Instantaneous",
    "spell_ritual": null,
    "spell_text": "You seize the air and compel it to create one of the following effects at a point you can see within range.\n • One Medium or smaller creature that you choose must succeed on a Strength saving throw or be pushed up to 5 feet away from you.\n • You create a small blast of air capable of moving one object that is neither held nor carried and that weighs no more than 5 pounds. The object is pushed up to 10 feet away from you. It isn't pushed with enough force to cause damage.\n • You create a harmless sensory affect using air, such as causing leaves to rustle, wind to slam shutters shut, or your clothing to ripple in a breeze."
}, {
    "spell_name": "Ice Knife",
    "spell_classes": "Druid, Sorcerer, Wizard, ",
    "spell_sources": "X,157,E,19",
    "spell_level": 1,
    "spell_school": "Conjuration",
    "spell_time": "1 Action",
    "spell_range": "60 ft",
    "spell_components": "S,M",
    "spell_compMaterial": "A drop of water or piece of ice",
    "spell_duration": "Instantaneous",
    "spell_ritual": null,
    "spell_text": "You create a shard of ice and fling it at one creature within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 piercing damage. Hit or miss, the shard then explodes. The target and each creature within 5 feet of it must succeed on a Dexterity saving throw or take 2d6 cold damage.\n   41-20: When you cast this spell using a spell slot of 2nd level or higher, the cold damage increases by 1d6 for each slot level above 1st."
}, {
    "spell_name": "Immolation",
    "spell_classes": "Sorcerer, Wizard, ",
    "spell_sources": "X,158,E,19",
    "spell_level": 5,
    "spell_school": "Evocation",
    "spell_time": "1 Action",
    "spell_range": "90 ft",
    "spell_components": "V",
    "spell_duration": "Conc, 1 min",
    "spell_ritual": null,
    "spell_text": "Flames wreathe one creature you can see within range. The target must make a Dexterity saving throw. It takes 8d6 fire damage on a failed save, or half as much damage on a successful one. On a failed save, the target also burns for the spell's duration. The burning target sheds bright light in a 30-foot radius and dim light for an additional 30 feet. At the end of each of its turns, the target repeats the saving throw. It takes 4d6 fire damage on a failed save, and the spell ends on a successful one. These magical flames can't be extinguished by nonmagical means.\n   If damage from this spell kills a target, the target is turned to ash."
}, {
    "spell_name": "Investiture of Flame",
    "spell_classes": "Druid, Sorcerer, Warlock, Wizard, ",
    "spell_sources": "X,159,E,19",
    "spell_level": 6,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "Self",
    "spell_components": "V,S",
    "spell_duration": "Conc, 10 min",
    "spell_ritual": null,
    "spell_text": "Flames race across your body, shedding bright light in a 30-foot radius and dim light for an additional 30 feet for the spell's duration. The flames don't harm you. Until the spell ends, you gain the following benefits.\n • You are immune to fire damage and have resistance to cold damage.\n • Any creature that moves within 5 feet of you for the first time on a turn or ends its turn there takes 1d10 fire damage.\n • You can use your action to create a line of fire 15 feet long and 5 feet wide extending from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 4d8 fire damage on a failed save, or half as much damage on a successful one."
}, {
    "spell_name": "Investiture of Ice",
    "spell_classes": "Druid, Sorcerer, Warlock, Wizard, ",
    "spell_sources": "X,159,E,19",
    "spell_level": 6,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "Self",
    "spell_components": "V,S",
    "spell_duration": "Conc, 10 min",
    "spell_ritual": null,
    "spell_text": "Until the spell ends, ice rimes your body, and you gain the following benefits.\n • You are immune to cold damage and have resistance to fire damage.\n • You can move across difficult terrain created by ice or snow without spending extra movement.\n • The ground in a 10-foot radius around you is icy and is difficult terrain for creatures other than you. The radius moves with you.\n • You can use your action to create a 15-foot cone of freezing wind extending from your outstretched hand in a direction you choose. Each creature in the cone must make a Constitution saving throw. A creature takes 4d6 cold damage on a failed save, or half as much damage on a successful one. A creature that fails its save against this effect has its speed halved until the start of your next turn."
}, {
    "spell_name": "Investiture of Stone",
    "spell_classes": "Druid, Sorcerer, Warlock, Wizard, ",
    "spell_sources": "X,159,E,19",
    "spell_level": 6,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "Self",
    "spell_components": "V,S",
    "spell_duration": "Conc, 10 min",
    "spell_ritual": null,
    "spell_text": "Until the spell ends, bits of rock spread across your body, and you gain the following benefits:\n • You have resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks.\n • You can use your action to create a small earthquake on the ground in a 15-foot radius centered on you. Other creatures on that ground must succeed on a Dexterity saving throw or be knocked prone.\n • You can move across difficult terrain made of earth or stone without spending extra movement. You can move through solid earth or stone as if it was air and without destabilizing it, but you can't end your movement there. If you do so, you are ejected to the nearest unoccupied space, this spell ends, and you are stunned until the end of your next turn."
}, {
    "spell_name": "Investiture of Wind",
    "spell_classes": "Druid, Sorcerer, Warlock, Wizard, ",
    "spell_sources": "X,160,E,20",
    "spell_level": 6,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "Self",
    "spell_components": "V,S",
    "spell_duration": "Conc, 10 min",
    "spell_ritual": null,
    "spell_text": "Until the spell ends, wind whirls around you, and you gain the following benefits.\n • Ranged weapon attacks made against you have disadvantage on the attack roll.\n • You gain a flying speed of 60 feet. If you are still flying when the spell ends, you fall, unless you can somehow prevent it.\n • You can use your action to create a 15-foot cube of swirling wind centered on a point you can see within 60 feet of you. Each creature in that area must make a Constitution saving throw. A creature takes 2d10 bludgeoning damage on a failed save, or half as much damage on a successful one. If a Large or smaller creature fails the save, that creature is also pushed up to 10 feet away from the center of the cube."
}, {
    "spell_name": "Maelstrom",
    "spell_classes": "Druid, ",
    "spell_sources": "X,160,E,20",
    "spell_level": 5,
    "spell_school": "Evocation",
    "spell_time": "1 Action",
    "spell_range": "120 ft",
    "spell_components": "V,S,M",
    "spell_compMaterial": "Paper or leaf in the shape of a funnel",
    "spell_duration": "Conc, 1 min",
    "spell_ritual": null,
    "spell_text": "A mass of 5-foot-deep water appears and swirls in a 30-foot radius centered on a point you can see within range. The point must be on ground or in a body of water. Until the spell ends, that area is difficult terrain, and any creature that starts its turn there must succeed on a Strength saving throw or take 6d6 bludgeoning damage and be pulled 10 feet toward the center."
}, {
    "spell_name": "Magic Stone",
    "spell_classes": "Druid, Warlock, ",
    "spell_sources": "X,160,E,20",
    "spell_level": 0,
    "spell_school": "Transmutation",
    "spell_time": "1 Bonus Action",
    "spell_range": "Touch",
    "spell_components": "V,S",
    "spell_duration": "1 min",
    "spell_ritual": null,
    "spell_text": "You touch one to three pebbles and imbue them with magic. You or someone else can make a ranged spell attack with one of the pebbles by throwing it or hurling it with a sling. If thrown, it has a range of 60 feet. If someone else attacks with the pebble, that attacker adds your spellcasting ability modifier, not the attacker's, to the attack roll. On a hit, the target takes bludgeoning damage equal to 1d6 + your spellcasting ability modifier. Hit or miss, the spell then ends on the stone.\n   If you cast this spell again, the spell ends early on any pebbles still affected by it."
}, {
    "spell_name": "Maximilian's Earthen Grasp",
    "spell_classes": "Sorcerer, Wizard, ",
    "spell_sources": "X,161,E,20",
    "spell_level": 2,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "30 ft",
    "spell_components": "V,S,M",
    "spell_compMaterial": "A miniature hand sculpted from clay",
    "spell_duration": "Conc, 1 min",
    "spell_ritual": null,
    "spell_text": "You choose a 5-foot-square unoccupied space on the ground that you can see within range. A Medium hand made from compacted soil rises there and reaches for one creature you can see within 5 feet of it. The target must make a Strength saving throw. On a failed save, the target takes 2d6 bludgeoning damage and is restrained for the spell's duration.\n   As an action, you can cause the hand to crush the restrained target, which must make a Strength saving throw. The target takes 2d6 bludgeoning damage on a failed save, or half as much damage on a successful one.\n   To break out, the restrained target can use its action to make a Strength check against your spell save DC. On a success, the target escapes and is no longer restrained by the hand.\n   As an action, you can cause the hand to reach for a different creature or to move to a different unoccupied space within range. The hand releases a restrained target if you do either."
}, {
    "spell_name": "Melf's Minute Meteors",
    "spell_classes": "Sorcerer, Wizard, ",
    "spell_sources": "X,161,E,20",
    "spell_level": 3,
    "spell_school": "Evocation",
    "spell_time": "1 Action",
    "spell_range": "Self",
    "spell_components": "V,S,M",
    "spell_compMaterial": "Niter, sulfur, and pine tar formed into a bead",
    "spell_duration": "Conc, 10 min",
    "spell_ritual": null,
    "spell_text": "You create six tiny meteors in your space. They float in the air and orbit you for the spell's duration. When you cast the spell-and as a bonus action on each of your turns thereafter-you can expend one or two of the meteors, sending them streaking toward a point or points you choose within 120 feet of you. Once a meteor reaches its destination or impacts against a solid surface, the meteor explodes. Each creature within 5 feet of the point where the meteor explodes must make a Dexterity saving throw. A creature takes 2d6 fire damage on a failed save, or half as much damage on a successful one.\n   41-20: When you cast this spell using a spell slot of 4th level or higher, the number of meteors created increases by two for each slot level above 3rd."
}, {
    "spell_name": "Mold Earth",
    "spell_classes": "Druid, Sorcerer, Wizard, ",
    "spell_sources": "X,162,E,21",
    "spell_level": 0,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "30 ft",
    "spell_components": "S",
    "spell_duration": "Instant. or 1 h",
    "spell_ritual": null,
    "spell_text": "You choose a portion of dirt or stone that you can see within range and that fits within a 5-foot cube. You manipulate it in one of the following ways.\n • If you target an area of loose earth, you can instantaneously excavate it, move it along the ground, and deposit it up to 5 feet away. This movement doesn't have enough force to cause damage.\n • You cause shapes, colors, or both to appear on the dirt or stone, spelling out words, creating images, or shaping patterns. The changes last for 1 hour.\n • If the dirt or stone you target is on the ground, you cause it to become difficult terrain. Alternatively, you can cause the ground to become normal terrain if it is already difficult terrain. This change lasts for 1 hour.\n\nIf you cast this spell multiple times, you can have no more than two of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action."
}, {
    "spell_name": "Primordial Ward",
    "spell_classes": "Druid, ",
    "spell_sources": "X,163,E,21",
    "spell_level": 6,
    "spell_school": "Abjuration",
    "spell_time": "1 Action",
    "spell_range": "Self",
    "spell_components": "V,S",
    "spell_duration": "Conc, 1 min",
    "spell_ritual": null,
    "spell_text": "You have resistance to acid, cold, fire, lightning, and thunder damage for the spell's duration.\n   When you take damage of one of those types, you can use your reaction to gain immunity to that type of damage, including against the triggering damage. If you do so, the resistances end, and you have the immunity until the end of your next turn, at which time the spell ends."
}, {
    "spell_name": "Pyrotechnics",
    "spell_classes": "Bard, Sorcerer, Wizard, ",
    "spell_sources": "X,163,E,21",
    "spell_level": 2,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "60 ft",
    "spell_components": "V,S",
    "spell_duration": "Instantaneous",
    "spell_ritual": null,
    "spell_text": "Choose an area of nonmagical flame that you can see and that fits within a 5-foot cube within range. You can extinguish the fire in that area, and you create either fireworks or smoke when you do so.\n   46-72: The target explodes with a dazzling display of colors. Each creature within 10 feet of the target must succeed on a Constitution saving throw or become blinded until the end of your next turn.\n   53-6f: Thick black smoke spreads out from the target in a 20-foot radius, moving around corners. The area of the smoke is heavily obscured. The smoke persists for 1 minute or until a strong wind disperses it."
}, {
    "spell_name": "Shape Water",
    "spell_classes": "Druid, Sorcerer, Wizard, ",
    "spell_sources": "X,164,E,21",
    "spell_level": 0,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "30 ft",
    "spell_components": "S",
    "spell_duration": "Instant. or 1 h",
    "spell_ritual": null,
    "spell_text": "You choose an area of water that you can see within range and that fits within a 5-foot cube. You manipulate it in one of the following ways.\n • You instantaneously move or otherwise change the flow of the water as you direct, up to 5 feet in any direction. This movement doesn't have enough force to cause damage.\n • You cause the water to form into simple shapes and animate at your direction. This change lasts for 1 hour.\n • You change the water's color or opacity. The water must be changed in the same way throughout. This change lasts for 1 hour.\n • You freeze the water, provided that there are no creatures in it. The water unfreezes in 1 hour.\n\nIf you cast this spell multiple times, you can have no more than two of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action."
}, {
    "spell_name": "Skywrite",
    "spell_classes": "Bard, Druid, Wizard, ",
    "spell_sources": "X,165,E,22",
    "spell_level": 2,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "Sight",
    "spell_components": "V,S",
    "spell_duration": "Conc, 1 h",
    "spell_ritual": true,
    "spell_text": "You cause up to ten words to form in a part of the sky you can see. The words appear to be made of cloud and remain in place for the spell's duration. The words dissipate when the spell ends. A strong wind can disperse the clouds and end the spell early."
}, {
    "spell_name": "Snilloc's Snowball Swarm",
    "spell_classes": "Sorcerer, Wizard, ",
    "spell_sources": "X,165,E,22",
    "spell_level": 2,
    "spell_school": "Evocation",
    "spell_time": "1 Action",
    "spell_range": "90 ft",
    "spell_components": "V,S,M",
    "spell_compMaterial": "A piece of ice or a small white rock chip",
    "spell_duration": "Instantaneous",
    "spell_ritual": null,
    "spell_text": "A flurry of magic snowballs erupts from a point you choose within range. Each creature in a 5-foot-radius sphere centered on that point must make a Dexterity saving throw. A creature takes 3d6 cold damage on a failed save, or half as much damage on a successful one.\n   41-20: When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for each slot level above 2nd."
}, {
    "spell_name": "Storm Sphere",
    "spell_classes": "Sorcerer, Wizard, ",
    "spell_sources": "X,166,E,22",
    "spell_level": 4,
    "spell_school": "Evocation",
    "spell_time": "1 Action",
    "spell_range": "150 ft",
    "spell_components": "V,S",
    "spell_duration": "Conc, 1 min",
    "spell_ritual": null,
    "spell_text": "A 20-foot-radius sphere of whirling air springs into existence centered on a point you choose within range. The sphere remains for the spell's duration. Each creature in the sphere when it appears or that ends its turn there must succeed on a Strength saving throw or take 2d6 bludgeoning damage. The sphere's space is difficult terrain.\n   Until the spell ends, you can use a bonus action on each of your turns to cause a bolt of lightning to leap from the center of the sphere toward one creature you choose within 60 feet of the center. Make a ranged spell attack. You have advantage on the attack roll if the target is in the sphere. On a hit, the target takes 4d6 lightning damage.\n   Creatures within 30 feet of the sphere have disadvantage on Wisdom (Perception) checks made to listen.\n   41-20: When you cast this spell using a spell slot of 5th level or higher, the damage increases for each of its effects by 1d6 for each slot level above 4th."
}, {
    "spell_name": "Thunderclap",
    "spell_classes": "Bard, Druid, Sorcerer, Warlock, Wizard, ",
    "spell_sources": "X,168,E,22",
    "spell_level": 0,
    "spell_school": "Evocation",
    "spell_time": "1 Action",
    "spell_range": "5 ft",
    "spell_components": "S",
    "spell_duration": "Instantaneous",
    "spell_ritual": null,
    "spell_text": "You create a burst of thunderous sound that can be heard up to 100 feet away. Each creature within range, other than you, must succeed on a Constitution saving throw or take 1d6 thunder damage.\n   The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6)."
}, {
    "spell_name": "Tidal Wave",
    "spell_classes": "Druid, Sorcerer, Wizard, ",
    "spell_sources": "X,168,E,22",
    "spell_level": 3,
    "spell_school": "Conjuration",
    "spell_time": "1 Action",
    "spell_range": "120 ft",
    "spell_components": "V,S,M",
    "spell_compMaterial": "A drop of water",
    "spell_duration": "Instantaneous",
    "spell_ritual": null,
    "spell_text": "You conjure up a wave of water that crashes down on an area within range. The area can be up to 30 feet long, up to 10 feet wide, and up to 10 feet tall. Each creature in that area must make a Dexterity saving throw. On a failed save, a creature takes 4d8 bludgeoning damage and is knocked prone. On a successful save, a creature takes half as much damage and isn't knocked prone. The water then spreads out across the ground in all directions, extinguishing unprotected flames in its area and within 30 feet of it, and then it vanishes."
}, {
    "spell_name": "Transmute Rock",
    "spell_classes": "Druid, Wizard, ",
    "spell_sources": "X,169,E,22",
    "spell_level": 5,
    "spell_school": "Transmutation",
    "spell_time": "1 Action",
    "spell_range": "120 ft",
    "spell_components": "V,S,M",
    "spell_compMaterial": "Clay and water",
    "spell_duration": "Until dispelled",
    "spell_ritual": null,
    "spell_text": "You choose an area of stone or mud that you can see that fits within a 40-foot cube and is within range, and choose one of the following effects.\n   54-61: Nonmagical rock of any sort in the area becomes an equal volume of thick, flowing mud that remains for the spell's duration.\n   The ground in the spell's area becomes muddy enough that creatures can sink into it. Each foot that a creature moves through the mud costs 4 feet of movement, and any creature on the ground when you cast the spell must make a Strength saving throw. A creature must also make the saving throw when it moves into the area for the first time on a turn or ends its turn there. On a failed save, a creature sinks into the mud and is restrained, though it can use an action to end the restrained condition on itself by pulling itself free of the mud.\n   If you cast the spell on a ceiling, the mud falls. Any creature under the mud when it falls must make a Dexterity saving throw. A creature takes 4d8 bludgeoning damage on a failed save, or half as much damage on a successful one.\n   54-61: Nonmagical mud or quicksand in the area no more than 10 feet deep transforms into soft stone for the spell's duration. Any creature in the mud when it transforms must make a Dexterity saving throw. On a successful save, a creature is shunted safely to the surface in an unoccupied space. On a failed save, a creature becomes restrained by the rock. A restrained creature, or another creature within reach, can use an action to try to break the rock by succeeding on a DC 20 Strength check or by dealing damage to it. The rock has AC 15 and 25 hit points, and it is immune to poison and psychic damage."
}, {
    "spell_name": "Vitriolic Sphere",
    "spell_classes": "Sorcerer, Wizard, ",
    "spell_sources": "X,170,E,23",
    "spell_level": 4,
    "spell_school": "Evocation",
    "spell_time": "1 Action",
    "spell_range": "150 ft",
    "spell_components": "V,S,M",
    "spell_compMaterial": "A drop of giant slug bile",
    "spell_duration": "Instantaneous",
    "spell_ritual": null,
    "spell_text": "You point at a location within range, and a glowing, 1-foot-diameter ball of emerald acid streaks there and explodes in a 20-foot-radius sphere. Each creature in that area must make a Dexterity saving throw. On a failed save, a creature takes 10d4 acid damage and another 5d4 acid damage at the end of its next turn. On a successful save, a creature takes half the initial damage and no damage at the end of its next turn.\n   41-20: When you cast this spell using a spell slot of 5th level or higher, the initial damage increases by 2d4 for each slot level above 4th."
}, {
    "spell_name": "Wall of Sand",
    "spell_classes": "Wizard, ",
    "spell_sources": "X,170,E,23",
    "spell_level": 3,
    "spell_school": "Evocation",
    "spell_time": "1 Action",
    "spell_range": "90 ft",
    "spell_components": "V,S,M",
    "spell_compMaterial": "A handful of sand",
    "spell_duration": "Conc, 10 min",
    "spell_ritual": null,
    "spell_text": "You conjure up a wall of swirling sand on the ground at a point you can see within range. You can make the wall up to 30 feet long, 10 feet high, and 10 feet thick, and it vanishes when the spell ends. It blocks line of sight but not movement. A creature is blinded while in the wall's space and must spend 3 feet of movement for every 1 foot it moves there."
}, {
    "spell_name": "Wall of Water",
    "spell_classes": "Druid, Sorcerer, Wizard, ",
    "spell_sources": "X,170,E,23",
    "spell_level": 3,
    "spell_school": "Evocation",
    "spell_time": "1 Action",
    "spell_range": "60 ft",
    "spell_components": "V,S,M",
    "spell_compMaterial": "A drop of water",
    "spell_duration": "Conc, 10 min",
    "spell_ritual": null,
    "spell_text": "You conjure up a wall of water on the ground at a point you can see within range. You can make the wall up to 30 feet long, 10 feet high, and 1 foot thick, or you can make a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall vanishes when the spell ends. The wall's space is difficult terrain.\n   Any ranged weapon attack that enters the wall's space has disadvantage on the attack roll, and fire damage is halved if the fire effect passes through the wall to reach its target. Spells that deal cold damage that pass through the wall cause the area of the wall they pass through to freeze solid (at least a 5-foot square section is frozen). Each 5-foot-square frozen section has AC 5 and 15 hit points. Reducing a frozen section to 0 hit points destroys it. When a section is destroyed, the wall's water doesn't fill it."
}, {
    "spell_name": "Warding Wind",
    "spell_classes": "Bard, Druid, Sorcerer, Wizard, ",
    "spell_sources": "X,170,E,23",
    "spell_level": 2,
    "spell_school": "Evocation",
    "spell_time": "1 Action",
    "spell_range": "10-ft rad",
    "spell_components": "V",
    "spell_duration": "Conc, 10 min",
    "spell_ritual": null,
    "spell_text": "A strong wind (20 miles per hour) blows around you in a 10-foot radius and moves with you, remaining centered on you. The wind lasts for the spell's duration.\n   The wind has the following effects.\n • It deafens you and other creatures in its area.\n • It extinguishes unprotected flames in its area that are torch-sized or smaller.\n • The area is difficult terrain for creatures other than you.\n • The attack rolls of ranged weapon attacks have disadvantage if they pass in or out of the wind.\n • It hedges out vapor, gas, and fog that can be dispersed by strong wind."
}, {
    "spell_name": "Watery Sphere",
    "spell_classes": "Druid, Sorcerer, Wizard, ",
    "spell_sources": "X,170,E,23",
    "spell_level": 4,
    "spell_school": "Conjuration",
    "spell_time": "1 Action",
    "spell_range": "90 ft",
    "spell_components": "V,S,M",
    "spell_compMaterial": "A droplet of water",
    "spell_duration": "Conc, 1 min",
    "spell_ritual": null,
    "spell_text": "You conjure up a sphere of water with a 5-foot radius at a point you can see within range. The sphere can hover but no more than 10 feet off the ground. The sphere remains for the spell's duration.\n   Any creature in the sphere's space must make a Strength saving throw. On a successful save, a creature is ejected from that space to the nearest unoccupied space of the creature's choice outside the sphere. A Huge or larger creature succeeds on the saving throw automatically, and a Large or smaller creature can choose to fail it. On a failed save, a creature is restrained by the sphere and is engulfed by the water. At the end of each of its turns, a restrained target can repeat the saving throw, ending the effect on itself on a success.\n   The sphere can restrain as many as four Medium or smaller creatures or one Large creature. If the sphere restrains a creature that causes it to exceed this capacity, a random creature that was already restrained by the sphere falls out of it and lands prone in a space within 5 feet of it.\n   As an action, you can move the sphere up to 30 feet in a straight line. If it moves over a pit, a cliff, or other drop-off, it safely descends until it is hovering 10 feet above the ground. Any creature restrained by the sphere moves with it. You can ram the sphere into creatures, forcing them to make the saving throw.\n   When the spell ends, the sphere falls to the ground and extinguishes all normal flames within 30 feet of it. Any creature restrained by the sphere is knocked prone in the space where it falls. The water then vanishes."
}, {
    "spell_name": "Whirlwind",
    "spell_classes": "Druid, Sorcerer, Wizard, ",
    "spell_sources": "X,171,E,24",
    "spell_level": 7,
    "spell_school": "Evocation",
    "spell_time": "1 Action",
    "spell_range": "300 ft",
    "spell_components": "V,M",
    "spell_compMaterial": "A piece of straw",
    "spell_duration": "Conc, 1 min",
    "spell_ritual": null,
    "spell_text": "A whirlwind howls down to a point that you can see on the ground within range. The whirlwind is a 10-foot-radius, 30-foot-high cylinder centered on that point. Until the spell ends, you can use your action to move the whirlwind up to 30 feet in any direction along the ground. The whirlwind sucks up any Medium or smaller objects that aren't secured to anything and that aren't worn or carried by anyone.\n   A creature must make a Dexterity saving throw the first time on a turn that it enters the whirlwind or that the whirlwind enters its space, including when the whirlwind first appears. A creature takes 10d6 bludgeoning damage on a failed save, or half as much damage on a successful one. In addition, a Large or smaller creature that fails the save must succeed on a Strength saving throw or become restrained in the whirlwind until the spell ends. When a creature starts its turn restrained by the whirlwind, the creature is pulled 5 feet higher inside it, unless the creature is at the top. A restrained creature moves with the whirlwind and falls when the spell ends, unless the creature has some means to stay aloft.\n   A restrained creature can use an action to make a Strength or Dexterity check against your spell save DC. If successful, the creature is no longer restrained by the whirlwind and is hurled 3d6 × 10 feet away from it in a random direction."
}
]
