[
  {
    "classes": "Wizard, Sorcerer, Warlock",
    "components": "V, S, M (4 ounces of fluid, which the spell consumes)",
    "duration": "Instantaneous",
    "id": 1,
    "level": 1,
    "name": "Aerosolize Fluid",
    "range": "30 feet",
    "ritual": null,
    "school": "Transmutation",
    "sources": "WolframHydroxide",
    "text": "You cause the component fluid to careen to the target location, avoiding obstacles. Upon reaching the target, the fluid explosively boils, instantly filling a 15 foot cube (or space of equal volume) Any properties of the fluid take immediate effect within the cloud, and any creature within the cloud experiences the same effect as if the fluid were in direct contact with all exposed areas. If a creature inhales the mist, any effects of inhalation also take effect.",
    "time": "1 action"
  },
  {
    "classes": "Cleric, Wizard, Bard",
    "components": "V, S, M (a tiny piece of the matter you wish to create)",
    "duration": "Instantaneous",
    "id": 2,
    "level": 7,
    "name": "True Creation",
    "range": "30 feet",
    "ritual": null,
    "school": "Conjuration",
    "sources": "WolframHydroxide",
    "text": "As you cast the spell, you channel energy from the inner planes, shaping the energy into material with weight and form. You create a cube of the desired raw material worth up to 500 gp. You cannot create inherently magical materials with this spell, such as alchemical silver or a potion of invisibility, nor can you create organic matter or anything formed directly through an organic process. The conjuration of pearl or limestone, for example, would only produce calcite or marble (chosen randomly). After channeling such powerful energy, you must immediately take a long rest or suffer 2 levels of exhaustion.",
    "time": "1 hour"
  },
  {
    "classes": "Cleric, Wizard, Druid, Bard",
    "components": "V, S, M (a non-functioning magic item or broken non-magical item of appropriate rarity/size, and enchanting components worth half as much as the item to be repaired, which the spell consumes)",
    "duration": "Instantaneous",
    "id": 3,
    "level": 3,
    "name": "Greater Mending",
    "range": "Touch",
    "ritual": null,
    "school": "Transmutation",
    "sources": "WolframHydroxide",
    "text": "You repair severed connections, both magical and non-magical within an unconsumed item that is broken or has lost its power, mending it and imbuing it with any powers it previously held. After sucessfully casting this spell, you must immediately take a short rest or suffer 1 level of exhaustion. The rarity of a magic item or size of a non-magical item that can be repaired depends upon the level of the spell slot used.\n\n| Slot Level |      Rarity     |  Size  |\n|:------------:|:--------------|:-------|\n|      3rd       | Common     | Small  |\n|      5th       | Uncommon | Medium |\n|      7th       | Rare            | Large  |\n|      9th       | Very Rare   | Huge   |\n",
    "time": "1 hour"
  },
  {
    "classes": "Warlock, Wizard, Bard",
    "components": "V, S, M (4 beholder eyestalks and ritual components totaling at least 250 gp in value, all of which the spell consumes)",
    "duration": "Instantaneous",
    "id": 4,
    "level": 5,
    "name": "Conjure Spectator",
    "range": "Touch",
    "ritual": null,
    "school": "Conjuration",
    "sources": "WolframHydroxide",
    "text": "You summon a spectator to guard a location or treasure of your choosing. The spectator will loyally guard its quarry for 101 years, after which it is freed from service. ",
    "time": "24 hours"
  },
  {
    "classes": "Cleric, Paladin, Warlock, Bard",
    "components": "V, S, M (Valuable parchment, inks and quills worth at least 100 gp, which the spell consumes) ",
    "duration": "Until Dispelled, Fulfilled or Broken",
    "id": 5,
    "level": 4,
    "name": "Pact",
    "range": "Touch",
    "ritual": 1,
    "school": "Abjuration",
    "sources": "WolframHydroxide",
    "text": "Before casting this spell, two or more parties in mutual agreement record a contractual agreement using the material components. If either party is under the influence of an effect that would augment its will (such as the suggestion or the geas spell), the spell fails, but neither party is made aware of the source of the influence, nor which party is influenced. The terms need not be necessarily easily exacted, but must be possible to fulfill. For example, a party could offer an intangible concept, such as their voice, their intellect, their alignment, or even their soul, and the spell will ensure and facilitate the trade. Without further specification, terms are taken at their literal meaning. The offering party must be unquestionably entitled to offer the transference of the goods and services offered. Terms of severance may be enacted. When the spell is cast, both parties are bound through a handshake or other gesture of mutual affirmation, and must carry out the terms of the pact to the best of their abilities. An entity which knowingly makes a pact in bad faith suffers 4d10 necrotic damage, all other parties are made magically aware of the treachery, and the spell ends without further effect. Any terms regarding immediately transferrable goods are enacted immediately upon casting the spell. If, at any time before the terms of the pact are fulfilled by all parties, any party forswears or breaks the pact, attempts to dispel the pact, or becomes unable to fulfill the terms set forth, all other surviving parties are immediately notified and may, at will, exact any penalties set forth in the contract for breaking it.",
    "time": "1 minute"
  },
  {
    "classes": "Cleric, Wizard",
    "components": "V, S, M (A quill made from a freely-given couatl feather, Parchment made from tanned imp leather, and ink made from the oil between the cogs of a pentadrone)",
    "duration": "Until Dissolved",
    "id": 6,
    "level": 9,
    "name": "Greater Pact",
    "range": "Touch",
    "ritual": null,
    "school": "Abjuration",
    "sources": "WolframHydroxide",
    "text": "By channeling your own energy into another willing being, you make a pact with it, and it becomes a warlock in your service, to whatever end you set forth in the contract. When you cast this spell, name a Class level less than your own. This is the maximum warlock level the warlock may achieve from your pact without renegotiation. When you cast this spell, you must give up the same number of spell slots that your new warlock gains. Every time the Warlock gains a new spell slot, you must sacrifice another. These spell slots can be of any level, but cannot be regained except by dissolution of the pact. Every time the warlock would gain a Mystic Arcanum, you must sacrifice a single slot of that level. As this new warlock advances (at your discretion), you may cast this spell again to change the amount of energy the warlock receives from you and renegotiate your terms.\n\n**Extra Effects:** When you cast this spell, you may additionally designate extra spell slots of varying levelsl to gain overt magical control over some aspect of your new warlock. With each extra sacrificed spell slot, you gain one of the following, which works over any co-planar distance, so long as the sacrificed slot is of equal or greater level than the number listed for \n\n  * At-Will Rary's telepathic bond (5)\n  * Geas 1/day (5)\n  * Teleport (bring warlock to your presence without fail, then dismiss them within the next hour as an action) 1/day (7) ",
    "time": "1 hour"
  },
  {
    "classes": "Wizard",
    "components": "V, S",
    "duration": "1 round",
    "id": 7,
    "level": 5,
    "name": "Lesser Rewind",
    "range": "Self",
    "ritual": null,
    "school": "Abjuration",
    "sources": "WolframHydroxide",
    "text": "You place an imprint of yourself in the space you currently occupy. Record your HP and any status effects such as conditions, curses, and spell effects. At the start of your next turn, as long as you are not unconscious, you may choose to return to the prior recorded state, regenerating lost health, and returning any conditions to your state at the time of recording, and returning to your prior position. Then, whether you chose to rewind or not, the spell ends.",
    "time": "1 bonus action"
  },
  {
    "classes": "Wizard, Bard",
    "components": "V, S, M (a tiny crystal hourglass containing powdered jacinth worth 500 gp, turned thrice in the hand)",
    "duration": "Concentration, up to 1 minute",
    "id": 8,
    "level": 9,
    "name": "Greater Rewind",
    "range": "Self",
    "ritual": null,
    "school": "Abjuration",
    "sources": "WolframHydroxide",
    "text": "When this spell is cast, a hazy form in the shape of the caster appears in the space the caster occupies, while the caster appears to be slightly translucent. This spell imprints the caster's current state onto the web of fate for later recall. Record the HP, spell slots, features, as well as status effects such as conditions, curses, and spell effects of the caster after casting this spell. As a bonus action on a later turn before the spell ends, the caster may return to their prior state, reverting all recorded statistics to the moment immediately after casting this spell.",
    "time": "1 action"
  },
  {
    "classes": "Warlock, Paladin, Bard",
    "components": "V, S",
    "duration": "Concentration, up to 1 hour",
    "id": 9,
    "level": 3,
    "name": "Afterimage",
    "range": "Self",
    "ritual": null,
    "school": "Divination",
    "sources": "WolframHydroxide",
    "text": "You cause the Weave to manifest around you, forming a 30-foot radius spherical aura which shows the afterimages of creatures and magic spells, items and effects which have passed within the aura's area in the last eight hours. The auras are visible to all creatures, and spells which interact with other spell effects, such as the _identify_ and _mimic_ spells, can target spell afterimages as if they had not ended. The afterimages of cratures are mere silhouettes, so one is not generally distinguishable from another unless the sizes of the creatures are different. ",
    "time": "1 action"
  },
  {
    "classes": "Bard, Warlock, Sorcerer",
    "components": "V, S",
    "duration": "Instantaneous",
    "id": 10,
    "level": 6,
    "name": "Mimic",
    "range": "30 feet",
    "ritual": null,
    "school": "Evocation",
    "sources": "WolframHydroxide",
    "text": "You draw on the magical residuum in the weave left over from a spell cast within range in the last eight hours, cast at fifth level or less, of which you are aware. You mimic the effects of that spell, as if you were casting it yourself, without providing any components. You can choose to either keep the parameters of the original casting, including target, or you can change them at will. For example, if the spell cast was _dimension door_, then you could either choose to target the same location as the previous casting or choose your own. You do not have to know the target or other parameters of the previous spell to cast the spell in this way. \n\n**Higher Level Casting:** When you spend a spell slot of eighth level or higher, the highest level spell slot you can mimic increases to sixth.",
    "time": "1 action or reaction"
  }
]
