[{
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_level": 4,
        "spell_name": "Absorb Hazard",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tAs you see an attack that would deal more damage than usual, you can reduce the lethality of the blow. Whenever yourself or a creature you can see within range has a critical attack upon them, you can reduce it to a normal attack.\r\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "None",
        "spell_components": "S",
        "spell_duration": "Instantaneous",
        "spell_level": 0,
        "spell_name": "Air Blade",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou move your hands in a fashion that a wave of air forms a blade, slashing any creature in its path. Make a ranged spell attack against the target. Any loose objects that weigh less than one pound flies in a random direction, along with any uncovered flames are extinguished. On a hit, the target takes 1d6 slashing damage.\\n\tThis spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and again at 17th level (4d6).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a single eye agate gem worth 50 gp)",
        "spell_duration": "Concentration, up to 1 hour.",
        "spell_level": 2,
        "spell_name": "Animal Conduit",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Divination",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou touch a willing creature, and you gain control of the creature. You can perform its actions and observe the world through its senses, including touch, taste and hearing. You continue to observe the world through the beast until you dismiss it or end the spell early. While you are using the beast in this way, your body is under the blinded and deafened conditions. Your humanoid body speed becomes 0 for the spell duration and is effectively incapacitated.\\n",
        "spell_time": "1 minute"
    }, {
        "spell_classes": "None",
        "spell_components": "S, V",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_level": 0,
        "spell_name": "Anticipation",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Divination",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou touch one willing creature. Once before the spell ends, the first attack directed at the target has disadvantage. The spell then ends.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "S, V",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_level": 0,
        "spell_name": "Apparition",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Illusion",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou create the illusion of a creature out of the inky mists sourced from the Shadowfell. This creature can be any creature of your choice, as long as it is Medium size or smaller. This apparition acts as though it is the real creature you created, but does not deal damage. Choose one creature within range. A target creature must make an Intelligence saving throw. On a successful save, the creature knows that the apparition is a hallucination, but is still visible to the target creature.\\n\tThis spell can affect an additional creature when you reach 5th level (2), 11th level (3), and 17th level (4).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V",
        "spell_duration": "Concentration, up to 1 minute.",
        "spell_level": 1,
        "spell_name": "Arcane Arrow",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou select one piece of ammunition that you can touch. When you do so, the weapon you fire the ammunition from deals force damage instead of the normal weapon damage, with the same damage die. In addition, you can summon the arrow back into your hand as a bonus action. This effect lasts for as long as you maintain concentration on the spell or until the spell ends.\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (A sprinkle of sulfur and lithium)",
        "spell_duration": "Instantaneous",
        "spell_level": 3,
        "spell_name": "Arcane Explosion",
        "spell_range": "150 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tA sudden explosion of violets and blues comes from an area within range, then slowly expands to engulf anything around it. Each creature within a 10 foot radius, centered on the point you choose, must make a Dexterity saving throw. On a failed save, a target takes 3d6 force damage and 3d6 psychic damage, and is then pushed 10 feet into the center of the spell. Unsecured objects that weigh less than 15 pounds are moved 10 feet towards the center of the radius. On a successful save, the target only takes half of the damage.\\n\tAt higher levels: When you cast this spell using a spell slot of 4th level or higher, the force damage increases by 1d6 for each slot above 3rd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "S, V",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_level": 0,
        "spell_name": "Arcane Grasp",
        "spell_range": "15 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou attempt to lift a creature with the magical forces you manipulate. When you cast the Level: 0, and as your action each round for the duration, you can exert your will on one creature of Medium size or smaller that you can see within range. You can affect the same target round after round, or choose a new one at any time. If you switch targets, the prior target is no longer affected by the spell. Make an ability check with your spellcasting ability contested by the creature’s Strength check. If you win the contest, you move the creature up to 15 feet in any direction horizontally, but not vertically, as long as they are still within range. If a creature would be moved to an area that has no solid object underneath it, the creature stays in the closest 5 foot square with solid ground, and the spell ends.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_level": 1,
        "spell_name": "Arcane Projectile",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tAs a reaction to a ranged attack that you can see, you wave your arms in a circular pattern, creating two holes and attempt to fire the projectile back. If a ranged attack would hit you, it instead misses, and travels up to the same distance that it was travelled to reach you. Select one target that you can see. Make a ranged spell attack against the target. On a hit, the creature takes 1d6 force damage.\\n\tAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each spell slot above 1st.\\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "1 round",
        "spell_level": 1,
        "spell_name": "Arcane Shield",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tAs a reaction to an attack towards a person that you can see, you wave your arms in a triangular pattern, creating a barrier of protection. Select one target that you can see being attacked. Until the start of your next turn, the target creature has a +1 bonus to AC, including against the triggering attack, and they take no damage from magic missile. At Higher Levels.\\n\tWhen you cast this spell using a spell slot of 2nd level or higher, the bonus to AC increases by +1 for each spell slot above 1st.\\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a purple silk strip)",
        "spell_duration": "8 hours",
        "spell_level": 1,
        "spell_name": "Armor of Mindartis",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou touch a willing creature who isn't wearing any form of armor, including the mage armor spell or similar effects. The target's base AC becomes 13 + its spellcasting ability modifier. The spell ends if the target dons armor or you dismiss the spell as an action.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a tourmaline gem worth 100 gp, which the spell consumes)",
        "spell_duration": "Instantaneous",
        "spell_level": 3,
        "spell_name": "Astral Guardian",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou summon a glimmering creature from the silver sea. As an action, select a place within range. The creature is summoned to that point. The creature is Medium sized, has hit points equal to your hit point maximum, has an AC equal to your AC, and has a flying speed equal to your speed. The creature is considered ethereal. As a bonus action, you can move the creature. Whenever it enters an occupied space from another creature, that target creature must make a Wisdom saving throw. On a failure, the target creature takes 6d6 psychic damage. At higher levels: When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot above 3rd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_level": 1,
        "spell_name": "Bloom",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou touch a small seed or plant and grow it to maturity within a matter of seconds. The flower cannot be larger than 2 feet in any direction when fully developed. If fruit would be harvested off of the plant, you may do so but only enough for one person.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 10 minutes.",
        "spell_level": 1,
        "spell_name": "Brand",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Divination",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou point at a creature that you can see within range. The target creature must make a Wisdom saving throw. On a failure, you know exactly where the creature is, even if they become hidden or turn invisible, until the spell ends or you dismiss the spell.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a bag of chicken bones)",
        "spell_duration": "Concentration, up to 10 minutes.",
        "spell_level": 3,
        "spell_name": "Bright Rot",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou emit a bright, blinding light that covers your entire body. It appears like a majestic aura, that some may interpret as a divine radiance. Whenever you get hit by a melee attack, the attacking creature must make a Dexterity saving throw. On a failure, the creature takes 3d6 necrotic and 3d6 radiant damage. On a success, the creature takes half damage.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (an onyx gem worth 50 gp)",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_level": 2,
        "spell_name": "Chaos Blast",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou send a ray of chaotic sludge that looks as if the rainbow had been twisted together. Make a ranged spell attack. On a hit, the creature takes 2d6 damage, determined on the table below. Chaos Blast Damage Type (d6): 1 Acid 2 Thunder 3 Cold 4 Poison 5 Fire 6 Lightning Once there is a successful hit, you can use your action to maintain concentration on this spell. If you do, you automatically hit. The target creature takes 2d6 damage, determined on the table once more.\\n\tAt higher levels: Whenever you cast this spell at 3rd level or higher, you roll an additional 1d6 damage, determined by another roll on the Chaos Blast Damage Table found above, for every spell slot above 2nd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute.",
        "spell_level": 0,
        "spell_name": "Chorus",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou create an infectious choir, singing loudly. Select 2 creatures within 30 feet of you that you can see. If the target creatures share a language with you, they must make a Wisdom saving throw. On a failure, the creatures sing along with you and are unable to make an action or movement during their turn. The creature can repeat the saving throw at the beginning of their turns. On a success, the creature cannot be affected for 24 hours. If a creature does not share a common language with you, the creature automatically succeeds.\\n\tThis spell can affect additional creatures, increasing by 2 when you reach 5th level (4), 11th level (6) and again at 17th level (8).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "S",
        "spell_duration": "Instantaneous",
        "spell_level": 2,
        "spell_name": "Communicate Idea",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Divination",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou touch a willing creature, transmitting a complex idea, plan or picture into their mind. The target creature then fully understands the idea that you are telling them.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "S",
        "spell_duration": "Concentration, up to 1 minute.",
        "spell_level": 0,
        "spell_name": "Conceal",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Illusion",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou touch a small object that is smaller than 1 foot in any direction. For the duration of the spell, the item is magically concealed from view. Any creature that searches for the item must make a Wisdom saving throw. On a failure, the creature fails to find the object. On a success, the creature finds the object. If the concealed object is threatening, the creature has advantage on the saving throw.\\n\tThis spell can affect additional objects, increasing by 2 when you reach 5th level (3), 11th level (5) and again at 17th level (7).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "S",
        "spell_duration": "Instantaneous",
        "spell_id": 1279,
        "spell_level": 0,
        "spell_name": "Concussive Blast",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tA blast of concussive force emits from your hand, knocking anything away from your palm. Make a melee spell attack. On a hit, the target takes 1d8 force damage. If the target is an object, the object takes maximum damage. If your attack roll lands on a 1, the blast backfires, and you take the damage instead.\\n\tThis spell's damage increases by 1d8 and failure chance increases by 1 when you reach 5th level (2d8 damage, failure at 1 or 2), 11th level (3d8, failure at 1, 2 or 3), and again at 17th level (4d8, failure at 1, 2, 3 or 4).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "S, M (a single black pearl worth 500 gp)",
        "spell_duration": "Concentration, up to 10 minutes.",
        "spell_level": 4,
        "spell_name": "Corrosion",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou emit an aura of corrosion around you that affects metallic items. This aura reaches a 15 foot radius, centered on you. Any time a nonmagical metallic item starts its turn or enters inside the 15 foot radius, it takes a -1 to its hit points or armor class. Whenever an item has received a total reduction of -5 for armor class or hit points, the item is destroyed. Whenever an item is outside of the radius, it does not lose this reduction. Instead, it must be repaired with smith's tools. The DC is set at your spell save DC.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a small bag that is closed)",
        "spell_duration": "Instantaneous",
        "spell_level": 1,
        "spell_name": "Create Air",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou open a small bag or pouch, releasing a pocket of air around you and one other creature. There is enough air here that both you and the other creature can breath fresh air for one round. Whenever the air is released, it will push away any foul air or air of ill effects, such as the cloudkill spell. At higher levels: When you cast this spell at 2nd level or higher, there is additional fresh air allowing one other creature to breathe for every spell slot above 1st.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "S, M (sprinkle of water)",
        "spell_duration": "Concentration, up to 1 minute.",
        "spell_level": 0,
        "spell_name": "Cryo Caltrops",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou select an area within 30 feet of you that you can see. That point creates a mass of caltrops made of ice, extending in a 10 foot radius. Any creature that moves within the radius must make a Dexterity saving throw. On a failure, the creature takes 1d4 cold damage and has their movement slowed by 10 feet. On a success, the creature takes no damage.\\n\tThis spell's damage increases by 1d4 when you reach 5th level (2d4), 11th level (3d4), and again at 17th level (4d4).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_level": 0,
        "spell_name": "Dark Radiance",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou become infused with false energy that seems harmless. You emit bright light for 20 feet and dim light for another 10 feet. Whenever you are hit by melee attack, the creature that attacked you must make a Dexterity saving throw. On a failure, the creature takes 1d6 necrotic damage, and cannot recover hit points until the beginning of their next turn.\\n\tThis spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and again at 17th level (4d6).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "S, V",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_level": 0,
        "spell_name": "Death Gate",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou touch one creature that is dying. Once before the spell ends, if the target creature would be hit by an attack roll, you instead take the damage. The target creature does not fail any death saving throws from the attack. The spell then ends.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_level": 1,
        "spell_name": "Death Touch",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou point at a single creature, attempting to curse them with a quick death. If the target creature has hit points equal to or less than your total level, the creature reaches 0 hit points. If not, the creature must make a Wisdom saving throw. On a failure, the target creature takes 1d8 necrotic damage. On a success, the creature takes no damage.\\n\tAt higher levels: When you cast this spell at 2nd level or higher, you increase the damage by 1d8 per slot above 1st level.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "S",
        "spell_duration": "Instantaneous",
        "spell_level": 0,
        "spell_name": "Demise Dart",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou point at a creature, forming a dart of decay. Make a ranged spell attack against the target. On a hit, the target takes 1d8 necrotic damage.\\n\tThis spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and again at 17th level (4d8).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a length of rope that has been soaked in salt water)",
        "spell_duration": "Concentration, up to 10 minutes.",
        "spell_level": 4,
        "spell_name": "Dimensional Anchor",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou create a loop out of the rope used as a material component. Based off of the length of rope, you create a radius in which spells such as misty step automatically fail if their spell level is 4th level or lower. Spells of 5th level or higher must make a Wisdom saving throw. On a success, the spell works. On a failure, the spell does not work and the creature takes 2d10 force damage and 2d10 psychic damage. The rope cannot be destroyed or moved unless by yourself or friendly creatures that you choose.\\n",
        "spell_time": "1 minute"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute.",
        "spell_id": 1362,
        "spell_level": 2,
        "spell_name": "Disarm",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou point at a single creature, attempting to persuade a hostile target to drop their weapon. Select one creature. That creature must make a Charisma saving throw. On a failure, the creature follows your orders, becoming disarmed. A hostile creature has advantage on the saving throw. Once the spell ends, the creature knows that you used this spell, and may react appropriately.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a Chrysoberyl gem worth 100 gp)",
        "spell_duration": "Concentration, up to 1 minute.",
        "spell_level": 3,
        "spell_name": "Drill",
        "spell_range": "10 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou select a mass of rock or some sort of stone. An arcane beam forms from your chest, drilling and burrowing into the stone at a rate of 5 feet per round.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "S",
        "spell_duration": "Concentration, up to 1 minute.",
        "spell_level": 0,
        "spell_name": "Earth Trap",
        "spell_range": "90 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tThe soil twists as structures of rock trap the feet of your enemy. You select a single target within range that you can see and is not incorporeal. The selected creature must make a Strength saving throw. On a failure, the creature is restrained. The creature may repeat the saving throw at the beginning of its turn.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a pair of silver rings worth at least 100 gp)",
        "spell_duration": "Concentration, up to 10 minutes.",
        "spell_level": 4,
        "spell_name": "Enhance Capability",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou grant temporary enhancements to a willing creature that you touch, placing a ring on their finger. Select an ability score, such as Strength or Intelligence. That creature applies a bonus to the selected ability score equal to your spellcasting ability modifier. This bonus lasts for the spell duration.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "S, V",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_level": 0,
        "spell_name": "Excitement of Battle",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Divination",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one attack roll of its choice. It can roll the die before or after making the attack roll. The spell then ends.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "S, V, M (a pinch of powdered silver or holy water, a strip of cloth written with fine ink that has been blessed)\\n    ",
        "spell_duration": "1 minute",
        "spell_level": 0,
        "spell_name": "Exile Circle",
        "spell_range": "10 feet",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou create a small area that harms certain creatures whenever they enter it. Select an area within range. You manifest a magical barrier, taking the form of a 5-foot wide, and 10-foot tall cylinder, centered on that point. Choose only one of the following types of creatures: celestials, elementals, fey, fiends, or undead. Whenever a creature of the selected type enters the area for the first time, the creature must make a Wisdom saving throw. On a failure, the creature takes either 1d6 radiant, necrotic, force, or psychic damage. Then the spell ends.\\n\tThis spell can affect an additional creature without ending when you reach 5th level (2), 11th level (3), and 17th level (4).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "S",
        "spell_duration": "Concentration, up to 1 minute.",
        "spell_level": 0,
        "spell_name": "Expiry Sight",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Divination",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou imbue a willing creature with the foresight of their death. Whenever the target creature makes a death saving throw, the creature can add their proficiency bonus to the roll. Once they do, the spell ends.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute.",
        "spell_level": 2,
        "spell_name": "Eyes of Fate",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Divination",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou gain access from your divine being, in which you gain insight on people's true intentions and their emotions. For the duration, if you roll lower that a 10 on Wisdom (Insight) checks, you can treat it as rolling a 10.\\n",
        "spell_time": "1 minute"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute.",
        "spell_level": 1,
        "spell_name": "Fighting Words",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou shout at a single target, provoking a fight. Select a target creature within range. The creature must make a Charisma saving throw. On a failure, the creature must spend its movement to reach you and its actions to attack you with non-lethal damage. On a success, the creature ignores you. If the creature cannot hear you or does not share a similar language, the creature automatically succeeds.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (sprinkle of silver powder)",
        "spell_duration": "Instantaneous",
        "spell_level": 0,
        "spell_name": "Find Foe",
        "spell_range": "100 foot radius",
        "spell_ritual": null,
        "spell_school": "Divination",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou concentrate on a single type of creature, trying to determine its location. Choose from the following types of creatures: aberration, beast, construct, fey, fiend, humanoid (one specific, such as elf or human), plant, or undead. One of the creatures of that type must make a Wisdom saving throw. On a fail, you locate one of the creatures you choose as long as it within the radius. You cannot pick a specific person, such as Mindartis the Mad. You know how close they are to you and which direction they are moving, if they are.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 1457,
        "spell_level": 0,
        "spell_name": "Flame Cluster",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou create a flame that float softly around you. Whenever a creature starts their turn or enters a space within 5 feet of you, that creature must make a Dexterity saving throw. On a failed save, the creature takes 1d6 fire damage. Once the creature has taken damage, the flame is extinguished.\\n\tThe amount of flames that are created increases by 1 when you reach 5th level (2), 11th level (3) and again at 17th level (4).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "S",
        "spell_duration": "Instantaneous",
        "spell_id": 1461,
        "spell_level": 0,
        "spell_name": "Flash",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tIn a blinding flash, the vision of your foes becomes distorted. One creature within 5 feet of you must make a Constitution saving throw. On a failure, they become stunned until the beginning of their next turn.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a pair of chrysoprase gems worth 10 gp each)",
        "spell_duration": "Instantaneous",
        "spell_id": 1465,
        "spell_level": 3,
        "spell_name": "Flourish",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou wave your hand over an empty, barren field. As you do so, plant life sprouts and develops into fully grown plants, bearing fruit. You get to choose the plant type, as long as the plant is not magical, is not an incredibly rare plant, and as long as the plant is natively grown in the area.\\n",
        "spell_time": "1 minute"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a sapphire and ruby gem, each worth at least 50 gp)",
        "spell_duration": "Instantaneous",
        "spell_id": 1478,
        "spell_level": 3,
        "spell_name": "Frozen Fire",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tA small gem of blue ice forms in your hand which does not melt, with a small flickering flame that emits light but no heat. When you say the command word of your choice, the ice melts and the fire expands into a 10 foot radius. Any creature in the radius must make a Dexterity saving throw. On a failure, the creature takes 4d6 cold damage and 4d6 fire damage. On a success, the creature takes half damage.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a finger nail of someone deceased)",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 1487,
        "spell_level": 2,
        "spell_name": "Ghoulish Touch",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou scratch a creature with a finger nail, bestowing the ghoulish curse of paralysis. Make a melee spell attack. The target creature must make a Constitution saving throw on a hit. On a failure, the creature becomes paralyzed for the duration of the spell. Constructs and undead creatures automatically succeed on the saving throw. The paralyzed creature can repeat its saving throw at the start of its turn. If a creature is within 5 feet of the paralyzed creature, they must also succeed on a Constitution saving throw. On a failure, the creature becomes poisoned for 1d4 hours from the awful stench from the paralyzed creature, mimicking a ghoul.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a single grape that you smash)",
        "spell_duration": "Concentration, up to 1 minute.",
        "spell_id": 1540,
        "spell_level": 1,
        "spell_name": "Headache",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tSelect one creature that you can see within range. That creature must make a Wisdom saving throw. On a failure, the creature takes 1d6 psychic damage, along with the stunned condition. On a success, the creature takes only half damage. The creature can repeat the saving throw at the end of its turn. A creature that succeeds on its saving throw cannot be affected by this spell for the next 24 hours.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (ash of a burned oak leaf)",
        "spell_duration": "Concentration, up to 1 hour.",
        "spell_id": 1566,
        "spell_level": 1,
        "spell_name": "Hush",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou touch one willing creature. For the duration of this spell, the creature has a +5 bonus to their Dexterity (Stealth) checks.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1568,
        "spell_level": 0,
        "spell_name": "Ice Formation",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tA small wall made of ice forms in a place of your choice. This wall is 5 feet wide, a foot thick, and 3 feet tall. The ice must be formed in an area that has at least five feet of water, being either a lake, a puddle or have a source of water. A creature on one side of the wall has half-cover. The wall can be destroyed with any source of fire damage or bludgeoning damage.\\n",
        "spell_time": "1 round"
    }, {
        "spell_classes": "None",
        "spell_components": "S, M (an arrow or bolt)",
        "spell_duration": "Instantaneous",
        "spell_id": 1615,
        "spell_level": 0,
        "spell_name": "Launch Missle",
        "spell_range": "120 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tIn a swift action, you send a missile flying through the air at a target. Make a ranged spell attack towards one creature. On a hit, the creature takes 1d6 piercing damage.\\n\tThe amount of missiles you can fire increases by 1 when you reach 5th level (2), 11th (3), and again at 17th level (4). You must make a separate ranged spell attack for each missile, providing the material components of each.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a single iron nail)",
        "spell_duration": "Concentration, up to 1 minute.",
        "spell_id": 1620,
        "spell_level": 1,
        "spell_name": "Lethality",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tSelect two weapons that deal only nonlethal damage. For the duration, those weapons deal only lethal damage. In addition, you can select two improvised weapons. For the duration of this spell, these two weapons deal 1d6 damage instead.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 10 minutes",
        "spell_id": 1625,
        "spell_level": 0,
        "spell_name": "Light Disguise",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Illusion",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou touch a fabric, small item or a willing humanoid and change the color of the target for the duration of the spell. You can select a specific color or an array of patterns.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 10 minutes",
        "spell_id": 1646,
        "spell_level": 0,
        "spell_name": "Magic Manacles",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou touch a target creature's wrist to bind them. The target creature must make a Dexterity saving throw. On a failure, the creature is bound at the wrists with magical manacles. The creature can attempt to escape with another Dexterity saving throw. A creature can choose to fail the saving throw. If a creature is restrained, the saving throw is at disadvantage, and if a creature is incapacitated, the saving throw automatically fails.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 1651,
        "spell_level": 1,
        "spell_name": "Magnesis",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou select one object made of either mostly metal or fully metal. You can move that object, including in the air, for the duration of this spell. The object has a movement speed of 15 feet.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a bloodied bandage)",
        "spell_duration": "Instantaneous",
        "spell_id": 1653,
        "spell_level": 3,
        "spell_name": "Malpractice",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou know when a healing spell is being cast and have studied on ways to prevent the wonderous healing. Whenever a healing spell is cast, you select the creature that is casting the spell. The target creature must make a Wisdom saving throw. On a failure, the healing spell inflicts damage, equal to the hit points that would have been restored from the spell. On a success, the healing spell only heals half the total hit points.\\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a single orange that you smash)",
        "spell_duration": "Concentration, up to 1 minute.",
        "spell_id": 1682,
        "spell_level": 3,
        "spell_name": "Migraine",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tSelect one creature that you can see within range. That creature must make a Wisdom saving throw. On a failure, the creature takes 4d10 psychic damage, along with the blinded condition. On a success, the creature takes only half damage. The creature can repeat the saving throw at the end of its turn. A creature that succeeds on its saving throw cannot be affected by this spell for the next 24 hours.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "S, V",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 1728,
        "spell_level": 0,
        "spell_name": "Passing Ward",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou touch one creature that is dying. Once before the spell ends, the creature may choose to roll a successful death saving throw. This may happen before or after the death saving throw is rolled, but before the result is declared a success or failure. The spell then ends.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "S, V",
        "spell_duration": "Instantaneous",
        "spell_id": 1733,
        "spell_level": 0,
        "spell_name": "Perplex",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Illusion",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou unleash a colorful mass of lights, laced with subtle illusions at a creature you can see within range. If the target can see the attack, it must succeed on an Intelligence saving throw or take 1d4 psychic damage and have disadvantage on the next saving throw it makes before the end of its next turn.\\n\tThis spell's damage increases by 1d4 when you reach 5th level (2d4), 11th level (3d4), and 17th level (4d4).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1740,
        "spell_level": 0,
        "spell_name": "Pious Strike",
        "spell_range": "120 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tIn an instant, your strikes become imbued with radiant energy, which shine out in beams. Make a ranged spell attack. On a hit, you deal 1d8 radiant damage. The beams emit 10 feet of bright light, and an additional 10 feet of dim light.\\n\tThe amount of damage increases by 1d8 when you reach 5th level (2d8), 11th (3d8), and again at 17th level (4d8).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "S",
        "spell_duration": "Instantaneous",
        "spell_id": 1775,
        "spell_level": 3,
        "spell_name": "Psyche",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou attempt to drain the mental fortitude from a creature to cause fear. Select a target creature within 5 feet of you. The selected creature must make an Intelligence saving throw. On a failure, the creature has a 1d4 Intelligence reduction and takes 4d8 psychic damage. On a success, the creature on takes half damage and no Intelligence reduction. If this spell is used on a creature that has an Intelligence lower than 6, this spell automatically fails.\\n\tAt higher levels: When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 for each slot above 3rd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1777,
        "spell_level": 0,
        "spell_name": "Psychic Howl",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tIn a moment, you change the winds around a point of your choice, for a 10 foot radius. All creatures in the radius must make an Intelligence saving throw. On a failure, the creature takes 1d6 psychic damage. On a success, the creatures take half of the damage.\\n\tThe amount of damage increases by 1d6 when you reach 5th level (2d6), 11th (3d6), and again at 17th level (4d6).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a vial of water)",
        "spell_duration": "Instantaneous",
        "spell_id": 1784,
        "spell_level": 3,
        "spell_name": "Quench",
        "spell_range": "120 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou select a point within range. Every nonmagical flame within 30 feet of that point becomes extinguished as a breeze of frost cools everything. If there is a magical flame within the radius, you must make an Intelligence (Arcana) check, with the DC equal to 10 + the spell level. On a success, the magical fire is also put out. Every creature within this radius must also make a Dexterity saving throw. On a failure, the creature takes 6d6 cold damage and their movement is slowed by 10 feet until the end of their next turn. On a success, they only take half damage. Fire elementals or similar creatures make this save at disadvantage.\\n\tAt higher levels: When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 and the radius increases by 5' for each slot above 3rd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a pinch of dust)",
        "spell_duration": "1 minute",
        "spell_id": 1785,
        "spell_level": 2,
        "spell_name": "Quicksand",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou select a point of dirt, sand or stone within range. That point becomes the center of a 10 foot radius, which turns into quicksand. Quicksand is considered difficult terrain for movement. Whenever a creature ends its turn in quicksand, the creature must make a Strength saving throw. On a failure, the creature is restrained. On a success, the creature is freed. If a creature is restrained in quicksand, they can attempt to make a Strength (Athletics) check against your spell save DC to free themselves.\\n\tAt higher levels: When you cast this spell using a spell slot of 4th level or higher, the radius increases by 5' for each slot above 2nd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1793,
        "spell_level": 1,
        "spell_name": "Ray of Light",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou fire a beam of light at a target creature. Make a ranged spell attack. On a hit, the creature takes 2d8 radiant damage.\\n\tAt higher levels: When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot above 1st.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a vial of adhesive, a metal nail and a foot of hempen rope)",
        "spell_duration": "Instantaneous",
        "spell_id": 1802,
        "spell_level": 3,
        "spell_name": "Renovate",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYour ability to magical repair objects enhances, fixing objects that seem beyond repair. You can repair a 10 foot cube worth of objects by casting this spell. As long as the atoms that made up the object are there, such as ashes of burned wood, the object is repaired. Included in this is constructs, but not magical items. If this spell is used on a construct, the construct recovers hit points equal to 2d8 + your spellcasting ability modifier.\\n\tAt higher levels: When you cast this spell using a spell slot of 4th level or higher, the amount of hit points a construct can recover increases by 1d8 for each slot above 3rd.\\n",
        "spell_time": "1 minute"
    }, {
        "spell_classes": "None",
        "spell_components": "S, V",
        "spell_duration": "Instantaneous",
        "spell_id": 1832,
        "spell_level": 0,
        "spell_name": "Semblance",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Illusion",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou create the illusion of another Level: 0 of your choice towards a creature. Make a ranged spell attack against the target. On a hit, the target takes 1d8 psychic damage.\\n\tThis spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a pendant with 5 rivets in it)",
        "spell_duration": "Instantaneous",
        "spell_id": 1852,
        "spell_level": 3,
        "spell_name": "Shield of Salazar",
        "spell_range": "150 feet",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tAs a reaction to an area of effect spell that you can see, you wave your arms in a cubic pattern, creating a barrier of protection. Select an area within range. Each creature within a 10-foot cube centered on that point, including creatures that are hostile to you, have the benefits of this spell. If a creature inside of this area is subjected to an effect that allows them to make a Dexterity saving throw to only take half damage, they instead take no damage on a success, and only half damage if they fail.\\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a single metal rod)",
        "spell_duration": "Concentration, up to 10 minutes.",
        "spell_id": 1854,
        "spell_level": 3,
        "spell_name": "Shocking Boom",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou radiate a field of twisting, semi-transparent gray matter around you, that sparks out at anything nearby. Whenever you get hit by a melee attack, the attacking creature must make a Dexterity saving throw. On a failure, the creature takes 3d6 lightning and 3d6 thunder damage. On a success, the creature takes half damage.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1882,
        "spell_level": 0,
        "spell_name": "Spectral Shield",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou increase your AC by 1 until the beginning of your next turn. If the attack would not hit due to your increased armor class, the attack misses. In addition, if you are the target of magic missile, the attack automatically misses.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (a precious gem worth 500 gp or more)",
        "spell_duration": "Up to 24 hours",
        "spell_id": 1886,
        "spell_level": 4,
        "spell_name": "Spell Storage",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou imbue a spell of 3rd level or higher that you have prepared into a gem for later use. You can pass this object to a different creature, in which case allows the creature to activate the spell. If the spell has a point of origin, the origin is the gem itself. If the spell requires a saving throw, the DC is your own spell save DC. The spell casted is equal to the base spell level. If the spell requires concentration, the gem itself maintains concentration. If the spell is not used within 24 hours, the spell magic disipates, unless you spend another spell slot to restore that magic to it. After one use, the gem cannot cast another spell until another spell is stored in it. This gem can only contain one spell at a time, and attempting to store another will remove the first spell.\\n",
        "spell_time": "10 minutes"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S, M (tongue of a squirrel)",
        "spell_duration": "Instantaneous",
        "spell_id": 1897,
        "spell_level": 3,
        "spell_name": "Spite",
        "spell_range": "90 feet",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYour emotions take the better of you, filled with hatred and spite. Select a single target creature. Until the spell ends, whenever you deal damage to the creature that does not require a saving throw, you deal an additional 2d8 necrotic damage. In addition, declare one ability of your choice. The target creature automatically fails all skill checks with the associated ability, and has disadvantage on saving throws of the chosen ability score. If the target creature drops to 0 hit points, the spell ends. A remove curse spell cast on the target ends the spell early.\\n\tAt higher levels: When you cast this spell using a spell slot of 4th level or higher, the amount of abilities that you can declare increases by 1 for each slot above 3rd.\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1915,
        "spell_level": 0,
        "spell_name": "Stun",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou select a creature that you can see within range. The target creature must make a Wisdom saving throw. On a failure, the creature is incapacitated until the end of your next turn. If the creature is hostile, the target creature has advantage on the saving throw.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1936,
        "spell_level": 0,
        "spell_name": "Temporal Shift",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou begin to blink in and out of existence momentarily. As a action, any one attack of your choice automatically misses you until the beginning of your next turn. If the attack is a natural 20, you cannot select that attack to miss. You reappear at the beginning of your turn.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1961,
        "spell_level": 0,
        "spell_name": "Toxin",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYour mouth opens, spraying a toxin all over a single creature within range. The creature must make a Constitution saving throw. On a failure, the creature has the poisoned condition for 1d4 hours. The creature can repeat the saving throw at the start of every hour.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 1981,
        "spell_level": 0,
        "spell_name": "Unknown Energy",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou point you finger at a single target, and the creature's body or mind starts to feel an unwelcome pressure. Make a range spell attack. On a hit, you deal either 1d8 psychic or 1d8 force damage of your choice.\\n\tThe amount of damage increases by 1d8 when you reach 5th level (2d8), 11th (3d8), and again at 17th level (4d8).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2024,
        "spell_level": 2,
        "spell_name": "Wither",
        "spell_range": "120 feet",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou create multiple balls of necrotic energy. Make three range spell attacks, which can be divided however you like. On a hit, the creature takes 2d8 necrotic damage, and cannot recover hit points until the beginning of your next turn.\\n\tAt higher levels: When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot above 2nd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "None",
        "spell_components": "S, V",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2031,
        "spell_level": 0,
        "spell_name": "Yawn",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Balasars Guide",
        "spell_text": "\tYou yawn loudly towards one creature, making them drowsy. Choose one creature within range. A target creature must make a Wisdom saving throw. On a failure, the creature has disadvantage on saving throws to maintain concentration until the spell ends. If the creature takes damage or spends their action to make themselves alert, the spell ends.\\n",
        "spell_time": "1 action"
    }
]
