[{
        "spell_classes": "Cleric, Paladin, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Up to 1 minute",
        "spell_id": 2040,
        "spell_level": 3,
        "spell_name": "Absorbing Ward",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou use your reaction to create a protective ward that has 18 hit points. When you take any single source of damage, this ward will protect you by absorbing up to its total hit points of damage. On your next attack, you are able to release the energy force absorbed by the ward, adding the amount of damage to your next attack damage.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 4th level or higher, the ward gains 6 hit points for every slot level above 3rd.\\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 10 minutes",
        "spell_id": 2041,
        "spell_level": 7,
        "spell_name": "Acid Rain",
        "spell_range": "120 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou create gloomy storm clouds 40 feet above the ground, creating a mixture of dense fog and pouring acidic rain in a 15-foot-radius, 40-foot-high cylinder centered on a point within range. Until the spell ends, dim light fills the cylinder. The cylinder spreads around corners. Its area is heavily obscured and acts as difficult terrain. A creature that enters the fog or starts its turn there must make a Constitution saving throw. The creature takes 8d10 acid damage on a failed save, or half on a success. Additionally, metal items exposed to the rain might be destroyed. For magical weapons, armor, and objects, roll a d6. Uncommon items are destroyed on a 3 or lower. Rare items are destroyed on a 2 or lower. Very Rare items are destroyed on a 1. Legendary items are unaffected. Nonmagical metal weapons, armor, and objects are destroyed immediately when they are exposed to the rain. At Higher Levels: If you cast this spell using a spell slot of 8th level or higher, the Duration is 8 hours. If you use a 9th level spell slot, the spell lasts until you dismiss it as a bonus action. Using a spell slot of 8th level or higher grants a duration that doesn't require concentration.\r\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Druid, Wizard",
        "spell_components": "V, S, M (a piece of food)",
        "spell_duration": "Up to 1 hour",
        "spell_id": 2044,
        "spell_level": 1,
        "spell_name": "Acrid Delight",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Divination",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a piece of food (weighing up to 5 lbs), rotting it from the inside, but maintaining its original taste, texture, appearance and smell. If the piece of food is then eaten by a creature within one hour, the creature must make a Constitution saving throw or take 2d8 poison damage and become poisoned until it completes a long rest. On a successful save the creature takes half the damage and is not poisoned. If the food is not eaten within one hour, it succumbs to its rotten nature and spoils.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each spell slot level above 1st.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Wizard",
        "spell_components": "V, S",
        "spell_duration": "Up to 1 hour",
        "spell_id": 2049,
        "spell_level": 1,
        "spell_name": "Alacritous Interpretation",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tFor the duration, you gain the ability to read nonmagical texts at a rate of 50 pages per minute and have perfect recollection of any information gained during the spell’s duration.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S, M (a vial of ooze)",
        "spell_duration": "Concentration, up to 1 hour",
        "spell_id": 2051,
        "spell_level": 8,
        "spell_name": "Alluvial Pool",
        "spell_range": "90 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tThick ooze fills an area of the ground you choose within range. The area by default is a 50-foot square, but its dimensions may be whatever you wish, provided it is one continuous pool and the total surface area does not exceed 2500 square feet. The resulting pool has a depth of 10 feet and is difficult terrain. The area looks like a shallow pool of water at first glance, and any creature that was not aware of the spell being cast must make an Intelligence (Investigation) or Wisdom (Perception) check against your spell DC to believe otherwise before contact is made with the pool. A creature entering the pool for the first time on a turn or starting its turn there must make a Dexterity saving throw, taking 4d6 acid damage on a failed save and sinking into the pool, as the grappled condition. On a successful save, the creature takes half as much acid damage and is not grappled. A grappled creature can use its action to make a Strength (Athletics) or Dexterity (Acrobatics) check (its choice) against your spell save DC. On a success, it frees itself. A creature of size Large or smaller that fails the saving throw while already grappled by the pool is also restrained against your spell save DC. A restrained creature can't breathe, and any nonmagical metal objects it carries begin to corrode. When the restrained creature takes acid damage from the pool, non-magical metal weapons and armor take a permanent, cumulative -1 penalty to their damage rolls and AC, respectively. If this penalty on a weapon reaches -5, the weapon is destroyed; similarly, armor is destroyed if its AC is reduced to 10. Other metal objects take cumulative damage as well, as the pool eats through a 1-inchthickness of non-magical metal each round it is immersed.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric, Druid, Paladin",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2054,
        "spell_level": 3,
        "spell_name": "Ameliorate",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Divination",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tA creature you can see within range gains a number of temporary hit points equal to 2d6 + your spellcasting ability modifier. This effect happens every round at the start of your turn for the duration.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 4th level or higher, the temporary hit points given increase by 1d6 for each slot level above 3rd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 10 minutes",
        "spell_id": 2055,
        "spell_level": 2,
        "spell_name": "Amorphous Form",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Divination",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a creature with at least 1 hit point, transforming it into a gray ooze. An unwilling creature can make a Wisdom saving throw to avoid the effect. The transformation lasts for the duration, until the target drops to 0 Hit Points, or dies. The target's game Statistics, including mental Ability Scores, are replaced by the Statistics of a gray ooze. It retains its Alignment and personality. The target assumes the Hit Points of its new form. When it reverts to its normal form, the creature returns to the number of Hit Points it had before it transformed. If it reverts as a result of dropping to 0 Hit Points, any excess damage carries over to its normal form. As long as the excess damage doesn't reduce the creature's normal form to 0 Hit Points, it isn't knocked unconscious. The creature is limited in the actions it can perform by the nature of its new form, and it can't speak, cast spells, or take any other action that requires hands or speech. The target's gear melds into the new form. The creature can't activate, use, wield, or otherwise benefit from any of its equipment.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Up to 1 minute",
        "spell_id": 2056,
        "spell_level": 6,
        "spell_name": "Amplify Magic",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou use your bonus action to place a boon upon yourself, empowering the spells. While are under the effects of this spell, the next 3rd level spell that you cast using one of your available spell slots gains benefits as though it had been cast at 7th level.\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "Bard, Cleric, Druid, Ranger, Sorcerer",
        "spell_components": "V, S, M (1 ounce of blood)",
        "spell_duration": "Instantaneous",
        "spell_id": 2057,
        "spell_level": 2,
        "spell_name": "Analyze Blood",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou are able to learn a number of qualities from one ounce of fresh blood, as long as it has not existed outside its source for more than 24 hours. Roll a d4 and choose a number of qualities to learn from the list below, equal to the die score: • Learn the creature’s type • Learn the creature’s age (if applicable) • Learn the creature’s gender (if applicable) • Learn if the blood carries any traces of poison or disease • Learn if the creature is within 20 miles of your location • Learn if the creature is still on your plane of existence If you cast this spell using a spell slot, in addition to the information learned above, you will also see a brief glimpse of the moment right before the creature shed blood, from the perspective.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric, Druid",
        "spell_components": "V, S, M (Alexandrite dust worth at least 50 gp, which the spell consumes)",
        "spell_duration": "1 hour",
        "spell_id": 2058,
        "spell_level": 3,
        "spell_name": "Ancestral Guidance",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a willing creature and call upon the spirits of their ancestors to appear and offer guidance. The target may pick one language to become proficient in for the duration. Additionally, it gains double its proficiency bonus for ability checks it makes that use Intelligence and Wisdom until the spell ends.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Wizard",
        "spell_components": "V, S, M (a small cymbal or drum)",
        "spell_duration": "Concentration, up to 1 hour",
        "spell_id": 2067,
        "spell_level": 1,
        "spell_name": "Animate Percussion",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou may touch one percussion instrument that you possess, bringing it to life under your command for the duration. The instrument can only follow basic commands, such as playing a simple beat. As a bonus action, you can mentally command the instrument you made with this spell if it is within 30 feet of you. If you issue no commands, the instrument will idly play a rhythm that it has been used to play prior to becoming animated. Once given an order, the instrument continues to follow it until its task is complete.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2072,
        "spell_level": 6,
        "spell_name": "Apocalypse",
        "spell_range": "Self (30-foot radius)",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou cause demonic symbols to appear beneath the feet of every creature you choose within range. Each creature must make a Dexterity saving throw or take 3d8 fire damage and become stunned until the end of their next turn. The creatures take half damage and are not stunned on a successful save. Creatures gain no benefit from cover for this save.\r\n\tAt Higher Levels: When you cast this spell using a spell slot of 7th level or higher, the damage increases by 1d8 for each slot level above 6th.\r\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Cleric, Druid, Warlock, Wizard",
        "spell_components": "V, S, M (a pinch of bone dust)",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2085,
        "spell_level": 5,
        "spell_name": "Armor of Bones",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou encase the armor of a willing creature that you can see within range in solid bone. While not impervious to degradation, this bone armor will grant the target a +3 bonus to AC for the duration. Additionally, every time a creature within 5 feet lands a successful attack against the target, the attacker takes 3d6 piercing damage as bone shrapnel chips off and flies at the assailant.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid",
        "spell_components": "V, S",
        "spell_duration": "Up to 24 hours",
        "spell_id": 2086,
        "spell_level": 8,
        "spell_name": "Armor of Irritants",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tOne hundred tiny insects cover your body and grant you 100 temporary hit points. Also, you are immune to poisons and diseases for the duration. You gain additional effects depending on how many temporary hit points are remaining: • 75 or more. You have three-quarters cover. • 45 or more. You have half cover. Additionally, once per round, if a single source of damage would remove more than 50 temporary hit points, you can use your reaction to impose disadvantage on the next attack against you. The spell lasts for the duration or when the temporary hit points are depleted, whichever happens first.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Cleric, Warlock, Wizard",
        "spell_components": "V, S, M (a handful of bone dust)",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2089,
        "spell_level": 4,
        "spell_name": "Army of the Dead",
        "spell_range": "45 feet",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tThis spell creates 2d4 undead servant skeletons. Choose piles of humanoid bones within range. Your spell imbues the targets with a foul mimicry of life, raising them as undead skeletons (the DM has the creature's game statistics). The skeletons act immediately after your turn on the initiative order. On each of your turns, you can use a bonus action to mentally command any creatures you made with this spell if the creature is within 60 feet of you (issuing the same command to each one). You decide what action the creatures will take and where they will move during their next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creatures only defend themselves against hostile creatures. Once given an order, the creatures continue to follow it until their task is complete. The creatures are under your control for 1 minute, after which point the spell ends and they collapse to the ground, lifeless.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 5th level or higher, you are able to add an addition 1d4 to the total number of skeletons raised by this spell for every slot higher than 4th level.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Cleric",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2090,
        "spell_level": 0,
        "spell_name": "Ascending Flame",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tA flame-like radiance burns a creature that you can see within range. The target must succeed on a Dexterity saving throw or take 1d6 radiant damage, granting you half of the damage dealt as temporary hit points. The target gains no benefit from cover for this saving throw.\\n\tThe spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Druid, Ranger, Sorcerer, Wizard",
        "spell_components": "V, M (a feather)",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2102,
        "spell_level": 2,
        "spell_name": "Avian Geyser",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Divination",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tA gust of wind begins to swirl around a place on the ground that you can see within range, culminating in power. After a brief moment, a wind geyser 10 feet in diameter and up to 60 feet tall abruptly shoots into the air. Any medium or smaller creature that steps into the geyser or is in its space when the geyser is created must make a Dexterity saving throw or be lifted into the air to the geyser’s peak. Large creatures make their Dexterity save with advantage, and huge or larger creatures are unaffected.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Wizard",
        "spell_components": "V, S",
        "spell_duration": "Up to 1 minute",
        "spell_id": 2108,
        "spell_level": 2,
        "spell_name": "Barricade",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou create a transparent vertical wall made of magical force (AC 25, 1 HP). The wall appears within range and lasts for the duration. You can make a straight wall up to 40 feet long, 40 feet high, and 5 feet thick. The wall provides full cover to creatures behind it and only creatures you allow can pass through it.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 24 hours",
        "spell_id": 2109,
        "spell_level": 6,
        "spell_name": "Battle Beetle",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou a summon fey spirit, which takes the form of a huge beetle that appears in unoccupied space that you can see within range. The beast is considered fey, and it disappears when it drops to 0 hit points or when the spell ends. The summoned creature is friendly to you and your companions. Roll initiative for the summoned creature, which has its own turns. It obeys any verbal commands that you issue to them (no action required by you). If you don’t issue any commands, it will defend itself from hostile creatures, but otherwise take no actions. The DM has the creatures’ game statistics (stats as a Mammoth but gains 30 ft. fly speed). Up to 5 creatures of medium size or smaller can mount the beetle at a time, but it only responds to commands given by you.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Sorcerer, Warlock",
        "spell_components": "V, S",
        "spell_duration": "1 round",
        "spell_id": 2113,
        "spell_level": 1,
        "spell_name": "Beguile",
        "spell_range": "120 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou point at a creature within range and suggest a short phrase of up to 5 words, forcing the target to make a Wisdom saving throw. On a failure, the creature is forced to shout the nearest approximation to the proffered phrase that exists in their native tongue. If the creature fails its saving throw by 5 or more, it can take no other actions during this round.\\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "Bard, Cleric",
        "spell_components": "V, S",
        "spell_duration": "Up to 1 minute",
        "spell_id": 2114,
        "spell_level": 0,
        "spell_name": "Benediction",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch one willing creature. The target gains a +1 bonus to AC for the next attack made against it, then the spell ends. This effect can only be active on one target at a time.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Wizard",
        "spell_components": "V, S, M (an item to serve as a receptacle, made of materials worth at least 1000gp per Hit Die of the target)",
        "spell_duration": "Until dispelled",
        "spell_id": 2118,
        "spell_level": 9,
        "spell_name": "Bixmodeus' Binding of Perduring Possession",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou embed the soul and personality of a willing target into an item. While affected by this spell, the target doesn't need to breathe, eat, or drink, and it doesn't age or die. It retains its senses. Divination spells can't locate or perceive the target. The target's perception of the vessel may vary and is chosen by the caster as they form a mental image of the target's place of voluntary imprisonment. The target will be able to verbally communicate with creatures outside of the vessel, and to communicate telepathically with creatures attuned to the item. While within the vessel, the target may summon any mundane items they desire. The item used as a vessel gains a magical aura about it and is inured to wear and damage. It also has advantage on saving throws against spells and other magical effects, and resistant to damage originating from such. The item uses the statistics of the bound creature for saving throws, and the maximum value of the bound creature's Hit Dice (including its Constitution modifier) for determining the item's HP. Its AC is 25, and any damage to it is repaired at a rate of 5 HP per round. Ending the Spell: The spell may be ended through a ceremonial ritual where diamonds worth at least 500gp per Hit Die of the bound target are fired in a brazier for 24 hours, stoked and fueled with rare herbs native to the target's place of birth. The item must be laid upon the diamonds for the duration of the ceremony, and the true name of the target chanted at its zenith. Performing this ritual will expunge the target's soul from the item, releasing it to its expected destination upon death, and destroying the possessed item along with all resources used in the ritual. A Dispel Magic spell can end the spell only if it is cast as a Level: 9 spell, targeting the item.\\n",
        "spell_time": "1 hour"
    }, {
        "spell_classes": "Sorcerer, Warlock",
        "spell_components": "V, S",
        "spell_duration": "1 minute",
        "spell_id": 2131,
        "spell_level": 0,
        "spell_name": "Blood Dagger",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tAs a bonus action on your turn, you are able to create a weapon from the very life-force that sustains you. Casting this spell causes you to immediately take 1d6 psychic damage, as a small blade that resembles a dagger made of flowing blood appears clutched in your hand. Attacks with this weapon use your spellcasting modifier for attack rolls and deal 1d4 slashing damage. Attacks from this weapon are also considered magical and you cannot be disarmed. You can dismiss the dagger as a bonus action. The spell ends if you recast this spell.\\n\tThe damage dealt by this weapon increases by 1d4 at 5th level (2d4), 11th level (3d4), and 17th level (4d4).\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2133,
        "spell_level": 0,
        "spell_name": "Blood Siphon",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou point at a target with the tip of your finger and attempt to siphon their life force to strengthen your own. Make a melee spell attack against a target, with a successful attack dealing 1d4 necrotic damage and you gain half the damage dealt as temporary hit points.\\n\tThe spell's damage increases by 1d4 when you reach 5th level (2d4), 11th level (3d4), and 17th level (4d4).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Paladin",
        "spell_components": "S",
        "spell_duration": "Instantaneous",
        "spell_id": 2134,
        "spell_level": 5,
        "spell_name": "Blood of the Martyr",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tWhen you receive damage from a melee attack from a creature that is within 5 feet of you, you can choose to take an additional 8d6 damage of that damage type. Upon doing so, you can then use your reaction to make a melee attack with advantage against the creature that just attacked you. If your attack is successful, you deal your normal weapon damage plus an additional 6d6 weapon damage.\\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "Cleric, Sorcerer, Warlock",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2135,
        "spell_level": 0,
        "spell_name": "Bloodlink",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch two willing creatures and form a brief magical link between them, causing one of the creatures that you select to lose 1d8 hit points and grant them to the other creature in the form of temporary hit points.\\n\tThis amount increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2139,
        "spell_level": 1,
        "spell_name": "Bone Storm",
        "spell_range": "Self (15-foot cone)",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou conjure shards of bone to shoot forth from your hand in a 15-foot cone in front of you. Creatures in the area must make a Dexterity saving throw or take 5d4 piercing damage.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the size of the cone increases by 5 feet for each spell slot level above 1st.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2142,
        "spell_level": 6,
        "spell_name": "Borrowed Time",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou open a rift and are able to reach through to borrow idle time from your future self. Once per round for 1d6+4 rounds, you may take an additional action or bonus action at the end of another creature's turn. Acting in this manner consumes your reaction. Once the spell ends, you are incapacitated for a number of rounds equal to the initial roll of 1d6.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S, M (Black sapphire dust worth 100 gp, which the spell consumes)",
        "spell_duration": "10 days",
        "spell_id": 2143,
        "spell_level": 6,
        "spell_name": "Bound into Obedience",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a creature that is unconscious and cause ethereal chains to bind the creature’s hands. If the target regains consciousness, it must succeed on a Wisdom saving throw at disadvantage or become charmed by you for the duration. While bound into your servitude in this manner, the target must obey your verbal commands to the best of its ability as your servant. The target will not willingly hurt itself. If you command the target to perform an action strongly opposed by its core values, or you or your companions take an action harmful to it, your DM might allow the creature to make another Wisdom saving throw to break its shackles and end this effect. When the spell ends, the creature is no longer bound to you as a servant and has full knowledge of the tasks you made it perform. A Remove Curse, Greater Restoration, or Wish spell also ends it.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric, Wizard",
        "spell_components": "V",
        "spell_duration": "Instantaneous",
        "spell_id": 2144,
        "spell_level": 4,
        "spell_name": "Boundary",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou create a small barrier of force to protect a creature you can see within range. The creature gains 25 + 1d10 worth of temporary hit points.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric, Druid, Paladin, Ranger",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2149,
        "spell_level": 4,
        "spell_name": "Brook Healing",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tA creature you touch regains a number of hit points equal to 8d8 + your spellcasting ability modifier. When healing a creature in this manner, you immediately take psychic damage equal to half the amount healed as psychic damage and must make a DC 15 Constitution saving throw or suffer 1 level of exhaustion.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 5th level or higher, the healing increases by 1d8 for each slot level above 4th.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Cleric, Paladin",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2158,
        "spell_level": 1,
        "spell_name": "Cauterizing Flame",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tA creature you touch regains a number of hit points equal to 2d10 + your spellcasting ability modifier. However, the creature can no longer regain hit points by any other means until it completes a short or long rest. This spell has no effect on undead or constructs.\\n\tAt Higher Levels: The healing increases by 1d10 for each slot level above 1st.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Warlock, Wizard",
        "spell_components": "V, S, M (1 ounce of vampire’s blood, which the spell consumes, and a chalice worth 2,500 gp)",
        "spell_duration": "Up to 24 hours",
        "spell_id": 2162,
        "spell_level": 8,
        "spell_name": "Chalice of the Night",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou assume the form of a vampire until the next dawn, or the spell’s duration, whichever happens first. You transform into an average vampire, one without any class levels or the Spellcasting trait. Your game statistics are replaced by the statistics of a vampire, though you retain your alignment and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of a vampire. If the vampire has the same proficiency as you and the bonus listed in its statistics is higher than yours, use the vampire’s bonus in place of yours. You can’t use any legendary actions or lair actions of the new form. As a vampire, you do not age. You assume the hit points and Hit Dice of the new form. When you revert to your normal form, you return to the number of hit points you had before you transformed. If you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. As long as the excess damage doesn’t reduce your normal form to 0 hit points, you aren’t knocked unconscious. You retain the benefit of any features from your class, race, or other source and can use them, provided that your vampiric form is physically capable of doing so. You can speak all of the languages you knew before the transformation. When you transform, you choose whether your equipment falls to the ground or is worn by your new form. Worn equipment functions as normal. The DM determines whether it is practical for the new form to wear a piece of equipment, based on the vampire’s shape and size compared to those of your original form. Your equipment doesn’t change shape or size to match the new form, and any equipment that the new form can’t wear must fall to the ground. During this spell’s duration, you cannot end the spell prematurely.\\n",
        "spell_time": "1 hour"
    }, {
        "spell_classes": "Bard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2163,
        "spell_level": 0,
        "spell_name": "Chant of Mastery",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a willing creature and sing a short phrase, warding the target against danger. The target gains advantage on its next saving throw if it is not already affected by your Bardic Inspiration ability.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer",
        "spell_components": "V, S",
        "spell_duration": "Up to 10 minutes",
        "spell_id": 2166,
        "spell_level": 5,
        "spell_name": "Chaotic Wellspring",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tSelect up to three creatures that you can see within range and force each of them to make a Wisdom saving throw. On a failed save, the creatures experience difficulty focusing on their spellcasting. The next time they cast a spell, they must immediately roll on the Wild Magic table.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Wizard",
        "spell_components": "V, S",
        "spell_duration": "1 hour",
        "spell_id": 2181,
        "spell_level": 5,
        "spell_name": "Cognition",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou are able to use your vast intellect to overcome obstacles that would otherwise seem impossible. For the duration, you are able to use your Intelligence modifier in place of Dexterity or Wisdom (your choice) for any saving throws or skill checks.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Wizard",
        "spell_components": "V, S",
        "spell_duration": "1 hour",
        "spell_id": 2182,
        "spell_level": 2,
        "spell_name": "Cognizant",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a willing creature, allowing them to add their proficiency bonus to all initiative rolls and all Intelligence based skill checks for the duration. You can only have one instance of this spell active at a time.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 hour",
        "spell_id": 2206,
        "spell_level": 7,
        "spell_name": "Conjure Shambling Mound",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou call forth an shambling mound created from any vegetation around you. Choose an unoccupied area near a source of vegetation that you can see within range. A shambling mound will rise from the ground in this location. The mound disappears when it drops to 0 hit points. The mound is friendly to you and your companions for the duration. Roll initiative for the mound, which has its own turns. It obeys any verbal commands that you issue to it (no action required by you). If you don’t issue any commands to the mound, it defends itself from hostile creatures but otherwise takes no actions. If your concentration is broken before the spell’s duration is reached, you lose control of the mound and it becomes hostile toward you and your companions. A hostile shambling mound can’t be dismissed by you. It disappears when its hit points reach 0 or 1 hour after you summoned it, whichever happens first. The DM has the creature’s game statistics.\\n\tAt Higher Levels: When you cast this spell using a 9-th level spell slot, you summon two shambling mounds in unoccupied area that you can see.\\n",
        "spell_time": "1 minute"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S, M (a dragon scale and a jewel worth 10,000 gp, both of which the spell consumes)",
        "spell_duration": "Up to 8 hours",
        "spell_id": 2211,
        "spell_level": 7,
        "spell_name": "Conjure Wyrmling",
        "spell_range": "90 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou summon a dragon wyrmling of challenge rating 4 or lower, which appears in an unoccupied space that you can see within range. The color of dragon scale used in the casting determines the type of wyrmling summoned. The wyrmling disappears when it drops to 0 hit points or when the spell ends. The wyrmling is friendly to you and your companions for the duration. Roll initiative for the wyrmling, which has its own turns. It obeys any verbal commands that you issue to it (no action required by you), as long as they don’t violate its alignment. If you don’t issue any commands to the wyrmling, it defends itself from hostile creatures but otherwise takes no actions. The DM has the wyrmling's statistics. You can only have one wyrmling conjured at a time with this spell. Any additional castings of the spell within the duration will cause the prior wyrmling to cease existing or to extend the duration, depending on the scale used.\\n\tAt Higher Levels: When you cast this spell using an 8-th level spell slot, the duration is up to 24 hours. When using a 9-th level spell slot, the duration is a year and a day.\\n",
        "spell_time": "1 minute"
    }, {
        "spell_classes": "Warlock, Wizard",
        "spell_components": "V, S, M (a bit of phosphorus)",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2223,
        "spell_level": 0,
        "spell_name": "Corruption",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Illusion",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch the ground beneath your feet to imbue it with a faint necrotic energy. This energy glows with a green dim light in a 10-foot radius. As a bonus action on your turn, you can cause the energy to travel through the ground to a place you can see up to 30 feet away. Any creature other than yourself making an attack while standing on the corrupted ground does so with a -2 attack penalty.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric, Druid",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2225,
        "spell_level": 0,
        "spell_name": "Courage",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a willing creature and strengthen its resolve. Until the end of the creature’s next turn, it cannot be frightened. If the target is currently frightened, it can immediately reroll its saving throw.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Wizard",
        "spell_components": "V, S, M (a blank patch worth at least 10gp, an item and a robe of useful things with available space)",
        "spell_duration": "Instantaneous",
        "spell_id": 2231,
        "spell_level": 3,
        "spell_name": "Create Useful Robe Patch",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou compress a single mundane item onto a blank patch with the intention of attaching it to a Robe of Useful Items. The item you choose must be no larger than 30 feet in any dimension. The patch must then be sewn onto a Robe of Useful Items before it can be used.\\n\tAt Higher Levels: When casting this spell using a spell slot, you are able to fashion non-sentient magic items into patches depending on the spell slot used, as follows: 3rd level (common), 5th level (uncommon), 7th level (rare), and 9th level (very rare).\\n",
        "spell_time": "1 hour"
    }, {
        "spell_classes": "Warlock, Wizard",
        "spell_components": "V, S, M (severed hand of a creature)",
        "spell_duration": "Concentration, up to 1 hour",
        "spell_id": 2235,
        "spell_level": 1,
        "spell_name": "Creeping Crawling Claw",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tChoose the hand of a creature that has been severed from its body for longer than 24 hours and grant it sentience. For the duration of the spell, the creeping claw (MM pg.44) is under your control and can be commanded using your bonus action. The claw can only understand simple commands. If the hand's original owner is still alive, the claw will seek to reunite itself with its rightful owner when the spell ends. If its original owner is dead, the claw will wander off purposelessly. The claw is under your control for 1 hour, after which it stops obeying. To reassert control for another hour or to assert control over an existing crawling claw, you may cast this spell again.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2241,
        "spell_level": 1,
        "spell_name": "Cursed with Undeath",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch an unconscious living creature that has 0 hit points, placing a curse upon it. The curse remains until the creature either dies or is stabilized, whichever occurs first. If the creature dies while cursed, it is raised as a zombie under your control for 1 minute or until slain. If the creature is stabilized before it dies, the curse is removed with no ill effects. A remove curse spell ends either effect on a creature. This spell has no effect on undead or constructs.\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "Bard, Cleric, Druid, Wizard",
        "spell_components": "V, S",
        "spell_duration": "1 round",
        "spell_id": 2253,
        "spell_level": 0,
        "spell_name": "Dazzle",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou create a flash of blinding light directly in front of a creature that you can see within range. The target is subjected to a Dexterity saving throw. On a failure, it has disadvantage on its next attack, or grants advantage on the next attack made against it, whichever comes first. The target must originally be able to see in order to suffer these effects.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2259,
        "spell_level": 1,
        "spell_name": "Death's Grasp",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Divination",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tGrasping spectral hands sprout from the ground in a 10-foot square starting from a point within range. For the duration, these hands turn the ground in the area into difficult terrain. Creatures ending their turn in the area must succeed on a Dexterity saving throw or take 3d6 necrotic damage from the spectral hands.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2260,
        "spell_level": 5,
        "spell_name": "Defile",
        "spell_range": "Self (30-foot cone)",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tA wave of noxious energy flows out from your hands over the land, infecting everything in its path. Each creature you choose within a 30-foot cone must make a Constitution saving throw. The targets take 4d10 poison damage and become poisoned for 1 minute on a failed save, or half as much damage and are not poisoned on a successful one. Undead and Constructs automatically succeed on the save.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Cleric, Paladin",
        "spell_components": "V, S",
        "spell_duration": "Up to 10 minutes",
        "spell_id": 2266,
        "spell_level": 1,
        "spell_name": "Detect Chaos and Order",
        "spell_range": "Self (15-foot-radius sphere)",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tFor the duration, you are able to determine the nature of creatures within range in relation to how they conform to societal norms. Creatures will have auras about them relating to their alignment: • a jagged, chaotic aura for those with a tendency toward acting on their feelings and whims, regardless of society’s expectations • a muddled, neutral aura for those who balance their whims against the expectations of society, doing what they can within the confines of order • a crisp, lawful aura for those who follow the rules of society, often at the expense of their personal wishes\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric, Druid, Paladin, Ranger,",
        "spell_components": "V, S",
        "spell_duration": "Up to 10 minutes",
        "spell_id": 2268,
        "spell_level": 2,
        "spell_name": "Detect Familiar",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tSorcerer, Warlock, Wizard For the duration, you sense the presence of any creature that is currently serving as a familiar within 30 feet of you. If you sense a familiar in this way, you can use your action to see a faint aura around the creature. In addition, you are able to sense if its master is within 1 mile of your location and know their general direction. The spell can penetrate most barriers, but is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2275,
        "spell_level": 0,
        "spell_name": "Disarm",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tAs an action, choose a creature you can see within 60 feet. That creature must make a Strength saving throw with advantage or drop an object or weapon they are holding in their hand. This spell has no effect if they are holding the object with two hands. If they are holding two items (one in each hand), select which item they drop. If they fail the saving throw by a score of 5 or greater, the item flies out of their hand in a direction of your choosing, up to 10 feet away from their original location.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2281,
        "spell_level": 3,
        "spell_name": "Displacement",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tUsing your action, you are able to swap places with a creature you can see within range. If the target is hostile towards you, it can attempt a Charisma saving throw to resist the effect.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 4th level or higher, the range of the spell increases by 20 feet for each slot level above 3rd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard",
        "spell_components": "V or S, M (an instrument)",
        "spell_duration": "Instantaneous",
        "spell_id": 2284,
        "spell_level": 3,
        "spell_name": "Distressing Melody",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou select one creature within range and sing or play a song aimed at disrupting your target, causing them to make a Constitution saving throw vs your spellcasting DC or lose their focus, ending any concentration spell they currently are casting. If they lose concentration in this manner, they cannot cast a spell from the same school of magic until they complete a long rest.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Cleric, Paladin",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2286,
        "spell_level": 1,
        "spell_name": "Divine Arm",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYour deity imbues a melee weapon you currently possess with an essence of their power and launches it at a foe within 60 feet. Make a melee spell attack against a creature you can see within range. If successful, the target takes your weapon’s normal damage plus an additional 2d10 radiant or necrotic damage (your choice). The weapon breaks after it is used in this manner.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d10 for every 2 slot levels above 1st.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2294,
        "spell_level": 2,
        "spell_name": "Drain Life",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou can weaken one foe by lowering its maximum hit points. Choose one creature that you can see within range to make a Constitution saving throw. If it fails, 2d8 + your spell casting modifier worth of hit points are subtracted from its maximum until it completes a long rest. If this effect reduces the target’s total hit points to zero, it dies.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Warlock, Wizard",
        "spell_components": "V, S, M (petrified eye of a rabbit)",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2296,
        "spell_level": 1,
        "spell_name": "Dread",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou speak an augury against a creature that you can see within range, filling them with a sense of trepidation. On a failed Wisdom saving throw, the target suffers disadvantage on all attacks against you. Also, the target has disadvantage on Wisdom skill checks made for the duration. A remove curse spell cast on the target ends this spell early.\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "Bard, Paladin, Sorcerer",
        "spell_components": "V, S",
        "spell_duration": "Up to 1 minute",
        "spell_id": 2302,
        "spell_level": 2,
        "spell_name": "Druthers",
        "spell_range": "Self (30-foot radius)",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou make a simple request of up to 10 words, gaining a +5 bonus and advantage on Persuasion skill checks to all humanoids within 30 feet of you.\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "Bard, Cleric, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 hour",
        "spell_id": 2303,
        "spell_level": 4,
        "spell_name": "Dusk Arrows",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a quiver containing arrows or bolts. When a target is hit by a ranged weapon attack using a piece of ammunition drawn from the quiver, the target takes an extra 1d8 necrotic damage. The spell’s magic ends on the piece of ammunition when it hits or misses, and the spell ends when twelve pieces of ammunition have been drawn from the quiver. If a target dies as a result of your ranged attack while using this ammunition, its flesh melts away and it is raised as a skeleton under your control for 24 hours, after which it stops obeying any command you've given it. You may control a number of skeletons equal to your proficiency bonus at any time with this spell. On each of your turns, you can use a bonus action to mentally command a skeleton raised by a dusk arrow if it is within 60 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2309,
        "spell_level": 1,
        "spell_name": "Earthen Grip",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou target one creature you can see within range, causing them to make a Strength saving throw. On a failed save the target is restrained by dirt rising from the ground in the shape of a fist. The target may use its action to make a Strength saving throw, breaking free from the earth’s grasp on a successful save.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2310,
        "spell_level": 1,
        "spell_name": "Earthen Pillar",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou call forth a column of dirt to rise out of the ground in a space you can see within range. The pillar has a diameter of 5 feet, a height of up to 20 feet, an AC of 1 and 15 hit points. If the pillar is created under a creature, that creature must succeed on a Dexterity save or be lifted by the pillar. A creature can choose to fail the save. If a pillar is prevented from reaching its full height, a creature on the pillar takes 2d6 bludgeoning damage and is restrained. The restrained creature can use an action to make a strength or dexterity check (creature's choice) against the spell’s save DC. On a success, the creature is no longer restrained and must either move off the pillar or fall off it.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, you can increase the height of the pillar by 5 feet for each slot level above 1st.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2313,
        "spell_level": 0,
        "spell_name": "Eidolic Chains",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tA creature that you can see within range must succeed on a Strength (Athletics) or Dexterity (Acrobatics) skill check (target’s choice) vs your spell DC or become grappled by a set of ethereal chains you summon to bind your target. The target may attempt another skill check with advantage at the start of each of its turns. As a bonus action on your turn, you may move the grappled creature up to 10 feet in any direction you choose, as long as you can see the destination.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Druid, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2318,
        "spell_level": 4,
        "spell_name": "Embers",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou cause tiny burning embers to fall from the sky around you in a 30-foot radius. When you cast the spell, you must choose if you intend for the embers to help or hinder. • Help: The embers provide restorative powers to all creatures that you choose within range. Creatures that are currently unconscious gain advantage on all death saving throws until they complete a short rest or die, whichever comes first. Creatures that are conscious gain 3d6 temporary hit points • Hinder: The embers work to oppress your foes. All creatures that you choose within range must make a Dexterity saving throw or take 3d6 fire damage and have their movement speed halved until the end of their next turn. They take half damage on a successful saving throw and their move speed is unaffected.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 5th level or higher, the die increases by 1d6 on either effect for every slot level above 4th.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2367,
        "spell_level": 3,
        "spell_name": "Fire Whip",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou create a whip made of scorching flame and select one creature within range, with the intention of unbalancing it. The target must make a Dexterity saving throw. On a failed save, the target takes 5d8 fire damage and you choose to knock it prone or to pull it up to 30 feet closer to your location.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 and you can pull the target an additional 5 feet for each slot level above 3rd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Up to 1 minute",
        "spell_id": 2389,
        "spell_level": 3,
        "spell_name": "Frost Armor",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a willing creature, encasing them in a protective coating of ice. For the duration, they gain a +3 bonus to AC and become resistant to cold damage but suffer disadvantage on all Dexterity checks and saves for the duration. Every time they are hit by a melee weapon attack, their attacker takes 1d6 cold damage. Additionally, each time they are successfully attacked, the protection provided by frost armor wanes, reducing its armor class bonus by 1. After the AC bonus provided by the armor is reduced to 0, the armor shatters and the spell ends.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 and it gains a +1 bonus to AC for every three slots level above 3rd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Wizard",
        "spell_components": "V, S, M (a white dragon’s scale worth 450 gp)",
        "spell_duration": "Instantaneous",
        "spell_id": 2390,
        "spell_level": 5,
        "spell_name": "Frost Nova",
        "spell_range": "Self (20-foot radius)",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou invoke the arctic cold to freeze your foes. All creatures that you choose within 20 feet of you must succeed on a Dexterity saving throw or take 8d8 cold damage and suffer disadvantage on all Dexterity saving throws until the end of your next turn. On a successful save, the target takes half damage and does not suffer disadvantage on Dexterity saving throws.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 6th level or higher, the damage of this spell increases by 1d8 for each slot level above 5th.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Wizard",
        "spell_components": "V, S, M (An exquisite weapon rack, 10 feet wide by 6 feet tall, constructed from rare materials worth at least 6,000 gp, and a Tiny replica made from the same materials worth at least 60 gp)\\n    ",
        "spell_duration": "Instantaneous",
        "spell_id": 2393,
        "spell_level": 4,
        "spell_name": "Furtive Armory",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou hide a weapon rack, and all its contents, on the Ethereal Plane. You must touch the rack and the miniature replica that serves as a material component for the spell. The weapon rack can hold 15 pieces of adventuring gear, weapons or armor. While the weapon rack remains on the Ethereal Plane, you can use an action and touch the replica to recall the rack. It appears in an unoccupied space on the ground within 10 feet of you. You can send the weapon rack back to the Ethereal Plane by using an action and touching both the rack and the replica. After 60 days, there is a cumulative 5 percent chance per day that the spell’s effect ends. This effect ends if you cast this spell again, if the smaller replica rack is destroyed, or if you choose to end the spell as an action. If the spell ends and the larger weapon rack is on the Ethereal Plane, it is irretrievably lost.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "1 minute",
        "spell_id": 2394,
        "spell_level": 2,
        "spell_name": "Gale of Obscurity",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou summon a blizzard that obscures you from other creatures. For the duration, the gale provides you three-quarters cover, resistance to fire damage, and any creature that starts its turn or moves within 5 feet of you for the first time takes 1d6 cold damage. While the gale is active, you suffer disadvantage on all ranged weapon and spell attacks.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Cleric, Paladin",
        "spell_components": "V",
        "spell_duration": "Instantaneous",
        "spell_id": 2403,
        "spell_level": 4,
        "spell_name": "Gift of Vivacity",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou call upon your divine grace to bestow strength upon an ally at the expense of your own. Select a creature that you can see within range and grant them a number of temporary hit points equal to your maximum hit points, but you immediately take 4 levels of exhaustion.\\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "Druid, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2404,
        "spell_level": 2,
        "spell_name": "Glacious",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tThe ground freezes in a 10-foot-radius sphere centered on a point you choose within range. Any creature that starts its turn or moves into the area for the first time must make a Constitution saving throw or take 2d8 cold damage and gain one level of exhaustion. On a successful save, a creature takes half as much damage and does not suffer exhaustion. Creatures resistant or immune to cold damage automatically succeed on the saving throw.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric, Sorcerer, Wizard",
        "spell_components": "S",
        "spell_duration": "Instantaneous",
        "spell_id": 2406,
        "spell_level": 0,
        "spell_name": "Gleam",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou may use your reaction to cause your physical form to emit a bright flash of light. This flash will shed bright light in a 10-foot radius and dim light for an additional 10 feet, centered on yourself. Also, if you are currently being grappled by a creature, it takes 1d6 radiant damage and you may immediately attempt to escape the grapple by succeeding on a Strength (Athletics) or Dexterity (Acrobatics) check contested by the creature’s Strength (Athletics) check.\\n\tThe spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).\\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "Bard, Cleric, Druid, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Up to 10 minutes",
        "spell_id": 2412,
        "spell_level": 0,
        "spell_name": "Gloom",
        "spell_range": "Touch (20-foot sphere)",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch one object that is 5 feet or smaller in any single dimension. Until the spell ends, the object absorbs natural light in a 20-foot radius sphere. Within that sphere, Bright Light becomes Dim Light, Dim Light becomes Dark. The spell ends if you cast it again or dismiss it as an action.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric, Sorcerer, Wizard",
        "spell_components": "V, S, M (a small black disk)",
        "spell_duration": "1 hour",
        "spell_id": 2416,
        "spell_level": 6,
        "spell_name": "Grace of Shar",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tA creature you touch is blessed with a sliver of Shar's umbral omniscience. For the duration, they gain blindsight out to a range of 30 feet.\\n\tAt Higher Levels: When you cast this spell using a 9th level spell slot, you can select one additional creature.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S, M (a quarterstaff)",
        "spell_duration": "1 minute",
        "spell_id": 2426,
        "spell_level": 0,
        "spell_name": "Grim Scythe",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tFor the duration, you can use your spellcasting ability instead of Strength for two-handed melee attacks using a quarterstaff you touch. The weapon's damage die becomes a d10 and deals necrotic damage, as a spectral blade forms on the staff’s end. The weapon becomes magical if it isn't. The spell ends if you recast this spell or let go of the weapon.\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 10 minutes",
        "spell_id": 2427,
        "spell_level": 3,
        "spell_name": "Grimlore’s Affliction",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou harness necrotic energies and infuse them into your very being. For the next 10 minutes, every time you deal damage with an attack or spell attack to a creature, you deal an additional 1d12 necrotic damage and the creature must make a Wisdom saving throw or become frightened of you until the end of its next turn.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d12 for every two slot levels above 2nd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Up to 1 hour",
        "spell_id": 2428,
        "spell_level": 6,
        "spell_name": "Grimlore’s Aphotic Armor",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou pull forth shadows that reside in the deepest corners of the realm to shroud yourself. Upon casting this spell, you gain 3d12 + 12 temporary hit points. While you have these hit points, you receive half cover from melee attacks and spells and if you take damage from any source, your attacker must make a Wisdom saving throw or become frightened of you for 1 minute.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2429,
        "spell_level": 9,
        "spell_name": "Grimlore’s Calamity",
        "spell_range": "120 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou create a shadowy pool on a flat surface that you can see within range. The pool is 25 feet in diameter and connects your plane to the Shadowfell. A medium-sized spectral hand rises from the center of the pool and remains there for the duration of the spell. When a creature enters the pool for the first time on a turn or starts its turn there, the creature must succeed on a Constitution saving throw or takes 8d12 necrotic damage and becomes restrained. It takes half damage and is not restrained on a success. Any creature that begins their turn restrained while in the pool sinks to its bottom and is immediately teleported to the Plane of Shadow, becoming trapped there. Additionally, as a bonus action on each of your turns, you may command the spectral hand to beckon a creature within 60 feet. The target must make a Wisdom saving throw. If the creature fails its saving throw, it is charmed for 1 minute or until it takes any damage. A charmed creature must spend its turns trying to move as close to the spectral hand as it can. It also can't take reactions. For its action, it can use only the Dash action\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2430,
        "spell_level": 8,
        "spell_name": "Grimlore’s Crippling Incursion",
        "spell_range": "Self (30-foot cone)",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou point an outstretched hand with fingers spread and emanate a blanket of necrotic energy from your fingertips. Each creature that you choose in a 30-foot cone must make a Constitution saving throw. A creature takes 5d12 necrotic damage and suffers 2 levels of exhaustion on a failed save, as their bones become frail and strength leaves their body. On a successful save, they take half as much damage and do not become exhausted but become frightened of you until the end of their next turn.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Up to 1 minute",
        "spell_id": 2431,
        "spell_level": 7,
        "spell_name": "Grimlore’s Doom",
        "spell_range": "120 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou spit an oath at a creature within range, who must succeed on a Wisdom saving throw or take 5d12 necrotic damage. On a successful save, the creature takes half of the damage and is frightened of you until the end of your next turn. On a failed save, the creature is frightened of you, and is incapacitated. The creature also takes 2d12 necrotic damage at the end of each of its turns, after which it may make the saving throw again. On a success, the spell ends.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2432,
        "spell_level": 0,
        "spell_name": "Grimlore’s Influence",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tAny creatures of your choice that are within 30 feet and frightened of you take 1d6 psychic damage.\\n\tThis spell's damage increases by 1d6 and the range increases by 5 feet when you reach 5th level (2d6, 40 feet), 11th level (3d6, 50 feet), and 17th level (4d6, 60 feet).\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2433,
        "spell_level": 1,
        "spell_name": "Grimlore’s Shadowblight",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou hurl a ball of dark energy at a target within range. Make a ranged spell attack against the target. On a hit, the target takes 2d12 necrotic damage and must make a Wisdom saving throw or become frightened of you until the end of your next turn. At Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for every two slot levels above 1st.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2434,
        "spell_level": 2,
        "spell_name": "Grimlore’s Shadowgrasp",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou create a medium-sized hand made of shadow in an unoccupied space that you can see. It moves at your command, mimicking the movements of your own hand. The hand is an object that has AC 14, hit points equal to half your hit point maximum and a movement speed of 40 feet. If it drops to 0 hit points, the spell ends. The hand doesn't fill its space and remains under the effects of the blur spell while active. When you cast the spell, and as a bonus action on your turns, you can make a ranged spell attack against a creature within 5 feet of the hand, dealing 1d12 of necrotic damage. On a successful attack, the target must also make a Wisdom saving throw or be frightened of you. A frightened target can repeat the saving throw at the end of each of its turns, ending the frightened condition on itself on a success. If a target's saving throw is successful or the effect ends for it, the target is immune to being frightened by this spell for the next 24 hours.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, the damage dealt by the hand increases by 1d6 for every slot level above 2nd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2435,
        "spell_level": 5,
        "spell_name": "Grimlore’s Touch of Undeath",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a creature, causing it to make a Constitution saving throw. For the duration, the target becomes incapacitated on a failed saving throw or frightened of you on a success. The target can make a Constitution save at the end of its turns, removing the incapacitated effect, but becoming frightened for the remaining duration on a success. A remove curse spell ends this spell. Additionally, while incapacitated in this manner, the target begins to give off a toxic odor. Any creature that is within 5 feet of the target at the start of its turn must succeed on a Constitution saving throw or be poisoned until the end of its next turn. At Higher Levels: If you cast this spell using a spell slot of 6th level or higher, the duration is 8 hours. If you use a spell slot of 7th level or higher, the duration is 24 hours. If you use an 8th level spell slot, the spell lasts until dispelled. Using a spell slot of 6th level or higher grants a duration that doesn't require Concentration.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2436,
        "spell_level": 4,
        "spell_name": "Grimlore’s Withering Coils",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou create three spectral coils gleaming with green necrotic energy. Make a ranged spell attack against up to three separate targets within range, one for each coil. Each successful attack deals 3d12 necrotic damage and the target must succeed on a Wisdom saving throw or become frightened of you until the end of your next turn. If the target makes a successful saving throw, it cannot be frightened by this spell for 24 hours.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 5th level or higher, the damage of each coil increases by 1d12 for every two slot levels above 4th.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2443,
        "spell_level": 1,
        "spell_name": "Guillotine",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou extend your hand and touch a creature while muttering the passing prayer of an executioner. The creature must make a Strength saving throw or become restrained by a pair of ethereal chains that bind the target to the ground, and a large magical blade is summoned above their head. As a reaction, you are able to release the blade down upon your target’s neck, dealing 2d6 force damage. For every round that you do not release the blade with your reaction, it does an additional 2d6 damage as a blade ratchets another notch higher above the target. The target may use their action to attempt a Strength saving throw to break the chains at the start of each turn. This removes the restrained condition and ends the spell without doing any damage.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the initial damage increases by 1d6 for each slot level above 1st.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 10 minutes",
        "spell_id": 2448,
        "spell_level": 4,
        "spell_name": "Hallowing Curse",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a creature, and that creature must succeed on a Wisdom saving throw or become cursed for the duration of the spell. When you cast this spell, an ill omen is placed on the target, causing disadvantage on Strength and Constitution ability checks and saving throws for the duration. While cursed, the target gains 5d10 worth of negative temporary hit points. These negative temporary hit points must be healed through before a target’s normal hit points can be healed. While cursed, the target must make a Wisdom saving throw at the start of each of its turns. If it fails, it wastes its action that turn doing nothing. A remove curse spell ends this effect.\\n\tAt Higher Levels: If you cast this spell using a spell slot of 5th level or higher, the Duration is 8 hours. If you use a spell slot of 7th level or higher, the Duration is 24 hours. If you use a 9th level spell slot, the spell lasts until it is dispelled. Using a spell slot of 5th level or higher grants a Duration that doesn't require Concentration.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Ranger",
        "spell_components": "V, S",
        "spell_duration": "1 minute",
        "spell_id": 2457,
        "spell_level": 3,
        "spell_name": "Healing Leeches",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou summon two magical leeches that exist for the duration. They can be given to willing creatures and placed somewhere on their skin. While attached this way, they proceed to suck out all forms of nonmagical poison and toxins, rendering the creature immune to disease and poison effects for the duration. Additionally, the creature becomes resistant to poison damage for the duration.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid",
        "spell_components": "V, S, M (incense worth 50gp, which the spell consumes, and a bloodstone worth 300gp)",
        "spell_duration": "Up to 10 days",
        "spell_id": 2459,
        "spell_level": 4,
        "spell_name": "Healing Stone",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou infuse a bloodstone with restorative magics. As an action on your turn within the next 10 days, you can use the stone to heal yourself or a creature within 5 feet of you for 6d4 + 6 hit points, returning the stone to its non-magical state. You may only infuse one bloodstone with this magic at a time.\\n",
        "spell_time": "1 hour"
    }, {
        "spell_classes": "Druid, Ranger",
        "spell_components": "V, S, M (a piece of ivy)",
        "spell_duration": "Up to 24 hours",
        "spell_id": 2462,
        "spell_level": 5,
        "spell_name": "Hederan Embrace",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYour limbs grow like the woody vines of a hedera plant. For the duration, your melee attack range increases up to a maximum of 15 feet. Additionally, other creatures provoke an opportunity attack from you when they enter your reach.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S, M (a piece of coal)",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2463,
        "spell_level": 5,
        "spell_name": "Hellfire",
        "spell_range": "90 feet",
        "spell_ritual": null,
        "spell_school": "Divination",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tA fiery coal ignites in the palm of your hand. A creature that you can see within range must make a Dexterity saving throw, as the coal flies towards the target. On a failed save, the target takes 6d8 fire damage initially and then 2d8 fire damage at the start of each of their turns for the duration. The target takes half as much initial damage and no subsequent damage on a successful save. At Higher Levels: When you cast this spell using a spell slot of 6th level or higher, all damage instances increase by 1d8 for each slot level above 5th.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Cleric, Paladin",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2465,
        "spell_level": 1,
        "spell_name": "Helm’s Everwatchful Eye",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Illusion",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou call out to the deity known as Helm and plead for the Vigilant One to use his divine grace to help one of your allies in need. You use your reaction to select one creature that you can see within range that has just failed a saving throw and roll a d20. On a roll of 16 or higher, Helm will intervene and allow the target to succeed instead.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, you reduce the die score required by 2 for every slot level above 1st.\\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "Druid, Ranger, Sorcerer, Warlock",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2466,
        "spell_level": 4,
        "spell_name": "Hemorrhage",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou cause a target’s previously healed battle scars to rupture as blood begins exit from these opened wounds. Select a creature within range to make a Constitution saving throw, taking 2d8 slashing damage on a failed save. Additionally, roll a d8 for every two hit dice belonging to the creature. If this number is higher than the target's total hit points at the end of its next turn, it falls to 0 hit points. Temporary hit points do not count towards this total. If the target saves on the initial save, this spell has no effect.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Up to 1 round",
        "spell_id": 2470,
        "spell_level": 0,
        "spell_name": "Hinder",
        "spell_range": "120 feet",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou assault a Medium or smaller creature you can see within range with an invisible force. The creature must succeed on a Strength saving throw or have its movement speed halved until the end of its next turn. At 5th level you can target creature of Large size, at 11th level you can target Huge size, and at 17th level you can target Gargantuan creatures.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Cleric",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2474,
        "spell_level": 2,
        "spell_name": "Holy Missile",
        "spell_range": "120 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou create three glowing darts of holy energy. Each dart hits a creature of your choice that you can see within range. Each dart heals its target for 1d4 hit points. The darts all strike simultaneously, and you can direct them to hit one creature or several.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 hour",
        "spell_id": 2477,
        "spell_level": 2,
        "spell_name": "Howling Downpour",
        "spell_range": "90 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou summon a storm cloud up to 60 feet above the ground at a point you can see in range. After 1d4 rounds, the clouds produce rain at an alarming rate, dousing everything in a 10-foot radius cylinder below the cloud. The rain extinguishes all non-magical fire within the area immediately. As a bonus action on your turn, you can move the cloud up to 30 feet in any direction that does not exceed the spell’s range and to a maximum height of 60 feet.\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2484,
        "spell_level": 0,
        "spell_name": "Ice Shard",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tAn icy shard shoots from your outstretched hand. Make a ranged spell attack against a single creature, dealing 1d6 cold damage on a successful attack. If your attack roll hits by 5 or more the target becomes vulnerable to cold damage until the start of your next turn. Creatures resistant or immune to cold damage do not become vulnerable.\\n\tThis spell’s damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric, Druid, Paladin, Ranger",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 hour",
        "spell_id": 2492,
        "spell_level": 5,
        "spell_name": "Ilmater’s Fortune",
        "spell_range": "1 mile",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou focus on the suffering of all creatures around you. For the duration, you sense the health of any injured creatures within 1 mile of your current location. You learn of their creature type (although not their identity), how critically they are injured, and the nature of any ailments affecting them. Additionally, all restorative spells you cast for the duration gain 2d6 additional hit points of healing and you gain advantage on any Wisdom (Medicine) checks you make.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Wizard",
        "spell_components": "V, S, M (A link of a metal chain)",
        "spell_duration": "8 hours",
        "spell_id": 2497,
        "spell_level": 4,
        "spell_name": "Improved Mage Armor",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a willing creature who isn’t wearing armor, and a protective magical force surrounds it until the spell ends. The target’s base AC becomes 15 + its Dexterity modifier. The spell ends if the target dons armor or if you dismiss the spell as an action.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Druid, Ranger, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2498,
        "spell_level": 1,
        "spell_name": "Inaudible",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tChoose a humanoid that you can see within range. The target must succeed on a Wisdom saving throw or become unable to cast spells that require a verbal component from 1 school of magic for the duration.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, you can select one addition school of magic for each slot level above 1st.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Wizard",
        "spell_components": "V, S, M (a spellbook)",
        "spell_duration": "Instantaneous",
        "spell_id": 2503,
        "spell_level": 1,
        "spell_name": "Injurious Spellbook",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou transmute the two pages of your spellbook that contain the scripture for this spell to detach from the book’s binding and develop razor-sharp edges. Both pages fly out and slice a creature in range, before safely returning to your spellbook and rebinding to their original location. Choose one creature within range or choose two creatures within range that are within 5 feet of each other. For each page, a creature must make a Dexterity saving throw or take 2d8 slashing damage.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 per page (2d8 total) for every two spell slots level above 1st.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S, M (a small piece of brimstone)",
        "spell_duration": "Instantaneous",
        "spell_id": 2504,
        "spell_level": 1,
        "spell_name": "Inner Fire",
        "spell_range": "15 feet",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tThe sheer power of your life force causes the blood of your foes to ignite in an inferno. Cause a creature you can see within range to make a Constitution saving throw or take 1d4 fire damage for every unused hit dice you currently have. You lose up to 1d4 of your remaining hit dice, consumed by the spell.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for every four slot levels above 1st.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Ranger, Wizard",
        "spell_components": "V, S, M (a spider’s leg)",
        "spell_duration": "Up to 10 minutes",
        "spell_id": 2506,
        "spell_level": 2,
        "spell_name": "Insurmountable to Surmountable",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a smooth surface that is difficult or unable to be climbed and transform the landscape to create tiny foot and hand holds in any direction 10 feet wide and up to 60 feet in length. Anyone who attempts to climb the transformed surface makes all Strength (Athletics) checks with a +2 bonus and rolls with advantage.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric, Druid, Paladin, Ranger",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2508,
        "spell_level": 1,
        "spell_name": "Interpret Bone",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a piece of bone from a creature that has been dead for less than a year and are able to see a brief vision of how that creature died.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 10 minutes",
        "spell_id": 2512,
        "spell_level": 6,
        "spell_name": "Investiture of Necrosis",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Divination",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tNecrotic energies race across your body, shedding dim light in a 60-foot radius for the spell's duration. The necrosis doesn't harm you. Until the spell ends, you gain the following benefits: • You are immune to necrotic damage and resistant to poison damage. • Any creature that moves within 5 feet of you for the first time on a turn or ends its turn there takes 1d10 necrotic damage. • You can use your action to create a line of necrotic energy 15 feet long and 5 feet wide extending from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 4d8 necrotic damage on a failed save, or half as much damage on a successful one.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Cleric, Paladin",
        "spell_components": "V, S, M (a dragon’s scale)",
        "spell_duration": "Instantaneous",
        "spell_id": 2516,
        "spell_level": 3,
        "spell_name": "Invocation from Bahamut",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou make a plea to the deity Bahamut, dragon god of justice, to aid an ally. Using your reaction, you allow a creature that you witness fail a saving throw to attempt another save with advantage.\\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "Cleric, Wizard",
        "spell_components": "V, S, M (holy symbol of Kelemvor)",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2522,
        "spell_level": 7,
        "spell_name": "Kelemvor’s Irradiating Beam",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou create a beam of radiant energy that burns undead creatures in a 20-foot radius cylinder up to 100 feet tall centered on a point that you can see within range. The cylinder is considered difficult terrain for undead creatures. When an undead creature enters the cylinder for the first time on a turn or starts its turn there, it must make a Constitution saving throw. On a failed save, the undead creature takes 6d10 radiant damage or half as much on a success. Incorporeal undead automatically fail the save and take maximum damage from the spell. Living creatures are unaffected by the cylinder and it is not difficult terrain for them. Additionally, the cylinder sheds bright light for 60 feet from its center and dim light for another 20 feet. If you're within 60 feet of the cylinder, you can move it up to 30 feet as a bonus action.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 8th level or higher, the damage increases by 1d10 for each slot level above 7th.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 hour",
        "spell_id": 2524,
        "spell_level": 6,
        "spell_name": "Kossuth’s Mark",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou burn a fiery rune in the shape of Kossuth’s symbol into the forehead of a creature. whenever the affected target takes fire damage, it takes an extra 2d6 fire damage. Also, the target suffers disadvantage on Dexterity checks and saving throws.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Sorcerer, Wizard",
        "spell_components": "V, S, M (dust of sneezing and choking)",
        "spell_duration": "Concentration, up to 10 minutes",
        "spell_id": 2527,
        "spell_level": 1,
        "spell_name": "Last Breath",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou raise your hands in a grasping gesture around a creature's neck and begin to fill their lungs with water. The target must succeed on a Constitution saving throw or take 1d8 cold damage, and on your turn(s), you can use your action to deal 1d8 cold damage to the target automatically. While the target is affected by the spell, it is considered to be holding its breath. The target can hold its breath for 1 + its Constitution modifier minutes (minimum of 30 seconds), then begins choking. The spell ends if you use your action to do anything else, end your turn more than 60 feet away from the target, or if the target drops to 0 hit points. This spell has no effect on constructs, undead or creatures that can breathe underwater.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Cleric, Paladin",
        "spell_components": "V, S",
        "spell_duration": "Up to 1 minute",
        "spell_id": 2528,
        "spell_level": 4,
        "spell_name": "Lathander’s Blessing",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou invoke the blessing of Lathander, god of birth and renewal, to aid you in your quest by protecting you against being slain by your foes. For the duration, if a single attack would knock you unconscious or kill you outright, you are instead lowered to 1 hit point and may roll 4d6 and receive that many temporary hit points.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Wizard",
        "spell_components": "V, S, M (a blue sapphire worth at least 30,000 gp, which the spell consumes)",
        "spell_duration": "Instantaneous",
        "spell_id": 2536,
        "spell_level": 8,
        "spell_name": "Levitate Landscape",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou bury a gemstone 1 foot below the surface and begin to enchant the surrounding area with magical energies native to the Elemental Plane of Air. After a strenuous casting recital consisting of 8 hours of uninterrupted devotion, the landscape begins to tear away from its surroundings up to a 250-footradius sphere in any direction from the gemstone, forming an island. Once the spell has been completed, the island begins to lift into the air at a rate of 100 feet per 1 hour. You are able to use your action to stop the island from elevating at any point up to 1 mile above the surface. Once stopped, you are able to move the island by spending 1 hour in an uninterrupted recitation. Doing so will allow you to move the island in any direction at a rate of 20 feet per 1 hour. You may stop the island from moving at any time using your action. The buried gemstone can never be higher than 1 mile above the surrounding ground’s surface. Removing the gemstone from the place it was buried requires a successful arcana and athletic check, each contested by your spell save DC. A success ends the spell, causing the island to fall back towards the surface at a rate of 192 feet per round. You may only have one instance of this spell active at a time. Casting the spell again will cause the other casting of this spell to lose its magical properties and the spell will end.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 9th level, you may have multiple instances of this spell active at a time, and casting the spell again no longer causes previous castings of this spell to end. When you complete the 1-hour recitation to move a Levitated Landscape, you instead move all Levitated Landscapes that you control\\n",
        "spell_time": "8 hours"
    }, {
        "spell_classes": "Bard, Cleric, Druid",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 hour",
        "spell_id": 2544,
        "spell_level": 6,
        "spell_name": "Lingering Vitality",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch one willing creature, infusing its soul with pool of restorative magics that are slowly released over time. Roll 10d8, which becomes the pool of hit points available to the target. As a reaction, the you can heal the target an amount of hit points equal to or less than those remaining in the in the pool.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 7th level or higher, the pool of hit points increases by 2d8 for each slot level above 6th.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Paladin",
        "spell_components": "V, S",
        "spell_duration": "1 minute",
        "spell_id": 2545,
        "spell_level": 5,
        "spell_name": "Linked Lifeblood",
        "spell_range": "Self (15-foot-radius sphere)",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou create a protective tether to your allies, siphoning their pain for 1 minute. You gain temporary hit points equal to your total maximum hit points. An ally within range that would take damage for the duration takes none, and the damage is transferred to you instead. If this damage exceeds your temporary hit points, it is applied to your remaining hit points. The spell ends after the duration or if you die, whichever happens first.\\n\tAt Higher Levels: If you cast this spell with a spell slot of 6th level or higher, the duration is 10 minutes. Spell slots from 7th level increase the duration to an hour, and from 8th level slots the spell lasts until dispelled. Using a spell slot of 6th level or higher allows you to end the spell as an action.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard",
        "spell_components": "S, V or M (an instrument)",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2551,
        "spell_level": 0,
        "spell_name": "Lullaby",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Illusion",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tThis spell sends a creature into a magical slumber. Roll 3d4; this is the amount of hit points this spell can affect. Compare this amount to the hit points of a creature you can see within range of the spell. If the total equals or exceeds the target's hit points, it falls unconscious until the spell ends, the target takes damage, or someone uses an action to shake or slap it awake. If the total is less than the target's hit points, it has disadvantage on Wisdom based skill checks until the spell ends or someone takes a hostile action against it.\\n\tThe amount of hit points this spell can affect increases by 2d4 when you reach 5th level (5d4), 11th level (7d4), and 17th level (9d4).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Up to 10 minutes",
        "spell_id": 2552,
        "spell_level": 3,
        "spell_name": "Lunacy",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou target a creature that you can see within range and pick at the fragile fabric that allows them to maintain their sanity. The creature must make a Wisdom saving throw or roll on the Short-Term Madness Table (DMG, pg.258) and remain under the effect for 1d10 minutes.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2568,
        "spell_level": 2,
        "spell_name": "Mana Burn",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou create a magic ball of glowing energy and launch it at a creature that you can see within range. The target must make an Intelligence saving throw or take 1d6 psychic damage and lose an unused 2nd level spell slot until it completes a long rest. If the target does not have any 2nd level spell slots remaining, it will lose a 1st level spell slot instead.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for every slot level above 2nd. Also, the unused spell slot lost by the target is equal to the spell slot used to cast the spell. If the target does not have an unused slot level of that level to lose, they will lose a spell slot of the next lower level, and so on, until they lose an unused spell slot.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2569,
        "spell_level": 2,
        "spell_name": "Manacle of Burden",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou target two creatures that are within 20 feet of each other within range and cause them to make a Strength saving throw with disadvantage. If both targets fail, they are bound to one another by a spectral manacle of your creation and will split all damage done to them. For the duration, any damage done to either target is halved (rounded down) and then dealt to the other bound creature as well. If the two bound creatures move more than 20 feet apart, the manacle breaks causing 4d6 necrotic damage to each target.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Wizard",
        "spell_components": "V, S, M (object worth at least 500 gp)",
        "spell_duration": "Instantaneous",
        "spell_id": 2570,
        "spell_level": 5,
        "spell_name": "Manifest Mimic",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tA nonmagical object comes to life at your command, in the form mimic. The mimic is charmed by you until you or your companions do anything harmful to it. The DM has the creature’s game statistics.\\n",
        "spell_time": "1 hour"
    }, {
        "spell_classes": "Bard, Druid, Sorcerer, Warlock, Wizard",
        "spell_components": "S",
        "spell_duration": "Concentration, up to 1 hour",
        "spell_id": 2571,
        "spell_level": 0,
        "spell_name": "Manipulate Shadow",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tAs a bonus action, you are able to manipulate the shadow belonging to a creature of medium size or smaller that you can see within range. This manipulation can take several forms, such as making it act out simple actions independent from its owner, move up to 30 feet away from its owner, or to alter its shape one size bigger or smaller than its owner. You may only manipulate one shadow at a time with this spell. Should the source of the shadow move from its original location, the shadow will follow its owner but remain under your control for up to 1 hour within a range of 120 feet.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Cleric, Druid, Sorcerer",
        "spell_components": "V, S, M (a tuft of werewolf fur)",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2572,
        "spell_level": 6,
        "spell_name": "Mantle of Malar",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou adopt a spectral visage of a ravenous wolf spirit. For the duration, creatures of your choice within 30 feet of you gain advantage on attack rolls against their target if at least one of their allies is within 5 feet of that target and the ally isn't incapacitated. Additionally, actions you take on your turn gain special aspects as you channel Malar's bestial will. If you take the Attack action, creatures of your choice within 10 feet of you when you make the attack must make a Wisdom saving throw or be frightened of you until the end of their next turn; if you take the Dash action your jump distance is tripled; if you take the Disengage action, your movement speed increases by 10 feet; if you take the Dodge action, you gain resistance to bludgeoning, piercing, and slashing damage from non-magical weapons that aren't silvered.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard",
        "spell_components": "V, S",
        "spell_duration": "1 minute",
        "spell_id": 2581,
        "spell_level": 3,
        "spell_name": "Mass Vicious Mockery",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou unleash a string of insults laced with subtle enchantments at up to 6 creatures that you can see within range. If the target can hear you (though it need not understand you), it must succeed on a Wisdom saving throw or take 2d4 psychic damage and have disadvantage on the next attack roll it makes before the end of its next turn.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 4th level or higher, the damage increases by 2d4 damage for each slot level above 3rd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S, M (Bat fur and a drop of pitch or piece of coal)",
        "spell_duration": "Up to 1 hour",
        "spell_id": 2594,
        "spell_level": 5,
        "spell_name": "Midnight",
        "spell_range": "120 feet",
        "spell_ritual": null,
        "spell_school": "Illusion",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tMagical darkness spreads from a point you choose within range to fill a 60-foot-radius sphere for the duration. The darkness spreads around corners. A creature with darkvision can’t see through this darkness, and nonmagical light can’t illuminate it. If the point you choose is on an object you are holding or one that isn’t being worn or carried, the darkness emanates from the object and moves with it. Completely covering the source of the darkness with an opaque object, such as a bowl or a helm, blocks the darkness. If any of this spell’s area overlaps with an area of light created by a spell of 5th level or lower, the spell that created the light is dispelled.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "1 round",
        "spell_id": 2602,
        "spell_level": 1,
        "spell_name": "Misery",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou extend your hand and touch a creature while muttering a curse under your breath; one that dwells in a plane of anguish. The creature can make an Intelligence saving throw to understand the effects of your incantation: they have until the start of your next turn to move 60 feet or more from your location. Upon failing to move this distance or choosing not to move, the target must immediately make a Constitution saving throw or become vulnerable to 2 damage types of your choosing for the duration. Creatures resistant or immune to a specified damage type cannot be made vulnerable to that damage type with this spell. A remove curse spell ends this effect.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Ranger, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Up to 24 hours",
        "spell_id": 2616,
        "spell_level": 5,
        "spell_name": "Muffle",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou are able to magically reduce the noise an object makes so that it becomes silent for the duration or until you cast this spell again. If the target object would normally impose disadvantage on Dexterity based skill checks, it no longer does for the duration. You can dismiss this effect as a bonus action.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Cleric, Warlock, Wizard",
        "spell_components": "V, S, M (A piece of cloth)",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2617,
        "spell_level": 3,
        "spell_name": "Mummify",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a creature and utter an ancient curse. The target must make a Strength saving throw or take 2d8 necrotic damage and become restrained as spectral wrappings begin to tighten around their body. Until the spell ends, as a bonus action on each of your turns after this one, you can cause the target to take an additional 2d8 necrotic damage every round after the spell was initially cast. The target can attempt a Strength saving throw at the beginning of their turns to break the binding, ending the spell. A creature that dies while under the effect of this spell becomes cursed. 24 hours after the creature’s death, it rises as a mummy that is hostile towards the party. A remove curse spell ends this effect on the target is cast before it is animated as a mummy but has no effect if cast on a mummy created as the result of this spell.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric",
        "spell_components": "V, S, M (burning incense)",
        "spell_duration": "Instantaneous",
        "spell_id": 2619,
        "spell_level": 1,
        "spell_name": "Murmurs of the Restless",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tThe spirits of those who have died traumatically within the last 24 hours wail out to you in anguish. You are not able to ask them any questions, but rather hear glimpses and sense the emotions from any recently slain creatures within 60 feet as they briefly relive their final moments with you.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Cleric, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2621,
        "spell_level": 6,
        "spell_name": "Myrkul’s Power",
        "spell_range": "Self (30-foot cone)",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou hold your hands with fingers spread, drawing forth life force into your outstretched fingertips. Each creature in a 30-foot cone must make a Constitution saving throw. A creature takes 5d6 necrotic damage on a failed save, or half as much damage on a successful one. You regain hit points equal to half of the total damage dealt.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 7th level or higher, the damage increases by 1d6 for each slot level above 6th.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Ranger, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2622,
        "spell_level": 5,
        "spell_name": "Mystra’s Bequest",
        "spell_range": "10 feet",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou select up to 2 targets within range. The next spell they cast that targets only one creature and doesn’t have a range of self, can target a second creature in range with the same spell.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2624,
        "spell_level": 2,
        "spell_name": "Necrotic Visage",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou evoke a shadowy visage that appears above you. The visage remains until you use your action to make a melee spell attack with your equipped weapon. On a successful attack, your attack is replaced by that of the shadowy visage, who attacks your target with a necrotic scythe, dealing 4d6 necrotic damage and then disappears.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for every two slot levels above 2nd.\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "Warlock, Wizard",
        "spell_components": "S, M (a pinch of salt)",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2627,
        "spell_level": 0,
        "spell_name": "Night Terror",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou conjure a small shadowy figure (10 HP, 14 AC) in an area that you can see within range that remains until it is slain, or the spell ends. As a bonus action on your turn, you can command the shadowy figure to assault the mind of a creature within 30 feet of it. The target must make an Intelligence saving throw or take 1d4 psychic damage.\\n\tThis spell's damage increases by 1d4 when you reach 5th level (2d4), 11th level (3d4), and 17th level (4d4).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Ranger",
        "spell_components": "V, S, M (feather of an owl)",
        "spell_duration": "24 hours",
        "spell_id": 2628,
        "spell_level": 1,
        "spell_name": "Nightowl",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tSelûne gives you her blessing, allowing you to summon the mythical spirit of an owl that appears on your shoulder. The owl cannot attack or carry any objects but understands any simple commands you give it up to a mile away. If not given any commands, the owl will remain upon your shoulder. As a bonus action, you are able to see and hear through the perspective of the spirit owl, but you become blinded and deafened while doing so.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric, Ranger",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 hour",
        "spell_id": 2632,
        "spell_level": 4,
        "spell_name": "Observance",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou heighten the senses of one of your allies. Select a creature that you can see within range and grant them advantage on all Wisdom (Perception) and Intelligence (Investigation) skill checks for the duration. Additionally, the target can attack twice, instead of once, whenever it makes an attack of opportunity using its reaction for the duration.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 5th level or higher, you can select one additional creature for each slot level above 4th.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2633,
        "spell_level": 5,
        "spell_name": "Oghma’s Knowledge Transferal",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou are able to magically transfer your knowledge into another willing creature, allowing them to gain some of your arcane insight. When an ally would cast a spell of 3rd level or lower on their turn, you may use your reaction to grant them access to your list of prepared spells to select from, provided they can be cast at the given level. Your ally's casting of the spell uses their spell slot of the appropriate level, and it behaves as though they cast it for the purposes of concentration, spell attack rolls, and saving throw DC.\\n\tAt Higher Levels: If you cast this spell using a spell slot of 6th level or higher, the spell level that you can cast through an ally increases by one level for each spell level above 5th.\\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "Bard, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2636,
        "spell_level": 6,
        "spell_name": "Oppression",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tEach creature in a 15-foot-radius sphere centered on a point you choose must make a Wisdom save. A target takes 6d6 force damage and suffers disadvantage on saving throws vs magical effects until the start of your next turn on a failed save, or half as much damage and no disadvantage on a success.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 7th level or higher, the damage increases by 2d6 for each slot level above 6th.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric, Druid, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2644,
        "spell_level": 0,
        "spell_name": "Peaceful Valediction",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a slain creature, making it immune to the effects of the animate dead spell for 24 hours.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Wizard",
        "spell_components": "V, S, M (a white dragon’s scale worth 500 gp)",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2645,
        "spell_level": 6,
        "spell_name": "Permafrost",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tAn icy chill passes over your body, giving you a better understanding of winter’s strength. For the duration, when you cast a spell that deals cold damage, you cause your target to become vulnerable to this damage type for the attack. When you cast any spells that deal cold damage to a target that is resistant to that damage type, you cause the target to lose their resistance to cold damage for the attack. When you cast any spells that deal cold damage on a target that is immune to this damage type, you cause your target to become resistant for the attack instead.\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2651,
        "spell_level": 0,
        "spell_name": "Phase",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou may use your reaction in an attempt to phase through a single attack made against you, imposing disadvantage on the attack. If the attack against you is still successful, you become incapacitated until the end of your next turn.\\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2655,
        "spell_level": 4,
        "spell_name": "Plague",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou point at a creature within range, causing a dark green glow to pass over their body. The creature must make a Constitution saving throw or take 4d10 poison damage and become diseased; suffering disadvantage on all attack and skill checks for the duration as their skin begins to pustules all over their body. If the disease is not removed within 1 hour, the creature must make another Constitution saving throw or die. If a creature dies as the result of this spell, every creature within 10 feet must make a Constitution saving throw or become affected by this spell, as if it was initially cast on them. Constructs and undead are immune to the spell.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Druid, Ranger, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Up to 1 hour",
        "spell_id": 2660,
        "spell_level": 3,
        "spell_name": "Poison Darts",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou conjure 2d4 magical darts that last for one hour or until they are used. As an action on your turn, you may expend one of the darts to make a ranged spell attack against a creature you can see within in range. On a successful attack, you deal 2d6 poison damage to the target and force them to make a Constitution saving throw or become poisoned until the end of their next turn. At Higher Levels: When you cast this spell using a spell slot of 4th level or higher, the you summon and additional 1d4 darts and they last for 1 additional hour for each slot level above 3rd.\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "Warlock",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2662,
        "spell_level": 3,
        "spell_name": "Poisoned Heart",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Divination",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a creature, causing its heart to fill with a vile poison. The creature must make a Constitution saving throw or take 2d10 poison damage. At the end of each of the target’s turns before the spell ends, the target must succeed on a Constitution saving throw or take an additional 2d10 poison damage. At any point during the spell, if the target dies as a result of the poison damage from this spell, every creature within 5 feet of the target must make a Constitution saving throw or take 4d10 poison damage, or half as much on a success as the target’s heart explodes.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 4th level or higher, all damage dealt from spell increases by 1d10 for every slot level above 3rd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer",
        "spell_components": "V",
        "spell_duration": "Up to 1 hour",
        "spell_id": 2673,
        "spell_level": 3,
        "spell_name": "Predominance",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou attempt to unleash the power contained within your being. When you first cast this spell, roll a d20. If the result is higher than the difference of 20 and your spellcasting modifier, you gain 3 predominance dice. Within the next hour, you may use each of these dice to gain advantage on a single d20 roll, at which point the die is expended.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Ranger",
        "spell_components": "V, S",
        "spell_duration": "Up to 8 hours",
        "spell_id": 2675,
        "spell_level": 5,
        "spell_name": "Pride of the Wild",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tUp to 10 creatures of your choosing within range have their movement speed doubled for the duration. This effect is removed if a target takes a hostile action towards any creature.\\n",
        "spell_time": "10 minutes"
    }, {
        "spell_classes": "Bard, Cleric, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 10 minutes",
        "spell_id": 2690,
        "spell_level": 6,
        "spell_name": "Psyche Onslaught",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou create a 15-foot-radius sphere of thin hazy mist centered on a point you can see within range. The mist spreads around corners. It lasts for the duration or until strong wind disperses it, ending the spell. Its area is heavily obscured. Creatures in to mist's area have disadvantage on all mental (Intelligence, Wisdom, and Charisma) saving throws and skill checks.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid",
        "spell_components": "V, S, M (plant seed)",
        "spell_duration": "Instantaneous",
        "spell_id": 2693,
        "spell_level": 2,
        "spell_name": "Pullulate",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Illusion",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou plant a seed from a type of plant that used to grow in your current location. Upon touching the ground above the buried seed and speaking a small prayer, the species of the plant begins to regrow, taking 1d4 hours to reach maturity.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Cleric, Paladin",
        "spell_components": "V, S, M (an amulet or holy symbol)",
        "spell_duration": "Concentration, up to 10 minutes",
        "spell_id": 2700,
        "spell_level": 2,
        "spell_name": "Radiating Blade of Tempus",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou call upon Tempus, the god of war, to grant you the ability to strike down your foes in his name. Using your bonus action, you are able to sheathe a melee weapon you possess with a white burning flame. You can use your action to make a melee attack with the fiery blade. On a hit, the target takes the weapon’s normal attack damage plus 1d8 radiant damage. The flaming blade sheds bright light in a 10-foot radius and dim light for an additional 10 feet.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for every two slot levels above 2nd.\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "Bard, Cleric, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 10 minutes",
        "spell_id": 2702,
        "spell_level": 6,
        "spell_name": "Rampart of Dispel Magic",
        "spell_range": "90 feet",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou create a pulsating wall of magical energy that purges magical effects from any creature that passes through it. The wall can be up to 40 feet in diameter, 40 feet high, and 5 feet thick. When you cast this spell, you cannot place it in any occupied space, and it must be placed in spaces that you can see. The wall is visible to all creatures with an Intelligence score higher than 11. Any creature that passes through the wall has any spell of 6th level or lower on them end. Spells 7th level or higher on the target are unaffected.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 7th level or higher, the duration is 1 hour. If you use a spell slot of 8th level or higher, the duration is 24 hours. If you use an 9th level spell slot, the spell lasts for 1 month. Using a spell slot of 7th level or higher grants a duration that does not require Concentration.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Wizard",
        "spell_components": "V, S, M (a red dragon’s scale worth 300gp)",
        "spell_duration": "Instantaneous",
        "spell_id": 2709,
        "spell_level": 4,
        "spell_name": "Raze",
        "spell_range": "Self (15-foot radius)",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou summon a fiery floor of bubbling lava below your feet. Each creature other than you in that area must make a Dexterity saving throw. On a failed save, a creature takes 4d10 fire damage and may only move up to half of their movement speed until the end of their next turn. Creatures that are within 5 feet of you must make the Dexterity saving throw with disadvantage. Creatures take half damage and do not lose any movement speed on a successful saving throw.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 5th level or higher, the radius of the spell increases by 5 feet for every slot level above 4th.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric, Druid",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2715,
        "spell_level": 0,
        "spell_name": "Renew",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tWhen you have at least one Hit Die remaining, you may touch a willing creature and spend a single hit die, healing your target for that amount + your Constitution modifier. A creature can only receive the benefit of this spell once per long rest.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Wizard",
        "spell_components": "V, S, M (Some hair, fingernail clippings, or other piece of your body; and a ruby worth 2,500 gp, which is consumed by the spell)\\n    ",
        "spell_duration": "Permanent",
        "spell_id": 2717,
        "spell_level": 9,
        "spell_name": "Replicate",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou create a duplicate of yourself that is similar to you in every way at the time of casting. You can communicate with your duplicate telepathically, and it obeys all of your commands. Your duplicate has all of the same abilities (though none of your equipment), spells and features that you do, but these become shared resources between you both. If your duplicate casts a spell, you both lose the corresponding spell slot, for example. Your duplicate ages at the same rate as you do and is immune to the dispel magic spell. You may only have one duplicate active at a time, and your duplicate is not able to cast the replicate spell. The duplicate dies when it drops to 0 hit points, ending spell ends. If you die while your duplicate is still alive, your soul is transferred to it, and it becomes your new form, ending the spell.\\n",
        "spell_time": "12 hours"
    }, {
        "spell_classes": "Bard, Cleric, Paladin, Sorcerer",
        "spell_components": "V",
        "spell_duration": "Up to 10 minutes",
        "spell_id": 2718,
        "spell_level": 3,
        "spell_name": "Reshape Destiny",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou can change an outcome that the cosmic forces have foretold. As a reaction, you can allow a creature you can see within range that just failed a death saving throw to succeed instead. Additionally, future death saving throws are made with advantage until the creature is either stabilized or dies, whichever happens first.\\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2721,
        "spell_level": 3,
        "spell_name": "Return",
        "spell_range": "45 feet",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tUsing your reaction, you can cause a target creature to return to the space they occupied at the start of their previous turn. Select a creature that you can see within range, forcing them to make a Charisma saving throw or be teleported back to their point of origin in their previous turn if you can see their destination. A target can choose to fail this saving throw if they wish. If the space the target would be teleported into is occupied by another creature or an object, the target and the space-occupier each take 1d10 force damage, and the target must move to another space within 5 feet of the destination.\\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "Bard, Cleric, Wizard",
        "spell_components": "V, S, M (a war horn)",
        "spell_duration": "Concentration, up to 1 hour",
        "spell_id": 2722,
        "spell_level": 7,
        "spell_name": "Reveille",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou summon warriors to fight for you and your allies with a blast through a war horn that calls them to arms. Choose between a Knight or a Veteran; the chosen creature appears within range, as well as a squad of auxiliary warriors composed of 2d4+4 Guards or Bandits, respectively. The summoned warriors are friendly to you and your companions for the duration. Roll initiative for the warriors, which have their own turns. They obey any verbal commands that you issue to them (no action required by you). If you don't issue any commands to the warriors, they defend themselves from hostile creatures but otherwise take no actions. If your concentration is broken, the warriors don't disappear. Instead, you lose command of them, and they become neutral to you and your companions, following the command of the Knight or Veteran (as appropriate). Uncontrolled warriors can't be dismissed by you and disappear 1 hour after they are summoned. The DM has the warriors' statistics.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 8th level, the number of auxiliary warriors you may summon increases to 2d6+6. When you cast it using a spell slot of 9th level, this number increases to 2d8+8, or you may summon 12 auxiliary warriors and an additional Knight or Veteran, which must be of the same type as the initial choice.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2728,
        "spell_level": 1,
        "spell_name": "Rot",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou extend your hand toward a creature you can see within range and infect the target with a horrible disease, causing their flesh to form pustules and smell of decay. The creature must succeed on a Constitution saving throw or take 2d12 necrotic damage, or half on a success.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d12 for each slot level above 1st.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2729,
        "spell_level": 5,
        "spell_name": "Ruin",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou create a maelstrom of fire and brimstone in a 20foot-radius sphere at a point you can see within range. When a creature enters the area for the first time on a turn or starts its turn there, it must make a Constitution saving throw. On a failed save, the creature takes 5d8 fire damage or half as much on a success. Constructs and structures automatically fail the save and the spell deals maximum damage.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d10 for each slot level above 5th.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Ranger",
        "spell_components": "V, S, M (dragon scale worth 300 gp)",
        "spell_duration": "Concentration, up to 1 hour",
        "spell_id": 2736,
        "spell_level": 3,
        "spell_name": "Scaleskin",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Illusion",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a willing creature. Until the spell ends, the target's skin has a smooth, scale-like appearance, and the target's AC can't be less than 18, regardless of what kind of armor it is wearing. Also, the target becomes resistant to a single damage type depending on what type of dragon scale you use: white (cold), red (fire), blue (lightning), black (acid), or green (poison).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Cleric",
        "spell_components": "V, S, M (a ruby worth 1,000 gp)",
        "spell_duration": "Up to 1 minute",
        "spell_id": 2739,
        "spell_level": 8,
        "spell_name": "Scornful Mantle of the Undaunted",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a willing creature and strengthen its resolve, allowing it to become dauntless in the face of untold danger. For the duration, the target becomes immune to all condition effects. If the target is currently affected with any condition other than unconscious or exhaustion, casting this spell will remove those conditions from the target. Additionally, if a single source of damage would kill the target, the target health is set to 1 hit point instead, and the spell ends.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2740,
        "spell_level": 0,
        "spell_name": "Scourge",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Illusion",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a target with the tip of your finger, transferring a dark green energy that flows through your finger and infects the target. Make a melee spell attack against the target. On a hit, the target takes 1d4 necrotic damage and suffers disadvantage on its next Constitution saving throw.\\n\tThis spell's damage increases by 1d4 when you reach 5th level (2d4), 11th level (3d4), and 17th level (4d4).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2752,
        "spell_level": 2,
        "spell_name": "Shadow Bind",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou take control of the shadow belonging to a creature to restrain its master. Make a ranged spell attack against a creature that you can see within range, dealing 2d6 necrotic damage and grappling the target. The grappled creature can use an action to make a strength or dexterity check (creature's choice) against your spellcasting DC, ending the spell if successful. You are not able to control a target’s shadow when either are in bright light.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 2d6 for each slot level above 2nd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2755,
        "spell_level": 0,
        "spell_name": "Shadow Embrace",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou cause shadows to manifest around a creature within range. The target must make a Wisdom saving throw or receive a -2 penalty to their attack rolls and disadvantage on Dexterity saving throws until the end of their next turn as they become engulfed by a dark embrace.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Sorcerer, Warlock, Wizard",
        "spell_components": "S, M (an empty vial)",
        "spell_duration": "1 hour",
        "spell_id": 2756,
        "spell_level": 0,
        "spell_name": "Shadow Ink",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou pull shadows into a swirling mass inside an empty vial you possess. As long as the vial is open, you are able to use its new contents as 1 ounce of pitch-black ink. If the vial is stoppered, or 1-hour passes, the ink dissipates back into shadow; any writing that has already been made with the ink is unaffected.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Ranger, Wizard",
        "spell_components": "V",
        "spell_duration": "Instantaneous",
        "spell_id": 2762,
        "spell_level": 1,
        "spell_name": "Shed Skin",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou channel the peculiarity of reptiles and gain the ability to shed your skin the same manner as a snake. If cast while you are being grappled, the condition ends, and you can move up to 15 feet away from your target without provoking any attacks of opportunity.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Cleric, Paladin",
        "spell_components": "V, S",
        "spell_duration": "Up to 10 minutes",
        "spell_id": 2764,
        "spell_level": 1,
        "spell_name": "Shield of Devotion",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tA gleaming shield appears round a creature of your choice within range, causing any critical hit against them to become a normal hit. They also gain 1d8 temporary hit points for the duration.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Ranger",
        "spell_components": "V, S, M (a small diamond worth at least 50 gp, which the spell consumes)",
        "spell_duration": "Instantaneous",
        "spell_id": 2773,
        "spell_level": 2,
        "spell_name": "Silvanus’ Blessing",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou return a dead beast you touch to life, provided that it has been dead no longer than 8 hours. If the beast’s soul is both willing and at liberty to rejoin the body, the beast returns to life with half of its total hit points, rejuvenated by the blessing of Silvanus. This spell also neutralizes any poisons and cures nonmagical diseases that affected the beast at the time it died. This spell doesn’t, however, remove magical diseases, curses, or similar effects; if these aren’t first removed prior to casting the spell, they take effect when the beast returns to life. This spell closes all mortal wounds, but it doesn’t restore missing body parts. If the creature is lacking body parts or organs integral for its survival—its head, for instance—the spell automatically fails.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Ranger, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 hour",
        "spell_id": 2774,
        "spell_level": 2,
        "spell_name": "Silvanus’ Favor",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Divination",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a willing beast. Until the spell ends, the beast’s non-magical attacks become magical attacks with a +1 bonus to attack rolls and damage rolls.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 4th level or higher, the bonus increases to +2. When you use a spell slot of 6th level or higher, the bonus increases to +3.\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "Druid, Ranger",
        "spell_components": "V",
        "spell_duration": "Instantaneous",
        "spell_id": 2778,
        "spell_level": 1,
        "spell_name": "Skein of Vines",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tWhen you are unwillingly pushed or pulled in any direction, you call forth vines from the ground to wrap around your legs and keep you in place and remain until the start of your next turn. This spell can only be cast while you are on solid ground.\\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "Bard, Ranger",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2781,
        "spell_level": 1,
        "spell_name": "Slashing Step",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou enter a semi-ethereal state as you move with increased swiftness. Until the end of your turn, your movement speed increases by 15, and you may move through the spaces of enemy creatures without invoking attacks of opportunity. As part of your action, you may make a single melee attack against any creature whose space you pass through along your path, doing your normal attack damage on a hit.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Up to 1 minute",
        "spell_id": 2786,
        "spell_level": 1,
        "spell_name": "Smolder",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou focus on fanning the flames that burn within your soul. Using your bonus action, you are able to add an additional 1d8 fire damage to the next source of fire damage you deal.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for every slot level above 1st.\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "Sorcerer, Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2790,
        "spell_level": 6,
        "spell_name": "Soultap",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou embrace the life force that flows inside all living beings within range. As bonus action, you can take 1d6 necrotic damage from every creature that you choose within range. When you make your next spell attack, you can add this amount of damage to your attack.\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2792,
        "spell_level": 0,
        "spell_name": "Spare the Living",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Illusion",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou siphon out what little life force a living creature has left. Select a creature that you can see within range that has 0 hit points and force them to immediately make a Death saving throw. This spell has no effect on undead or constructs.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Warlock, Wizard",
        "spell_components": "V, S, M (Onyx dust worth 50 gp, which the spell consumes)",
        "spell_duration": "Instantaneous",
        "spell_id": 2798,
        "spell_level": 3,
        "spell_name": "Spectral Steed",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou summon a spirit that assumes the form of an unusually intelligent, strong, and loyal steed, creating a long-lasting bond with it. Appearing in an unoccupied space within range, the steed takes on a form that you choose: a warhorse, a pony, a camel, an elk, or a mastiff. The steed has the statistics of the chosen form, though it is an incorporeal undead creature instead of its normal type, and gains the Incorporeal Movement trait, although it cannot use it while mounted. Additionally, if your steed has an Intelligence of 5 or less, its Intelligence becomes 6, and it gains the ability to understand one language of your choice that you speak. Your steed serves you as a mount, both in combat and out, and you have an instinctive bond with it that allows you to fight as a seamless unit. While mounted on your steed, you can make any spell you cast that targets only you also target your steed. When the steed drops to 0 hit points, it disappears, leaving behind no physical form. You can also dismiss your steed at any time as an action, causing it to disappear. In either case, casting this spell again summons the same steed, restored to its hit point maximum. While your steed is within 1 mile of you, you can communicate with it telepathically. You can’t have more than one steed bonded by this spell at a time. As an action, you can release the steed from its bond at any time, causing it to disappear.\\n",
        "spell_time": "10 minutes"
    }, {
        "spell_classes": "Wizard",
        "spell_components": "V, S",
        "spell_duration": "Up to 1 minute",
        "spell_id": 2801,
        "spell_level": 4,
        "spell_name": "Spellsteal",
        "spell_range": "30 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou cause a creature you can see within range to make a Wisdom saving throw. On a failed save, you place a minor hex on them. The next spell they attempt to cast of 3rd level or lower fails and has no effect. When they fail to cast a spell in this manner, you are able to immediately cast it using your reaction instead. Casting a spell in this manner grants you temporary insight into how the spell is cast even if it is not on your available spell list and does not use a spell slot. The spell is not added to your spellbook.\\n\tAt Higher Levels: If you cast this spell using a spell slot of 5th level or higher, the spell level that you can affect increases by one level for each spell level above 4th.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Warlock",
        "spell_components": "V",
        "spell_duration": "10 minutes",
        "spell_id": 2803,
        "spell_level": 3,
        "spell_name": "Sphere of Deceit",
        "spell_range": "120 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou create a magical zone that enables deception in a 15-foot-radius sphere on a point of your choice within range. Until the spell ends, any creatures of your choosing that enter the spell's area gain advantage on all Deception skill checks. Additionally, any creatures in the spell’s area that you do not grant this bonus must make a Wisdom saving throw or suffer disadvantage on all Wisdom (Insight) checks made while in the area. When the spell ends, they know that they were deceived in this manner.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 4th level or higher, the radius of the sphere is increased by 10 feet for every slot level above 3rd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Ranger",
        "spell_components": "V, S",
        "spell_duration": "10 minutes",
        "spell_id": 2818,
        "spell_level": 3,
        "spell_name": "Steady Terrain",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou transform the ground, allowing you and your allies to traverse it with ease. Select a point that you can see within range, removing all difficult terrain within 60 of that point. If the terrain is difficult due to a magical spell, this spell negates that condition of the other spell if it was cast at 3rd level or lower. When cast on a surface that would require Strength (Climbing) checks to traverse, any creatures you choose can make those checks with advantage.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 4th level or higher, the radius increases by 30 feet for every slot level above 3rd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Ranger",
        "spell_components": "V, S, M (a handful of sticks)",
        "spell_duration": "Concentration, up to 1 hour",
        "spell_id": 2820,
        "spell_level": 4,
        "spell_name": "Sticks to Snakes",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou transform a bundle of sticks into a Swarm of Poisonous Snakes. The swarm turns back into sticks when it drops to 0 hit points or when the spell ends. The summoned swarm is friendly to you and your companions. The swarm has its own turn, which immediately follows your own on the initiative order. It obeys any verbal commands that you issue to it (no action required by you). If you don’t issue any commands to it, the swarm defends itself from hostile creatures, but otherwise takes no actions. The DM has the creatures’ statistics.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Ranger",
        "spell_components": "V, S, M (a feather)",
        "spell_duration": "Up to 10 minutes",
        "spell_id": 2825,
        "spell_level": 1,
        "spell_name": "Storm of Arrows",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Divination",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou chant a minor incantation, brushing the arrows in your quiver with a feather. Upon finishing the casting, spectral duplicates of your arrows appear at a point in the sky in range, forming a 10-foot radius cylinder up to 100 feet tall. Any creatures in the cylinder must make a Dexterity saving throw or take 3d6 piercing damage, or half damage on a failed save.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each spell slot level above 1st.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Paladin",
        "spell_components": "V",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2837,
        "spell_level": 5,
        "spell_name": "Sundering Smite",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Enchantment",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tThe next time you hit with a melee weapon attack during the spell's duration, your attack deals an extra 6d8 radiant damage. The target must make a Strength save or suffer a -5 AC penalty until the end of its next turn.\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "Sorcerer",
        "spell_components": "V",
        "spell_duration": "Instantaneous",
        "spell_id": 2838,
        "spell_level": 2,
        "spell_name": "Surge of Chaos",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tWhen you are forced to roll on the wild magic table, you can choose to use your bonus action to reroll on the table after seeing the result of your first roll. You must take the second result.\\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "Bard, Cleric, Druid",
        "spell_components": "V, S, M (diamonds worth at least 10,000 gp, which the spell consumes)",
        "spell_duration": "Up to 24 hours",
        "spell_id": 2843,
        "spell_level": 9,
        "spell_name": "Tamara’s Rebirth",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou touch a willing creature that has 1 or more hit points, infusing it with a blessing from Tamara, dragon goddess of life, light and mercy. If the target dies during the duration, for any reason except old age, the blessing is triggered. If its soul is free and willing, the target returns to life at the start of its next turn with hit points equal to half its hit point maximum. As a bonus action on the same turn, the target can expend as many of its hit dice as it chooses to heal itself. Roll each die spent, adding your Constitution modifier to each, and regain a number of hit points equal to the total. This spell closes all wounds, neutralizes any poison, cures all diseases, and lifts any curses affecting the creature when it died. The spell replaces damaged or missing organs and limbs. The spell can even provide a new body if the original no longer exists. The target then appears in an unoccupied space you choose within 10 feet of where it died.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 10 minutes",
        "spell_id": 2857,
        "spell_level": 0,
        "spell_name": "Thieves’ Ruse",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou make an object up to 5 pounds that you possess invisible for up to 10 minutes. Once the spell ends, you can't make the same object invisible again for 24 hours.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Sorcerer",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2862,
        "spell_level": 3,
        "spell_name": "Thunderous Bellow",
        "spell_range": "Self (20-foot cone)",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou shout a thunderous phrase that bursts outward from your location. Each creature in a 20-foot cone must make a Constitution saving throw. A creature takes 4d8 thunder damage and is pushed 15 feet away from you on a failed save, or half as much damage and is not pushed on a success.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard",
        "spell_components": "V or S",
        "spell_duration": "Instantaneous",
        "spell_id": 2863,
        "spell_level": 0,
        "spell_name": "Thunderous Cord",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou release a blast of sound with your voice (verbal component) or an instrument you possess (somatic component). A creature that you can see within range must make a Constitution saving throw or take 2d4 thunder damage and it becomes deafened until the start of your next turn.\\n\tThis spell’s damage increases by 2d4 when you reach 5th level (4d4), 11th (6d4), and 17th (8d4).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Cleric, Paladin",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2873,
        "spell_level": 4,
        "spell_name": "Torm’s Safeguard",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou invoke the blessing of Torm, god of courage, to offer you his protection. As an action on your turn, your body is coated in a white shimmering light, offering bright light for 20 feet and dim light for another 20. Additionally, you are granted 35 temporary hit points and any attack rolls you make against fiends are done with advantage for the duration. The spell ends when the temporary hit points have been used or 1-minute passes, whichever happens first.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Ranger",
        "spell_components": "V, S",
        "spell_duration": "Up to 8 hours",
        "spell_id": 2876,
        "spell_level": 2,
        "spell_name": "Track",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou are able to identify the tracks made by a creature if you possess one thing that belonged to the creature. You also gain advantage on Wisdom based skill checks related to the target for the duration.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Cleric, Warlock",
        "spell_components": "V, S",
        "spell_duration": "Instantaneous",
        "spell_id": 2894,
        "spell_level": 0,
        "spell_name": "Unholy Flame",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tA purple flame descends on a creature that you can see within range. The target must succeed on a Dexterity saving throw or take 1d8 necrotic damage. The target gains no benefit from cover for this saving throw.\\n\tThis spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Warlock, Wizard",
        "spell_components": "V, S",
        "spell_duration": "Up to 10 minutes",
        "spell_id": 2899,
        "spell_level": 7,
        "spell_name": "Vampiric Aura",
        "spell_range": "Self (30-foot-radius)",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tA necrotic aura emanates from you, leeching the life out of your foes. For the duration, when you or any allies within 30 feet of you damage an enemy, they gain half of the damage done as temporary hit points.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 8th level or higher, the you can extend the radius by 10 feet for each slot level above 7th.\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "Paladin",
        "spell_components": "V",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2901,
        "spell_level": 3,
        "spell_name": "Vaporous Smite",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Necromancy",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tThe next time you hit a creature with a melee weapon attack during this spell’s duration, your weapon flares with a misty white shroud and the attack deals an extra 3d8 radiant damage to the target. Immediately after the attack, your form turns into a gaseous vapor and you are able to travel up to 15 feet without provoking attacks of opportunity. You return to your normal form at the end of your turn.\\n",
        "spell_time": "1 bonus action"
    }, {
        "spell_classes": "Bard, Paladin, Warlock",
        "spell_components": "V, S, M (a drop of the target’s blood)",
        "spell_duration": "Up to 1 hour",
        "spell_id": 2902,
        "spell_level": 5,
        "spell_name": "Vehement Inquiry",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou can force a creature to answer your questions in a truthful manner. Upon casting this spell, you immediately lose 1d8 of your remaining hit dice as a sacrifice. You must have at least eight hit dice to cast this spell. You touch a target for which you have a sample of their blood and cause them to make a Wisdom saving throw at disadvantage. If the target fails, they must answer up to 2d4 of your questions. The target must respond, must speak the truth and cannot provide an answer that is misleading in any way.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Wizard",
        "spell_components": "V, S, M (a small moonstone)",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2903,
        "spell_level": 2,
        "spell_name": "Veil of Elements",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Abjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou summon a swirling mass of elements in a 15foot-radius, 40-foot-tall cylinder centered on a point you can see within range. Each creature that begins their turn in the veil or moves into it during their turn must make a Dexterity saving throw. A creature takes 3d6 damage from an element of your choosing (cold, fire, lightning, thunder) on a failed save, or half as much on a successful one, which expends that damage type from the veil. The spell ends once all four damage types are expended, or the spell’s duration is reached.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, the damage increases of each element increases 1d6 for each slot level above 2nd.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Ranger, Sorcerer, Wizard",
        "spell_components": "V, S",
        "spell_duration": "1 round",
        "spell_id": 2905,
        "spell_level": 5,
        "spell_name": "Vengeance of Talos",
        "spell_range": "5 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou channel the rage of Talos, god of storms, to strike down a foe where it stands. Make a melee attack with a weapon. On hit, the target suffers the attack’s normal effects plus 6d8 lightning damage and becomes stunned. Additionally, every creature of large size or smaller other than yourself within 20 feet of the target must make a Dexterity saving throw or be knocked prone, regardless of whether the initial attack was successful.\\n\tAt Higher Levels: When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d8 for each slot level above 5th.\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Bard, Druid",
        "spell_components": "V, M (a melee weapon)",
        "spell_duration": "Concentration, up to 1 minute",
        "spell_id": 2906,
        "spell_level": 0,
        "spell_name": "Venomous Strike",
        "spell_range": "5 feet",
        "spell_ritual": null,
        "spell_school": "Evocation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou imbue your weapon with a deadly poison. The next time you hit a creature with a weapon attack, the attack deals an additional 1d6 poison damage. If your attack roll hits by 5 or more, the target becomes poisoned until the end of their next turn. Targets resistant or immune to poison damage do not become poisoned.\\n\tThis spell deals an additional 1d6 poison damage on a successful attack when you reach 5th level (2d6), 11th level (3d6) and 17th level (4d6).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Druid, Wizard",
        "spell_components": "V, S, M (two dead rats)",
        "spell_duration": "Concentration, up to 8 hours",
        "spell_id": 2907,
        "spell_level": 4,
        "spell_name": "Vermintide",
        "spell_range": "60 feet",
        "spell_ritual": null,
        "spell_school": "Conjuration",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou conjure two huge swarms of rats in any location you can see within range. Each swarm dies when it drops to 0 hit points. The swarms are friendly to you and your companions. Roll initiative for the swarms, which have their own turns. They obey any verbal commands that you issue to them (no action required by you). If you don’t issue any commands, each swarm will spend its turn seeking out the nearest source of food. If a swarm is alive after 8 hours, you will lose your control over it and the swarm will disband into an appropriate number of tiny rats. You can recast the spell before it expires to regain control over the swarms again. The DM has the swarms’ statistics (216 hit points, other stats as Swarm of Rats).\\n",
        "spell_time": "1 action"
    }, {
        "spell_classes": "Sorcerer, Wizard",
        "spell_components": "V",
        "spell_duration": "1 round",
        "spell_id": 2912,
        "spell_level": 5,
        "spell_name": "Wall",
        "spell_range": "Self",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tAn invisible barrier of magical force appears and protects you. Until the start of your next turn, you have a +7 bonus to AC and impose disadvantage on attacks made against you, including against the triggering attack, and you take no damage from magic missile.\\n",
        "spell_time": "1 reaction"
    }, {
        "spell_classes": "Cleric, Druid, Ranger",
        "spell_components": "V, S",
        "spell_duration": "Concentration, up to 10 minutes",
        "spell_id": 2947,
        "spell_level": 1,
        "spell_name": "Zen Archery",
        "spell_range": "Touch",
        "spell_ritual": null,
        "spell_school": "Transmutation",
        "spell_sources": "Grimlores Grimoire",
        "spell_text": "\tYou allow your insight to guide attacks made with ranged weapons. For the duration, when you make an attack with a ranged weapon, you can use your spellcasting ability modifier instead of Dexterity for all attack and damage rolls.\r\n",
        "spell_time": "1 action"
    }
]
